Repository: pypi-data/pypi-mirror-403
Catalog: packages/mkdocs-quiz/mkdocs_quiz-1.5.2-py3-none-any.whl/mkdocs_quiz/locales/*.po
Languages: es

source: Submit
es: Enviar

source: Question {n}
es: Pregunta {n}

source: Quiz Progress
es: Progreso del cuestionario

source: questions answered
es: preguntas respondidas

source: correct
es: correctas

source: Quiz Complete!
es: ¡Cuestionario completado!

source: Reset quiz
es: Reiniciar cuestionario

source: Quiz results are saved to your browser's local storage and will persist between sessions.
es: Los resultados del cuestionario se guardan en el almacenamiento local de tu navegador y persistirán entre sesiones.

source: Outstanding! You aced it!
es: ¡Excepcional! ¡Lo has clavado!

source: Great job! You really know your stuff!
es: ¡Buen trabajo! ¡Realmente conoces el tema!

source: Good effort! Keep learning!
es: ¡Buen esfuerzo! ¡Sigue aprendiendo!

source: Not bad, but there's room for improvement!
es: ¡No está mal, pero hay margen de mejora!

source: Better luck next time! Keep trying!
es: ¡Mejor suerte la próxima vez! ¡Sigue intentándolo!

source: Are you sure you want to reset the quiz? This will clear your progress.
es: ¿Estás seguro de que quieres reiniciar el cuestionario? Esto borrará tu progreso.

source: Try Again
es: Intentar de nuevo

source: Correct answer!
es: ¡Respuesta correcta!

source: Incorrect answer. Please try again.
es: Respuesta incorrecta. Por favor, inténtalo de nuevo.

source: Incorrect answer.
es: Respuesta incorrecta.

source: Answered:
es: Respondidas:

source: Correct:
es: Correctas:

source: Reset
es: Reiniciar

source: (empty)
es: (vacío)
