Repository: pypi-data/pypi-mirror-403
Catalog: packages/akademy-matriculation-confirmation/akademy_matriculation_confirmation-1.1.0-py3-none-any.whl/trytond/modules/akademy_matriculation_confirmation/locale/*.po
Languages: fr

# field:akademy_matriculation.wizmatriculation.create.start,classes:
source: Turma
fr: Classe

# field:akademy_matriculation.wizmatriculation.create.start,is_student:
source: Discente
fr: Étudiant

# field:akademy_matriculation.wizmatriculation.create.start,student:
source: Discente
fr: Étudiant

source: Discente
fr: Étudiant

source: Turma
fr: Classe

# help:akademy_matriculation.wizmatriculation.create.start,classes:
source: Informa o nome da turma.
fr: Indiqué le nom de la classe.

# help:akademy_matriculation.wizmatriculation.create.start,is_student:
source: Confirmação de matrícula para estudante.
fr: Confirmation d'inscription pour l'étudiant.

# help:akademy_matriculation.wizmatriculation.create.start,student:
source: Caro utilizador será feita a matrícula do discente.
fr: Cher utilisateur,l'inscription de l'étudiant va être effectuée..

source: Escolha o discente.
fr: Choisissez l'étudiant.

source: Escolha a turma onde será feita a mudança.
fr: Choisissez la classe dans laquelle le changement sera effectué.

source: ChangeMatriculation CreateStart
fr: Démarrer la création de la modification d'inscription

# model:ir.ui.menu,name:akademy_changematriculation
source: Mudança de matrícula
fr: Modification de l'inscription

source: Cancelar
fr: Annuler

source: Mudar
fr: Modifier
