Repository: pypi-data/pypi-mirror-403
Catalog: packages/wagtail-reusable-blocks/wagtail_reusable_blocks-0.7.2.tar.gz/wagtail_reusable_blocks-0.7.2/src/wagtail_reusable_blocks/locale/*/LC_MESSAGES/django.po
Languages: bg, fr

source: Wagtail Reusable Blocks
bg: Многократно използваеми блокове (Reusable Blocks) в Wagtail
fr: Blocs Réutilisables Wagtail

source: Maximum nesting depth exceeded
bg: Превишена е максималната дълбочина на влагане.
fr: Profondeur d'imbrication maximale dépassée

source: Preview Head Injection
bg: Преглед на вмъкването в head
fr: Aperçu de l'injection d'en-tête

source: Image
bg: Изображение

source: Select an image to display
bg: Изебрете изображение, което да се показва
fr: Sélectionner une image à afficher

source: Image with responsive format support
bg: Изображение с поддръжка на адаптивни (responsive) формати
fr: Image avec prise en charge du format responsive

source: Select a layout template with slot placeholders
bg: Изберете шаблон за оформление със слотове
fr: Sélectionner un modèle de mise en page avec des emplacements

source: Fill the slots in this layout template
bg: Запълнете слотовете в този шаблон
fr: Remplir les emplacements dans ce modèle de mise en page

source: Reusable Layout
bg: Многократно използваемо оформление
fr: Mise en page réutilisable

source: Layout template with customizable content slots
bg: Шаблон за оформление с персонализируеми слотове
fr: Modèle de mise en page avec des emplacements de contenu personnalisables

source: The slot identifier to fill (e.g., 'main', 'sidebar')
bg: Идентификатор на незапълнен слот (напр. 'main', 'sidebar')
fr: L'identifiant de l'emplacement à remplir (ex: 'main', 'sidebar')

source: Slot ID
bg: Идентификатор на слот
fr: ID de l'emplacement

source: Content to inject into this slot
bg: Съдържание, което може да бъде добавено към този слот
fr: Contenu à injecter dans cet emplacement

source: Slot Content
bg: Съдържание на слот
fr: Contenu de l'emplacement

source: Slot Fill
bg: Попълване на слот
fr: Remplissage d'emplacement

source: Fill a specific slot with content
bg: Запълнете конкретен слот със съдържание
fr: Remplir un emplacement spécifique avec du contenu

source: Reusable Block
bg: Многократно използваем блок
fr: Bloc réutilisable

source: name
bg: име
fr: nom

source: Human-readable name for this reusable block
bg: Човекоразбираемо име за този многократно използваем блок
fr: Nom lisible pour ce bloc réutilisable

source: slug
bg: Кратко име (slug)

source: URL-safe identifier, auto-generated from name
bg: Идентификатор, безопасен за URL, генериран автоматично от името
fr: Identifiant URL sécurisé, généré automatiquement à partir du nom

source: content
bg: Съдържание
fr: contenu

source: The content of this reusable block
bg: Съдържанието на този многократно използваем блок
fr: Le contenu de ce bloc réutilisable

source: Reusable Blocks
bg: Многократно използваеми блокове
fr: Blocs Réutilisables

source: Circular reference detected: Block '%(name)s' (id=%(id)s) references itself in the dependency chain.
bg: Циклична зависимост: блокът '%(name)s' (id=%(id)s) се позовава на себе си.
fr: Référence circulaire détectée : le bloc '%(name)s' (id=%(id)s) se référence lui-même dans la chaîne de dépendances.

source: Circular reference detected: Block '%(name)s' references block '%(ref_name)s' which creates a cycle. %(error)s
bg: Циклична зависимост: '%(name)s' се позовава на '%(ref_name)s', създавайки цикъл. %(error)s
fr: Référence circulaire détectée : le bloc '%(name)s' référence le bloc '%(ref_name)s' ce qui crée un cycle. %(error)s

source: Cache cleared for '%(name)s'.
bg: Кешът на '%(name)s' е изчистен
fr: Cache vidé pour '%(name)s'.

source: All ReusableBlock cache entries have been cleared.
bg: Всички кеш записи за многократно използваемите блокове бяха изчистени.
fr: Toutes les entrées de cache des blocs réutilisables ont été vidées.

source: Clear Cache
bg: Изчисти кеша
fr: Vider le cache
