Repository: pypi-data/pypi-mirror-403
Catalog: packages/dsetool.policy/dsetool_policy-1.0.3.tar.gz/dsetool_policy-1.0.3/src/dsetool/policy/locales/*/LC_MESSAGES/euphorie.po
Languages: bg, da, es, fi, fr, hu, lt, mt, nl, pl

source: label_report_completion_threshold
bg: Праг на завършване за достъпност на доклада
da: Fuldførelsestærskel for rapporttilgængelighed
es: Umbral de finalización para la disponibilidad del informe
fi: Raportin saatavuuden valmiusprosentti
fr: Seuil d'achèvement pour la disponibilité du rapport
hu: Befejező küszöb a jelentés elérhetőségéhez
lt: Užbaigimo riba ataskaitos prieinamumui
mt: Sogħla ta' kompletament għall-disponibbiltà tar-rapport
nl: Voltooiingsdrempel voor rapportbeschikbaarheid
pl: Próg zakończenia dla dostępności raportu

source: label_report_inventory
bg: Добри практики и насоки
da: Gode praksisser og vejledning
es: Buenas prácticas y orientación
fi: Hyvät käytännöt ja ohjeet
fr: Bonnes pratiques et conseils
hu: Jó gyakorlatok és útmutatók
lt: Gerosios praktikos ir vadovėliai
mt: Prattiċi tajba u gwida
nl: Goede praktijken en begeleiding
pl: Dobre praktyki i wskazówki

source: label_report_inventory_short
bg: Кратък доклад от въпросника
da: Kort spørgeskemarapport
es: Informe breve de cuestionario
fi: Lyhyt kyselyraportti
fr: Rapport de questionnaire court
hu: Rövid kérdőíves jelentés
lt: Trumpa apklausos ataskaita
mt: Rapport qasir dwar il-kwistjoner
nl: Kort vragenlijstrapport
pl: Krótki raport z ankiety

source: label_send_email_reminder
bg: Изпратете имейл напомняне
da: Send emailpåmindelse
es: Enviar recordatorio por correo electrónico
fi: Lähetä sähköpostimuistutus
fr: Envoyer un rappel par e-mail
hu: E-mail emlékeztető küldése
lt: Siųsti el. pašto priminimą
mt: Ibgħat promemorja bl-email
nl: Stuur een e-mail herinnering
pl: Wyślij przypomnienie e-mail

source: label_show_immediate_feedback
bg: Покажете препоръките като незабавна обратна връзка
da: Vis anbefalinger som øjeblikkelig feedback
es: Mostrar recomendaciones como retroalimentación inmediata
fi: Näytä suositukset välittömänä palautteena
fr: Montrer les recommandations comme un retour d'information immédiat
hu: Ajánlások megjelenítése azonnali visszajelzésként
lt: Parodyti rekomendacijas kaip tiesioginį atsiliepimą
mt: Uri r-rakkomandazzjonijiet bħala feedback immedjat
nl: Toon aanbevelingen als directe feedback
pl: Pokaż rekomendacje jako natychmiastowe informacje zwrotne

source: label_start_identification
bg: Започнете идентификацията на риска
da: Start risikoidentifikation
es: Iniciar Identificación de Riesgos
fi: Aloita riskin tunnistaminen
fr: Commencer l'identification des risques
hu: Kockázatazonosítás Indítása
lt: Pradėti rizikos identifikavimą
mt: Ibda l-Identifikazzjoni tar-Riskju
nl: Start Risico Identificatie
pl: Rozpocznij identyfikację ryzyka

source: label_start_survey
bg: Старт
da: Start
es: Iniciar
fi: Aloita
fr: Commencer
hu: Kezdés
lt: Pradėti
mt: Ibda
nl: Start
pl: Rozpocznij

source: label_start_test_session
bg: Започнете тестова сесия
da: Start en testsession
es: Iniciar una sesión de prueba
fi: Aloita testisessio
fr: Commencer une session de test
hu: Tesztfolyamat indítása
lt: Pradėkite testavimo sesiją
mt: Ibda sessjoni ta' test
nl: Start een testsessie
pl: Rozpocznij sesję testową

source: message_no_validation_requested
bg: В този момент не се изисква валидация.
da: Der anmodes ikke om validering på dette tidspunkt.
es: No se solicita ninguna validación en este momento.
fi: Validointia ei pyydetä tällä hetkellä.
hu: Jelenleg nincs szükség érvényesítésre.
lt: Šiuo metu nėra reikalaujama jokių patvirtinimų.
mt: Mhux hemm validaċċjoni mistennija f'dan il-ħin.
pl: W tej chwili nie jest wymagana żadna walidacja.

source: navigation_email_reminder
bg: Имейл напомняне
da: Emailpåmindelse
es: Recordatorio por correo electrónico
fi: Sähköpostimuistutus
fr: Email de rappel
hu: E-mail emlékeztető
lt: El. pašto priminimas
mt: Promemorja bl-email
nl: E-mail herinnering
pl: Przypomnienie e-mail

source: oira_name_line_1
bg: Опасни вещества
da: Farlige stoffer
es: Sustancias Peligrosas
fi: Vaaralliset aineet
fr: Substances dangereuses
hu: Veszélyes anyagok
lt: Pavojingos medžiagos
mt: Sustanzi Perikolużi
nl: Gevaarlijke Stoffen
pl: Niebezpieczne substancje

source: oira_name_line_2
bg: eTool
da: eTool
es: eTool
fi: eTool
fr: eTool
hu: eTool
lt: eTool
mt: eTool
nl: eTool
pl: eTool

source: register_teaser
bg: Нямате акаунт? Тогава, моля, първо се ${register_link}.
da: Har du ikke en konto? Så venligst ${register_link} først.
es: ¿No tienes una cuenta? Entonces por favor ${register_link} primero.
fi: Eikö sinulla ole tiliä? Rekisteröidy ensin ${register_link}.
fr: Vous n'avez pas de compte? Alors s'il vous plaît ${register_link} en premier.
hu: Nincs fiókja? Akkor kérjük először ${register_link}.
lt: Neturite paskyros? Tuomet pirmiausia ${register_link}.
mt: M'għandekx kont? Allura jekk jogħġbok ${register_link} l-ewwel.
nl: Heb je nog geen account? Registreer dan eerst via ${register_link}.
pl: Nie masz konta? Proszę najpierw ${register_link}.

source: report_intro_incomplete
bg: Когато сте завършили оценката до поне ${completion_threshold}% ще можете да създадете доклад.
da: Når du har afsluttet vurderingen til mindst ${completion_threshold}% vil du være i stand til at oprette en rapport.
es: Cuando haya terminado la evaluación al menos al ${completion_threshold}% podrá crear un informe.
fi: Kun olet suorittanut arvioinnin vähintään ${completion_threshold}% prosenttia, voit luoda raportin.
fr: Lorsque vous avez terminé l'évaluation à au moins ${completion_threshold}% vous pourrez créer un rapport.
hu: Amikor a felmérést legalább ${completion_threshold}%-ig elvégezte, képes lesz jelentést készíteni.
lt: Kai užbaigsite vertinimą bent ${completion_threshold}% galėsite sukurti ataskaitą.
mt: Meta tkun temm l-eżami biex tal-anqas ${completion_threshold}% ser tkun tista' toħloq rapport.
nl: Wanneer u de beoordeling tot minstens ${completion_threshold}% heeft voltooid, kunt u een rapport aanmaken.
pl: Gdy zakończysz ocenę co najmniej na ${completion_threshold}% będziesz mógł stworzyć raport.

source: request_an_email_reminder
bg: нулирайте паролата си
da: nulstil din adgangskode
es: restablece tu contraseña
fi: nollaa salasanasi
fr: réinitialiser votre mot de passe
hu: jelszó visszaállítása
lt: atkurkite savo slaptažodį
mt: irresetta l-password tiegħek
nl: reset je wachtwoord
pl: zresetuj swoje hasło

source: text_create_account
bg: ${link_register}, ако искате да използвате OiRA.
da: ${link_register} hvis du gerne vil bruge OiRA.
es: ${link_register} si te gustaría usar OiRA.
fi: ${link_register} jos haluat käyttää OiRAa.
fr: ${link_register} si vous souhaitez utiliser OiRA.
hu: ${link_register}, ha szeretné használni az OiRA-t.
lt: ${link_register}, jei norite naudoti OiRA.
mt: ${link_register} jekk tixtieq tuża OiRA.
nl: ${link_register} als je OiRA wilt gebruiken.
pl: ${link_register} jeśli chcesz korzystać z OiRA.

source: text_test_session
bg: ${link_test_session}, ако искате просто да опитате OiRA.
da: ${link_test_session} hvis du kun vil smage OiRA.
es: ${link_test_session} si solo quieres probar OiRA.
fi: ${link_test_session} jos haluat vain maistaa OiRAa.
fr: ${link_test_session} si vous voulez seulement goûter à OiRA.
hu: ${link_test_session}, ha csak kipróbálná az OiRA-t.
lt: ${link_test_session}, jei norite tik paragauti OiRA.
mt: ${link_test_session} jekk trid biss toħloq OiRA.
nl: ${link_test_session} als je OiRA gewoon wilt proeven.
pl: ${link_test_session} jeśli chcesz tylko spróbować OiRA.

source: tooltip_start_test_session
bg: Започнете нова тест сесия
da: Start en ny testsession
es: Iniciar una nueva sesión de prueba
fi: Aloita uusi testisessio
fr: Commencer une nouvelle session de test
hu: Új tesztfolyamat indítása
lt: Pradėti naują testavimo sesiją
mt: Ibda sessjoni ta' test ġdida
nl: Start een nieuwe testsessie
pl: Rozpocznij nową sesję testową

source: verb_register
bg: Регистрирайте се
da: Registrer
es: Registrarse
fi: Rekisteröidy
fr: S'inscrire
hu: Regisztráció
lt: Registruotis
mt: Irreġistra
nl: Registreren
pl: Zarejestruj

source: Questions
es: Preguntas
lt: Klausimai

source: Quick Start
es: Inicio rápido
lt: Greita pradžia

source: label_continue
da: Fortsæt
pl: Kontynuuj
