Repository: pypi-data/pypi-mirror-403
Catalog: packages/dsetool.policy/dsetool_policy-1.0.3.tar.gz/dsetool_policy-1.0.3/src/dsetool/policy/locales/*/LC_MESSAGES/euphorie.po
Languages: bg, da, es, fi, fr, hu, lt, mt, nl, pl

source: email_reminder_intro
bg: Ако искате да продължите да използвате този инструмент по-късно, можем да ви изпратим напомнящ имейл с връзка към тази оценка.
da: Hvis du ønsker at fortsætte med at bruge dette værktøj på et senere tidspunkt, kan vi sende dig en påmindelsesemail med et link til denne vurdering.
es: Si desea continuar usando esta herramienta en un momento posterior, podemos enviarle un correo electrónico de recordatorio con un enlace a esta evaluación.
fi: Jos haluat jatkaa tämän työkalun käyttöä myöhemmin, voimme lähettää sinulle muistutussähköpostin, jossa on linkki tähän arviointiin.
fr: Si vous souhaitez continuer à utiliser cet outil à un moment ultérieur, nous pouvons vous envoyer un e-mail de rappel avec un lien vers cette évaluation.
hu: Ha később szeretné folytatni ennek az eszköznek a használatát, küldhetünk Önnek emlékeztető e-mailt a felmérésre mutató hivatkozással.
lt: Jeigu norėtumėte vėliau tęsti naudojimąsi šiuo įrankiu, galime išsiųsti priminimo el. laišką su nuoroda į šį vertinimą.
mt: Jekk tixtieq tkompli tuża din il-għodda f'punt ieħor fit-tul taż-żmien, nistgħu nibgħatulek promemorja bl-email b'link għal din il-valutazzjoni.
nl: Als u deze tool later wilt blijven gebruiken, kunnen we u een herinneringse-mail sturen met een link naar deze beoordeling.
pl: Jeżeli chciałbyś kontynuować korzystanie z tego narzędzia w późniejszym czasie, możemy wysłać Ci przypomnienie e-mailem z linkiem do tej oceny.

source: email_reminder_main
bg: Това е вашето напомняне да продължите оценката си с инструмента \
da: Dette er din påmindelse om at fortsætte din vurdering med værktøjet \
es: Este es su recordatorio para continuar su evaluación con la herramienta \
fi: Tämä on muistutuksesi jatkaa arviointiasi työkalulla \
fr: C'est votre rappel pour continuer votre évaluation avec l'outil \
hu: Ez az emlékeztető, hogy folytassa a felmérést az eszközzel \
lt: Tai jūsų priminimas tęsti vertinimą su šiuo įrankiu \
mt: Din hija il-promemorja tiegħek biex tkompli l-valutazzjoni tiegħek mal-għodda \
nl: Dit is uw herinnering om uw beoordeling met de tool voort te zetten \
pl: To jest twoje przypomnienie, aby kontynuować ocenę narzędziem \

source: header_email_reminder
bg: Имейл напомняне
da: Email påmindelse
es: Recordatorio por correo electrónico
fi: Sähköpostimuistutus
fr: Email de rappel
hu: E-mail emlékeztető
lt: El. pašto priminimas
mt: Promemorja bl-email
nl: E-mail herinnering
pl: Przypomnienie e-mail

source: header_options
bg: Опции
da: Muligheder
es: Opciones
fi: Vaihtoehdot
fr: Options
hu: Opciók
lt: Variantai
mt: Għażliet
nl: Opties
pl: Opcje

source: header_recommendations
bg: Препоръки
da: Anbefalinger
es: Recomendaciones
fi: Suositukset
fr: Recommandations
hu: Ajánlások
lt: Rekomendacijos
mt: Rakkomandazzjonijiet
nl: Aanbevelingen
pl: Rekomendacje

source: header_register
bg: Регистрирай се
da: Registrer
es: Registrarse
fi: Rekisteröidy
fr: S'inscrire
hu: Regisztráció
lt: Registruotis
mt: Irreġistra
nl: Registreren
pl: Zarejestruj

source: help_allow_multiple_options
bg: Ако е активно, се показват квадратчета за отметка, за да се позволи избирането на повече от една опция. В противен случай се използват радио бутони, за да се наложи единичен избор.
da: Hvis aktive, vises afkrydsningsfelter for at tillade valg af mere end én mulighed. Ellers bruges radioknapper til at tvinge et enkelt valg.
es: Si está activo, se muestran casillas de verificación para permitir seleccionar más de una opción. De lo contrario, se utilizan botones de radio para forzar una única selección.
fi: Jos aktiivinen, valintaruudut näytetään, jotta voidaan valita useampi kuin yksi vaihtoehto. Muuten radiopainikkeita käytetään pakottamaan yksi valinta.
fr: Si activé, des cases à cocher sont affichées pour permettre de sélectionner plus d'une option. Sinon, des boutons radio sont utilisés pour forcer une seule sélection.
hu: Ha aktív, jelölőnégyzetek jelennek meg, amelyek lehetővé teszik több opció kiválasztását. Ellenkező esetben rádiógombokat használnak egyetlen kiválasztásra kényszerítésre.
lt: Jei aktyvuota, langeliuose yra rodomi pasirinkimai, leidžiantys pasirinkti daugiau nei vieną variantą. Kitu atveju, naudojami žymekliai, priverčiantys pasirinkti tik vieną variantą.
mt: Jekk attiv, checkboxes jintwera biex tippermetti li tagħżel aktar minn għażla waħda. Inkella, radio buttons jintużaw biex ikun hemm bżonn li jagħżel waħda biss.
nl: Als dit actief is, worden selectievakjes getoond om meer dan één optie te kunnen selecteren. Anders worden radioknoppen gebruikt om een enkele selectie te forceren.
pl: Jeśli opcja jest aktywna, pokazywane są pola wyboru, aby umożliwić wybranie więcej niż jednej opcji. W przeciwnym razie używane są przyciski radiowe, aby wymusić pojedynczy wybór.

source: help_enable_email_reminder
bg: Предложете изпращане на имейл напомняне за този инструмент
da: Tilbyd at sende en emailpåmindelse om dette værktøj
es: Ofrecer enviar un recordatorio por correo electrónico sobre esta herramienta
fi: Tarjoa lähettämään sähköpostimuistutus tästä työkalusta
fr: Proposer d'envoyer un email de rappel à propos de cet outil
hu: Ajtánlat arra, hogy e-mailben emlékeztetőt küldjünk erről az eszközről
lt: Siūlykite išsiųsti el. pašto priminimą apie šį įrankį
mt: Toffri li tibgħat promemorja bl-email dwar din il-għodda
nl: Bied aan om een herinneringse-mail te sturen over deze tool
pl: Zaproponuj wysłanie przypomnienia e-mailem o tym narzędziu

source: help_logo_upload
bg: Логото ще се появи на страницата с преглед на сектора на вашата страна. Уверете се, че изображението ви е във формат png, jpg или gif и не съдържа специални символи. Новото лого ще стане видимо, след като сте запазили промените си и публикували инструмента OiRA.
da: Logoet vil fremgå på sektorens oversigtsside i dit land. Sørg for at dit billede er i formatet png, jpg eller gif og ikke indeholder nogen specialtegn. Det nye logo vil kun blive synligt, når du har gemt dine ændringer og udgivet OiRA-værktøjet.
es: El logotipo aparecerá en la página de resumen del sector de su país. Asegúrese de que su imagen tiene formato png, jpg o gif y no contiene caracteres especiales. El nuevo logotipo solo se mostrará después de haber guardado sus cambios y publicado la herramienta OiRA.
fi: Logo näkyy maasi toimialakatsauksessa. Varmista, että kuvasi on png-, jpg- tai gif-muodossa eikä sisällä erikoismerkkejä. Uusi logo tulee näkyviin vasta, kun olet tallentanut muutoksesi ja julkaissut OiRA-työkalun.
fr: Le logo apparaîtra sur la page de vue d'ensemble du secteur de votre pays. Assurez-vous que votre image est au format png, jpg ou gif et ne contient aucun caractère spécial. Le nouveau logo ne deviendra visible qu'après avoir enregistré vos modifications et publié l'outil OiRA.
hu: A logo az Ön országának ágazati áttekintő oldalán fog megjelenni. Győződjön meg róla, hogy képe png, jpg vagy gif formátumú, és nem tartalmaz semmilyen speciális karaktert. Az új logo csak miután mentette a változtatásokat és közzétette az OiRA eszközt lesz látható.
lt: Logotipas bus matomas jūsų šalies sektoriaus apžvalgos puslapyje. Įsitikinkite, kad jūsų paveikslėlis yra png, jpg arba gif formato ir neapima jokių specialiųjų simbolių. Naujas logotipas bus matomas tik po to, kai išsaugosite pakeitimus ir publikuosite OiRA įrankį.
mt: Il-logo se jidher fuq il-paġna ta' l-overview tas-settur tal-pajjiż tiegħek. Kun żgur li l-immaġni tiegħek hija tal-format png, jpg jew gif u ma fihomx karattri speċjali. Il-logo l-ġdid se jsir visibbli biss wara li ssalvja t-tibdil tagħkom u tippubblika l-għodda OiRA.
nl: Het logo verschijnt op de sectoroverzichtspagina van uw land. Zorg ervoor dat uw afbeelding van het formaat png, jpg of gif is en geen speciale tekens bevat. Het nieuwe logo wordt pas zichtbaar nadat u uw wijzigingen heeft opgeslagen en de OiRA-tool heeft gepubliceerd.
pl: Logo pojawi się na stronie podglądu sektora twojego kraju. Upewnij się, że twój obraz jest w formacie png, jpg lub gif i nie zawiera żadnych specjalnych znaków. Nowe logo będzie widoczne dopiero po zapisaniu zmian i opublikowaniu narzędzia OiRA.

source: help_module_recommendation
bg: Ако този модул се използва като част от инструмент за инвентаризация, този текст с препоръки ще бъде използван като въведение в доклада преди да бъдат изброени отделните препоръки.
da: Hvis denne modul bruges som en del af et lagerstyringsværktøj, vil denne anbefalingstekst blive brugt som en introduktion i rapporten før individuelle anbefalinger er listet.
es: Si este módulo se utiliza como parte de una herramienta de inventario, este texto de recomendación se utilizará como introducción en el informe antes de que se enumeren las recomendaciones individuales.
fi: Jos tätä moduulia käytetään osana inventaarionhallintatyökalua, tätä suositustekstiä käytetään johdatuksena raportissa ennen yksittäisten suositusten luettelointia.
fr: Si ce module est utilisé dans le cadre d'un outil d'inventaire, ce texte de recommandation sera utilisé comme introduction dans le rapport avant que les recommandations individuelles ne soient répertoriées.
hu: Ha ezt a modult leltári eszköz részeként használják, ez az ajánló szöveg bevezetőként lesz használva a jelentésben, mielőtt az egyedi ajánlásokat felsorolnák.
lt: Jei šis modulis naudojamas kaip dalis inventoriaus įrankio, šis rekomendacijos tekstas bus naudojamas kaip įvadas ataskaitoje prieš išdėstant atskiromis ypatybėmis.
mt: Jekk dan il-modul jintuża bħala parti mill-għodda tal-inventarju, dan it-test tar-rakkomandazzjoni jintuża bħala introduzzjoni fir-rapport qabel ma jinżammu r-rakkomandazzjonijiet individwali.
nl: Als deze module wordt gebruikt als onderdeel van een inventaristool, zal deze aanbevelingstekst worden gebruikt als introductie in het rapport voordat individuele aanbevelingen worden opgesomd.
pl: Jeśli ten moduł jest używany jako część narzędzia inwentaryzacyjnego, ten tekst z rekomendacją będzie używany jako wprowadzenie do raportu przed wyszczególnieniem poszczególnych rekomendacji.

source: help_password_requirements
bg: Паролата трябва да е с дължина поне 12 символа и да съдържа поне една малка буква, една главна буква и една цифра.
da: Adgangskoden skal være mindst 12 tegn lang og skal indeholde mindst et lille bogstav, et stort bogstav og et tal.
es: La contraseña debe tener al menos 12 caracteres de longitud y debe contener al menos una letra minúscula, una letra mayúscula y un dígito.
fi: Salasanan on oltava vähintään 12 merkkiä pitkä ja siinä on oltava vähintään yksi pieni kirjain, yksi iso kirjain ja yksi numero.
fr: Le mot de passe doit contenir au moins 12 caractères et doit contenir au moins une lettre minuscule, une lettre majuscule et un chiffre.
hu: A jelszónak legalább 12 karakter hosszúnak kell lennie, és tartalmaznia kell legalább egy kisbetűt, egy nagybetűt és egy számjegyet.
lt: Slaptažodis turi būti ne mažesnis kaip 12 simbolių ir turi turėti bent vieną mažąją raidę, vieną didžiąją raidę ir vieną skaitmenį.
mt: Il-Password trid tkun mill-inqas 12-il karattru twil u għandha tinkludi mill-inqas ittra ta 'isfel, ittra kbira u numru.
nl: Het wachtwoord moet minimaal 12 karakters lang zijn en moet minimaal één kleine letter, één hoofdletter en één cijfer bevatten.
pl: Hasło musi mieć co najmniej 12 znaków i zawierać co najmniej jedną małą literę, jedną dużą literę i jedną cyfrę.

source: help_recommendation_text
bg: Текст за включване в доклада
da: Tekst der skal medtages i rapporten
es: Texto a incluir en el informe
fi: Raporttiin sisällytettävä teksti
fr: Texte à inclure dans le rapport
hu: A jelentésben szereplő szöveg
lt: Tekstas, kuris bus įtrauktas į ataskaitą
mt: Test li għandu jinkludi fir-rapport
nl: Tekst die in het rapport moet worden opgenomen
pl: Tekst do zamieszczenia w raporcie

source: home_link
bg: Табло
da: Dashboard
es: Tablero
fi: Hallintapaneeli
fr: Tableau de bord
hu: Vezérlőpult
lt: Prietaisų skydelis
mt: Dashboard
nl: Dashboard
pl: Pulpit

source: incorrect_login
bg: Името ви за вход и/или паролата бяха въведени неправилно. Моля, проверете и опитайте отново или ${request_an_email_reminder}.
da: Dit loginnavn og/eller adgangskode blev indtastet forkert. Kontroller venligst og prøv igen eller ${request_an_email_reminder}.
es: Tu nombre de usuario y/o contraseña se han introducido de forma incorrecta. Por favor, comprueba y vuelve a intentarlo o ${request_an_email_reminder}.
fi: Kirjautumisnimesi ja/tai salasanasi syötettiin väärin. Tarkista ja yritä uudelleen tai ${request_an_email_reminder}.
fr: Votre nom d'utilisateur et/ou mot de passe ont été saisis incorrectement. Veuillez vérifier et essayer à nouveau ou ${request_an_email_reminder}.
hu: A bejelentkezési nevét és/vagy jelszavát helytelenül adta meg. Kérjük, ellenőrizze és próbálja újra, vagy ${request_an_email_reminder}.
lt: Jūsų prisijungimo vardą ir/arba slaptažodį įvedėte neteisingai. Patikrinkite ir bandykite dar kartą arba ${request_an_email_reminder}.
mt: Il-login name tiegħek u/jew il-password daħħlu b’mod żbaljat. Jekk jogħġbok iċċekkja u erġa’ pprova jew ${request_an_email_reminder}.
nl: Uw inlognaam en/of wachtwoord zijn onjuist ingevoerd. Controleer en probeer opnieuw of ${request_an_email_reminder}.
pl: Twoja nazwa użytkownika i/lub hasło zostały wprowadzone niepoprawnie. Sprawdź i spróbuj ponownie lub ${request_an_email_reminder}.

source: info_login
bg: Уважаеми потребител, за да може да използвате инструмента и да получите всички функционалности, се изисква да влезете в профила си.
da: Kære bruger, for at kunne bruge værktøjet og få alle funktioner, skal du være logget ind.
es: Estimado usuario, para poder usar la herramienta y obtener todas las funcionalidades, se te solicita que inicies sesión.
fi: Hyvä käyttäjä, jotta voisit käyttää työkalua ja saada kaikki toiminnot, sinun tulee kirjautua sisään.
fr: Cher utilisateur, afin de pouvoir utiliser l'outil et bénéficier de toutes ses fonctionnalités, vous devez vous connecter.
hu: Tisztelt felhasználó, ahhoz, hogy használni tudja az eszközt és minden funkciót elérjen, be kell jelentkeznie.
lt: Gerbiamas vartotojau, norint naudoti įrankį ir gauti visas funkcijas, turite prisijungti.
mt: Utent għażiż, sabiex tkun tista 'tuża l-għodda u tikseb il-funzjonalità kollha, hija meħtieġa li tidħol.
nl: Beste gebruiker, om de tool te kunnen gebruiken en alle functionaliteiten te krijgen, wordt u verzocht in te loggen.
pl: Drogi użytkowniku, aby móc korzystać z narzędzia i uzyskać wszystkie funkcje, musisz się zalogować.

source: info_register
bg: Моля, ако нямате потребител, регистрирайте се първо.
da: Hvis du ikke har en bruger, skal du registrere dig først.
es: Por favor, si no tienes un usuario, regístrate primero.
fi: Jos sinulla ei ole käyttäjää, rekisteröidy ensin.
fr: Veuillez, si vous n'avez pas d'utilisateur, vous inscrire en premier.
hu: Kérjük, ha nincs felhasználója, először regisztráljon.
lt: Jeigu neturite vartotojo, pirmiau užsiregistruokite.
mt: Jekk jogħġbok, jekk m'għandekx utent, irreġistra l-ewwel.
nl: Alsjeblieft, als je nog geen gebruiker hebt, registreer dan eerst.
pl: Proszę, jeżeli nie masz jeszcze użytkownika, najpierw zarejestruj się.

source: intro_identification_dsetool
bg: Въпросите са разделени на 3 части. Първата част е за идентифициране на потенциални химични рискове във вашата компания. Втората част е за рутините за управление на химичния риск. А третата част е за контролни мерки за намаляване на химичните рискове.
da: Spørgsmålene er delt op i 3 dele. Den første del handler om at identificere potentielle kemiske risici i din virksomhed. Den anden del handler om rutinerne for håndtering af kemisk risiko. Og den tredje del handler om kontrolforanstaltninger til at reducere kemiske risici.
es: Las preguntas se dividen en 3 partes. La primera parte trata sobre la identificación de posibles riesgos químicos en su empresa. La segunda parte trata sobre las rutinas de gestión de riesgos químicos. Y la tercera parte trata sobre las medidas de control para reducir los riesgos químicos.
fi: Kysymykset on jaettu kolmeen osaan. Ensimmäinen osa koskee mahdollisten kemiallisten riskien tunnistamista yrityksessäsi. Toinen osa koskee kemiallisten riskien hallinnan rutiineja. Ja kolmas osa koskee toimenpiteitä kemiallisten riskien vähentämiseksi.
fr: Les questions sont divisées en 3 parties. La première partie concerne l'identification des risques chimiques potentiels dans votre entreprise. La deuxième partie concerne les routines de gestion des risques chimiques. Et la troisième partie concerne les mesures de contrôle pour réduire les risques chimiques.
hu: A kérdések 3 részre vannak osztva. Az első rész a potenciális kémiai kockázatok azonosításáról szól céges szinten. A második rész a kémiai kockázatkezelési rutinokról szól. És a harmadik rész a kémiai kockázatokat csökkentő ellenőrzési intézkedésekről szól.
lt: Klausimai padalinti į 3 dalis. Pirmoji dalis yra apie galimų cheminių rizikų identifikavimą jūsų įmonėje. Antroji dalis yra apie cheminės rizikos valdymo rutinas. O trečioji dalis yra apie kontrolės priemones, skirtas mažinti chemines rizikas.
mt: Il-mistoqsijiet huma maqsuma f'3 partijiet. L-ewwel parti hija dwar l-identifikazzjoni tar-riskji kimiċi potenzjali fil-kumpanija tiegħek. It-tieni parti hija dwar ir-rutini għall-maniġment tar-riskju kimiku. U t-tielet parti hija dwar il-miżuri ta' kontroll biex tnaqqas ir-riskji kimiċi.
nl: De vragen zijn verdeeld in 3 delen. Het eerste deel gaat over het identificeren van mogelijke chemische risico's in uw bedrijf. Het tweede deel gaat over de routines voor chemisch risicobeheer. En het derde deel gaat over controlemaatregelen om chemische risico's te verminderen.
pl: Pytania są podzielone na 3 części. Pierwsza część dotyczy identyfikacji potencjalnych ryzyk chemicznych w twojej firmie. Druga część dotyczy rutynowego zarządzania ryzykiem chemicznym. Trzecia część dotyczy działań kontrolnych mających na celu zmniejszenie ryzyka chemicznego.

source: label_action_plan
bg: План за действие
da: Handlingsplan
es: Plan de Acción
fi: Toimintasuunnitelma
fr: Plan d'action
hu: Cselekvési terv
lt: Veiksmų planas
mt: Pjan ta 'Azzjoni
nl: Actieplan
pl: Plan Działania

source: label_agree_terms_conditions
bg: Съгласен съм с ${link_terms_conditions}
da: Jeg er enig i ${link_terms_conditions}
es: Estoy de acuerdo con ${link_terms_conditions}
fi: Hyväksyn ${link_terms_conditions}
fr: J'accepte ${link_terms_conditions}
hu: Egyetértek a(z) ${link_terms_conditions} feltételekkel
lt: Aš sutinku su ${link_terms_conditions}
mt: Naqbel mal- ${link_terms_conditions}
nl: Ik ga akkoord met de ${link_terms_conditions}
pl: Zgadzam się z ${link_terms_conditions}

source: label_allow_multiple_options
bg: Позволяване на множество опции
da: Tillad flere muligheder
es: Permitir múltiples opciones
fi: Salli useita vaihtoehtoja
fr: Autoriser plusieurs options
hu: Több opció engedélyezése
lt: Leisti keletą variantų
mt: Ħalli għażliet multipli
nl: Meerdere opties toestaan
pl: Zezwól na wiele opcji

source: label_data_protection_notice
bg: Известие за защита на данните
da: Databeskyttelsesmeddelelse
es: Aviso de protección de datos
fi: Tietosuojailmoitus
fr: Avis de protection des données
hu: Adatvédelmi nyilatkozat
lt: Duomenų apsaugos pranešimas
mt: Avviż dwar il-Protezzjoni tad-Data
nl: Mededeling inzake gegevensbescherming
pl: Informacja o ochronie danych

source: label_edit_organisation
bg: Редактиране на организация
da: Rediger Organisation
es: Editar Organización
fi: Muokkaa organisaatiota
fr: Modifier l'Organisation
hu: Szervezet szerkesztése
lt: Redaguoti organizaciją
mt: Editja l-Organizzazzjoni
pl: Edytuj organizację

source: label_email
bg: E-mail адрес
da: Emailadresse
es: Dirección de correo electrónico
fi: Sähköpostiosoite
fr: Adresse électronique
hu: Email cím
lt: Elektroninio pašto adresas
mt: Indirizz tal-Email
nl: E-mailadres
pl: Adres e-mail

source: label_enable_email_reminder
bg: Активиране на имейл напомняне?
da: Aktiver email påmindelse?
es: ¿Habilitar recordatorio por correo electrónico?
fi: Ota käyttöön sähköpostimuistutus?
fr: Activer le rappel par e-mail?
hu: E-mail emlékeztetőt engedélyez?
lt: Įjungti el. pašto priminimą?
mt: Tħalli attiva l-promemorja bl-email?
nl: E-mail herinnering inschakelen?
pl: Włączyć przypomnienie e-mail?

source: label_evaluation
bg: Оценка
da: Evaluering
es: Evaluación
fi: Arviointi
fr: Évaluation
hu: Értékelés
lt: Įvertinimas
mt: Valutazzjoni
nl: Evaluatie
pl: Ewaluacja

source: label_first_name_optional
bg: Име (незадължително)
da: Fornavn (valgfrit)
es: Nombre (opcional)
fi: Etunimi (valinnainen)
fr: Prénom (facultatif)
hu: Keresztnév (nem kötelező)
lt: Vardas (nebūtinas)
mt: Isem l-ewwel (opzjonali)
nl: Voornaam (optioneel)
pl: Imię (opcjonalnie)

source: label_forgot_password
bg: Забравих паролата си
da: Jeg har glemt min adgangskode
es: Olvidé mi contraseña
fi: Unohdin salasanani
fr: J'ai oublié mon mot de passe
hu: Elfelejtettem a jelszavam
lt: Aš pamiršau savo slaptažodį
mt: Nesa l-password tiegħi
nl: Ik ben mijn wachtwoord vergeten
pl: Zapomniałem mojego hasła

source: label_identification
bg: Идентификация
da: Identifikation
es: Identificación
fi: Tunnistaminen
fr: Identification
hu: Azonosítás
lt: Identifikacija
mt: Identifikazzjoni
nl: Identificatie
pl: Identyfikacja

source: label_keep_logged_in
bg: Запомни ме.
da: Hold mig logget ind.
es: Mantenerme conectado.
fi: Pidä minut kirjautuneena.
fr: Gardez-moi connecté.
hu: Maradjon bejelentkezve.
lt: Palik mane prisijungusį.
mt: Iżomm regħbi indaħħlu.
nl: Houd me ingelogd.
pl: Zapamiętaj mnie.

source: label_last_name_optional
bg: Фамилия (незадължително)
da: Efternavn (valgfrit)
es: Apellido (opcional)
fi: Sukunimi (valinnainen)
fr: Nom (facultatif)
hu: Vezetéknév (nem kötelező)
lt: Pavardė (nebūtina)
mt: Kunjom (opzjonali)
nl: Achternaam (optioneel)
pl: Nazwisko (opcjonalnie)

source: label_learn_more
bg: Научете повече
da: Lær mere
es: Aprende más
fi: Lue lisää
fr: En savoir plus
hu: Tudjon meg többet
lt: Sužinokite daugiau
mt: Tagħlim aktar
nl: Leer meer
pl: Dowiedz się więcej

source: label_login
bg: Влезте
da: Log ind
es: Iniciar sesión
fi: Kirjaudu sisään
fr: Se connecter
hu: Bejelentkezés
lt: Prisijungti
mt: Illoggja
nl: Inloggen
pl: Zaloguj się

source: label_login_password
bg: Парола
da: Adgangskode
es: Contraseña
fi: Salasana
fr: Mot de passe
hu: Jelszó
lt: Slaptažodis
mt: Password
nl: Wachtwoord
pl: Hasło

source: label_module_recommendation
bg: Препоръка
da: Anbefaling
es: Recomendación
fi: Suositus
fr: Recommandation
hu: Ajánlás
lt: Rekomendacija
mt: Rakkomandazzjoni
nl: Aanbeveling
pl: Rekomendacja

source: label_new_password
bg: Желана парола
da: Ønsket adgangskode
es: Contraseña deseada
fi: Toivottu salasana
fr: Mot de passe désiré
hu: Kívánt jelszó
lt: Pageidaujamas slaptažodis
mt: Password mixtieqa
nl: Gewenst wachtwoord
pl: Pożądane hasło

source: label_password_confirm
bg: Повторете паролата
da: Gentag adgangskode
es: Repetir contraseña
fi: Salasana uudestaan
fr: Encore le mot de passe
hu: Jelszó ismét
lt: Pakartokite slaptažodį
mt: Password mill-ġdid
nl: Wachtwoord opnieuw
pl: Ponownie hasło

source: label_preparation
bg: Приготвяне
da: Forberedelse
es: Preparación
fi: Valmistautuminen
fr: Préparation
hu: Előkészítés
lt: Paruošimas
mt: Preparazzjoni
nl: Voorbereiding
pl: Przygotowanie

source: label_recommendation_text
bg: Текст
da: Tekst
es: Texto
fi: Teksti
fr: Texte
hu: Szöveg
lt: Tekstas
mt: Test
nl: Tekst
pl: Tekst

source: label_register_first
bg: регистрирайте се
da: registrer
es: registrar
fi: rekisteröidy
fr: s'inscrire
hu: regisztráció
lt: registruotis
mt: irreġistra
nl: registreren
pl: zarejestruj
