Repository: pypi-data/pypi-mirror-403
Catalog: packages/dsetool.policy/dsetool_policy-1.0.3.tar.gz/dsetool_policy-1.0.3/src/dsetool/policy/locales/*/LC_MESSAGES/euphorie.po
Languages: bg, da, es, fi, fr, hu, lt, mt, nl, pl

source: Maintenance actions
bg: Действия за поддръжка
da: Vedligeholdelsesaktioner
es: Acciones de mantenimiento
fi: Huoltotoimenpiteet
fr: Actions de maintenance
hu: Karbantartási műveletek
lt: Priežiūros veiksmai
mt: Azzjonijiet ta' manutenzjoni
nl: Onderhoudsacties
pl: Działania konserwacyjne

source: Maintenance view
bg: Изглед за поддръжка
da: Vedligeholdelsesvisning
es: Vista de mantenimiento
fi: Huoltonäkymä
fr: Vue de maintenance
hu: Karbantartási nézet
lt: Priežiūros peržiūra
mt: Vista ta' manutenzjoni
nl: Onderhoudsweergave
pl: Widok konserwacji

source: Not yet answered
bg: Все още не е отговорено
da: Ikke besvaret endnu
es: Aún sin respuesta
fi: Ei ole vielä vastattu
fr: Pas encore répondu
hu: Még nem válaszolt
lt: Dar neatsakyta
mt: Mhux għadu wieġeb
nl: Nog niet beantwoord
pl: Jeszcze nie odpowiedziano

source: OSHA OiRA customizations for Euphorie
bg: OSHA OiRA персонализации за Euphorie
da: OSHA OiRA tilpasninger til Euphorie
es: Personalizaciones OSHA OiRA para Euphoria
fi: OSHA OiRA -muokkaukset Euphorielle
fr: Personnalisations OSHA OiRA pour Euphorie
hu: OSHA OiRA testreszabások az Euphorie számára
lt: OSHA OiRA pritaikymai Euphorie
mt: Customizzazzjonijiet OSHA OiRA għall Euphorie
nl: OSHA OiRA aanpassingen voor Euphorie
pl: Dostosowania OiRA OSHA do Euphorie

source: OSHA extra Country fields
bg: Допълнителни полета за държави от OSHA
da: OSHA ekstra land felter
es: Campos adicionales de país OSHA
fi: OSHA ylimääräiset maakentät
fr: Champs supplémentaires pour les pays OSHA
hu: További OSHA mezők országoknak
lt: OSHA papildomi laukai šaliai
mt: Fields extra ta 'Pajjiż OSHA
nl: OSHA extra velden voor land
pl: Dodatkowe pola Kraju w OSHA

source: OSHA extra Survey fields
bg: Още полета за анкети от OSHA
da: OSHA ekstra undersøgelsesfelter
es: Campos adicionales de encuesta OSHA
fi: OSHA ylimääräiset kyselykentät
fr: Champs supplémentaires pour les enquêtes OSHA
hu: További OSHA mezők felméréseknek
lt: OSHA papildomi apklausos laukai
mt: Fields extra ta ​​'Survey OSHA
nl: OSHA extra velden voor enquête
pl: Dodatkowe pola Ankiety w OSHA

source: OiRA can be used by anyone wishing to assess health and safety-related risks that might exist in their workplace.
bg: OiRA може да бъде използвано от всеки, който иска да оцени рисковете за здравето и безопасността, които могат да съществуват на работното му място.
da: OiRA kan bruges af enhver, der ønsker at vurdere sundheds- og sikkerhedsrelaterede risici, der kan findes på deres arbejdsplads.
es: OiRA puede ser utilizado por cualquier persona que desee evaluar los riesgos relacionados con la salud y la seguridad que podría haber en su lugar de trabajo.
fi: OiRAa voi käyttää kuka tahansa, joka haluaa arvioida mahdollisia terveys- ja turvallisuusriskejä työpaikallaan.
fr: OiRA peut être utilisé par toute personne souhaitant évaluer les risques liés à la santé et à la sécurité qui pourraient exister sur leur lieu de travail.
hu: Az OiRA-t bárki használhatja, aki munkahelyén az egészségi és biztonsági kockázatokat szeretné felmérni.
lt: OiRA gali naudoti kiekvienas, norintis įvertinti sveikatos ir saugos riziką, kuri gali kilti jų darbo vietoje.
mt: OiRA jista' jintuża minn kulħadd li jixtieq jivvaluta r-riskji marbuta mas-saħħa u s-sigurtà li jistgħu jeżistu fil-post tax-xogħol tagħhom.
nl: OiRA kan gebruikt worden door iedereen die gezondheids- en veiligheidsrisico's wil beoordelen die op hun werkplek kunnen bestaan.
pl: OiRA może być używana przez każdego, kto chce ocenić ryzyko związane z bezpieczeństwem i higieną pracy, które może istnieć w ich miejscu pracy.

source: OiRA is designed specifically to support them in assessing the risks at work and helping them to produce a documented risk assessment including an action plan tailored to the business's requirements.
bg: OiRA е създаден специално, за да подкрепя хората при оценяване на рисковете на работното място и да им помага при създаване на документирана оценка на риска, включваща план за действие, адаптиран към нуждите на бизнеса.
da: OiRA er specifikt designet til at støtte dem i at vurdere risici på arbejdspladsen og hjælpe dem med at producere en dokumenteret risikovurdering inklusive en handlingsplan tilpasset virksomhedens krav.
es: OiRA está diseñado específicamente para apoyarles en la evaluación de los riesgos laborales y ayudarles a producir una evaluación de riesgos documentada que incluya un plan de acción adaptado a las necesidades del negocio.
fi: OiRA on suunniteltu erityisesti tukemaan niitä työpaikkansa riskejä arvioivissa ja auttamaan heitä tuottamaan dokumentoidun riskiarvioinnin, johon sisältyy toimintasuunnitelma yrityksen vaatimusten mukaisesti.
fr: OiRA est spécialement conçu pour les aider à évaluer les risques au travail et à les aider à produire une évaluation des risques documentée incluant un plan d'action adapté aux besoins de l'entreprise.
hu: Az OiRA-t kifejezetten a munkahelyi kockázatok felmérésének támogatására tervezték, és segít nekik elkészíteni egy dokumentált kockázatelemzést egy az üzleti követelményekhez igazított cselekvési tervvel.
lt: OiRA yra sukurtas būtent tam, kad padėtų apibrėžti darbo rizikos vertinimą ir padėtų parengti dokumentuotą rizikos vertinimą, įskaitant veiksmų planą pagal verslo reikalavimus.
mt: OiRA huwa ddizajnat speċifikament biex jappoġġjahom fit-telfa tar-riskji fuq ix-xogħol u sabiex jgħinilhom jipproduċu valutazzjoni tad-risku mdoċimentata inkluż aċċjun imfassal għal ħtiġijiet tan-negozju.
nl: OiRA is specifiek ontworpen om hen te ondersteunen bij het beoordelen van de risico's op het werk en hen te helpen bij het opstellen van een gedocumenteerde risicobeoordeling, inclusief een actieplan dat is afgestemd op de behoeften van het bedrijf.
pl: OiRA została zaprojektowana specjalnie, aby wesprzeć ich w ocenie ryzyka w pracy i pomóc im w wyprodukowaniu udokumentowanej oceny ryzyka, w tym planu działania dostosowanego do wymagań firmy.

source: OiRA stands for Online Interactive Risk Assessment. It is a web-based tool that allows you to perform a health and safety risk assessment of your workplace.
bg: OiRA означава Online Interactive Risk Assessment. Това е уеб-базиран инструмент, който ви позволява да извършвате оценка на риска за здравето и безопасността на вашето работно място.
da: OiRA står for Online Interaktiv Risikovurdering. Det er et webbaseret værktøj, der giver dig mulighed for at udføre en sundheds- og sikkerhedsrisikovurdering af din arbejdsplads.
es: OiRA significa Evaluación de Riesgos Interactiva en Línea. Es una herramienta web que te permite realizar una evaluación de riesgos de salud y seguridad de tu lugar de trabajo.
fi: OiRA tarkoittaa Online Interactive Risk Assessment. Se on verkkopohjainen työkalu, jonka avulla voit suorittaa työpaikkasi terveys- ja turvallisuusarvioinnin.
fr: OiRA signifie Évaluation des Risques Interactif en Ligne. Il s'agit d'un outil basé sur le web qui vous permet d'effectuer une évaluation des risques en matière de santé et de sécurité de votre lieu de travail.
hu: Az OiRA az Online Interaktív Kockázatelemzés rövidítése. Ez egy webalapú eszköz, amely lehetővé teszi, hogy munkahelyi egészség- és biztonsági kockázatértékelést végezzen.
lt: OiRA - tai Online Interactive Risk Assessment. Tai internetinis įrankis, leidžiantis atlikti sveikatos ir saugos rizikos vertinimą jūsų darbo vietoje.
mt: OiRA jfisser Online Interactive Risk Assessment. Huwa għodda li tibbaża fuq il-web li tgħallimlek li timplimenta valutazzjoni tad-riskju tas-saħħa u s-sigurtà tal-post tax-xogħol tiegħek.
nl: OiRA staat voor Online Interactieve Risicobeoordeling. Het is een webgebaseerde tool waarmee u een gezondheids- en veiligheidsrisicobeoordeling van uw werkplek kunt uitvoeren.
pl: OiRA to skrót od Online Interactive Risk Assessment. Jest to narzędzie internetowe, które pozwala przeprowadzić ocenę ryzyka zdrowotnego i bezpieczeństwa w miejscu pracy.

source: OiRA tool reminder
bg: Напомняне за инструмента OiRA
da: OiRA værktøjspåmindelse
es: Recordatorio de herramienta OiRA
fi: OiRA-työkalun muistutus
fr: Rappel de l'outil OiRA
hu: OiRA eszköz emlékeztető
lt: OiRA įrankio priminimas
mt: Promemorja dwar l-għodda OiRA
nl: OiRA tool herinnering
pl: Przypomnienie o narzędziu OiRA

source: Option
bg: Опция
da: Mulighed
es: Opción
fi: Vaihtoehto
hu: Opció
lt: Variantas
mt: Għażla
nl: Optie
pl: Opcja

source: Provide additional OSHA fields
bg: Предоставяне на допълнителни полета от OSHA
da: Angiv yderligere OSHA felter
es: Proporcionar campos OSHA adicionales
fi: Tarjoa lisää OSHA-kenttiä
fr: Fournir des champs OSHA supplémentaires
hu: További OSHA mezők biztosítása
lt: Pateikite papildomus OSHA laukus
mt: Ipprovdixx il-fields addizzjonali ta 'OSHA
nl: Bied extra OSHA-velden aan
pl: Dodaj dodatkowe pola OSHA

source: Recommendation
bg: Препоръка
da: Anbefaling
es: Recomendación
fi: Suositus
fr: Recommandation
hu: Ajánlás
lt: Rekomendacija
mt: Rakkomandazzjoni
nl: Aanbeveling
pl: Rekomendacja

source: Registering allows you to simply log in at any time to continue previous assessments or to start new ones.
bg: Регистрацията ви позволява просто да влезете по всяко време, за да продължите предишни оценки или да започнете нови.
da: Registrering giver dig mulighed for blot at logge ind når som helst for at fortsætte tidligere vurderinger eller for at starte nye.
es: Al registrarte, puedes iniciar sesión en cualquier momento para continuar las evaluaciones anteriores o para iniciar nuevas.
fi: Rekisteröityminen mahdollistaa kirjautumisen milloin tahansa ja edellisten arviointien jatkamisen tai uusien aloittamisen.
fr: L'inscription vous permet de vous connecter à tout moment pour continuer les évaluations précédentes ou pour en commencer de nouvelles.
hu: A regisztráció lehetővé teszi, hogy bármikor egyszerűen bejelentkezzen a korábbi értékelések folytatásához vagy újak elindításához.
lt: Registracija leidžia lengvai prisijungti bet kuriuo metu, kad tęstumėte ankstesnius vertinimus ar pradėtumėte naujus.
mt: Ir-reġistazzjoni tgħallimlek li tiddaħħal b’mod sempliċi fi kwalunkwe ħin biex tkompli valutazzjonijiet preċedenti jew biex tibda ġodda.
nl: Door u te registreren kunt u op elk gewenst moment inloggen om eerdere beoordelingen te hervatten of nieuwe te starten.
pl: Rejestracja pozwala Ci po prostu zalogować się w dowolnym momencie, aby kontynuować poprzednie oceny lub rozpocząć nowe.

source: The first thing you will be asked to do when you begin your first risk assessment is to create an OiRA account - this is a simple and quick process.
bg: Първото, което ще ви бъде поискано да направите, когато започнете първата си оценка на риска, е да създадете профил в OiRA - това е прост и бърз процес.
da: Det første, du bliver bedt om at gøre, når du starter din første risikovurdering, er at oprette en OiRA konto - det er en simpel og hurtig proces.
es: Lo primero que se te pedirá hacer cuando comiences tu primera evaluación de riesgos es crear una cuenta OiRA - este es un proceso sencillo y rápido.
fi: Ensimmäinen asia, jota sinulta pyydetään tekemään, kun aloitat ensimmäisen riskiarviointisi, on OiRA-tilin luominen - tämä on yksinkertainen ja nopea prosessi.
fr: La première chose que l'on vous demandera de faire lorsque vous commencerez votre première évaluation des risques est de créer un compte OiRA, c'est un processus simple et rapide.
hu: Amikor először kezd kockázatelemzést, az első dolog, amit meg kell tennie, hogy létrehoz egy OiRA fiókot - ez egy egyszerű és gyors folyamat.
lt: Pirmas dalykas, kurio bus paprašyta jūsų pradėjus pirmąjį rizikos vertinimą - tai sukurti OiRA paskyrą - tai yra paprastas ir greitas procesas.
mt: L-ewwel ħaġa li se jintalbok tagħmel meta tibda l-ewwel valutazzjoni tad-riskju tiegħek hija li toħloq kont OiRA - dan huwa proċess sempliċi u mgħaġġel.
nl: Het eerste wat u wordt gevraagd te doen wanneer u uw eerste risicobeoordeling begint, is een OiRA-account aan te maken - dit is een eenvoudig en snel proces.
pl: Pierwszą rzeczą, o którą zostaniesz poproszony po rozpoczęciu pierwszej oceny ryzyka, jest utworzenie konta OiRA - to prosty i szybki proces.

source: There are four main stages to complete in the assessment process:
bg: Има четири основни етапа, които трябва да завършите в процеса на оценяване:
da: Der er fire hovedtrin, der skal gennemføres i vurderingsprocessen:
es: Hay cuatro etapas principales a completar en el proceso de evaluación:
fi: Arviointiprosessissa on neljä päävaihetta:
fr: Il y a quatre étapes principales à compléter dans le processus d'évaluation :
hu: Négy fő szakasz van, amelyet el kell végezni az értékelési folyamatban:
lt: Vertinimo procese yra keturi pagrindiniai etapai:
mt: Hemm erba 'stadi ewlenin għall-valutazzjoni:
nl: Er zijn vier hoofdfasen om te voltooien in het beoordelingsproces:
pl: W procesie oceny należy ukończyć cztery główne etapy:

source: What do I have to do?
bg: Какво трябва да направя?
da: Hvad skal jeg gøre?
es: ¿Qué tengo que hacer?
fi: Mitä minun pitää tehdä?
fr: Que dois-je faire?
hu: Mit kell tennem?
lt: Ką man reikia daryti?
mt: X'ser nagħmel?
nl: Wat moet ik doen?
pl: Co muszę zrobić?

source: What is OiRA (Online Interactive Risk Assessment)?
bg: Какво представлява OiRA (Online Interactive Risk Assessment)?
da: Hvad er OiRA (Online Interactive Risk Assessment)?
es: ¿Qué es OiRA (Evaluación de Riesgos Interactiva en Línea)?
fi: Mikä on OiRA (Online Interactive Risk Assessment)?
fr: Qu'est-ce que OiRA (Évaluation des Risques Interactif en Ligne) ?
hu: Mi az az OiRA (Online Interaktív Kockázatelemzés)?
lt: Kas yra OiRA (Online Interactive Risk Assessment)?
mt: X'inhi OiRA (Online Interactive Risk Assessment)?
nl: Wat is OiRA (Online Interactieve Risicobeoordeling)?
pl: Czym jest OiRA (Online Interactive Risk Assessment)?

source: Who is the OiRA tool for?
bg: За кого е предназначен OiRA инструментът?
da: Hvem er OiRA-værktøjet til?
es: ¿Para quién es la herramienta OiRA?
fi: Kenelle OiRA-työkalu on tarkoitettu?
fr: A qui est destiné l'outil OiRA?
hu: Kinek készült az OiRA eszköz?
lt: Kam skirtas OiRA įrankis?
mt: Għal min hi l-għodda OiRA?
nl: Voor wie is de OiRA tool bedoeld?
pl: Dla kogo jest narzędzie OiRA?

source: Why do I have to register?
bg: Защо трябва да се регистрирам?
da: Hvorfor skal jeg registrere mig?
es: ¿Por qué tengo que registrarme?
fi: Miksi minun täytyy rekisteröityä?
fr: Pourquoi dois-je m'inscrire?
hu: Miért kell regisztrálnom?
lt: Kodėl man reikia registruotis?
mt: Għaliex għandni nirreġistra?
nl: Waarom moet ik me registreren?
pl: Dlaczego muszę się zarejestrować?

source: You do not need any kind of specific preparation to start using the tool, however you should take some time to think about who is going to carry out the risk assessment, how workers are going to be involved in the process, etc.
bg: Не се изисква никаква специфична подготовка, за да започнете да използвате инструмента, обаче трябва да отделите известно време, за да помислите кой ще извърши оценката на риска, как ще бъдат включени работниците в процеса и т.н.
da: Du behøver ikke nogen form for specifik forberedelse for at begynde at bruge værktøjet, men du bør tage dig tid til at tænke over, hvem der skal gennemføre risikovurderingen, hvordan arbejderne skal inddrages i processen osv.
es: No necesitas ningún tipo de preparación específica para empezar a usar la herramienta, sin embargo, deberías tomarte un tiempo para pensar quién va a realizar la evaluación de riesgos, cómo se van a involucrar los trabajadores en el proceso, etc.
fi: Et tarvitse mitään erityisiä valmisteluja työkalun käyttämisen aloittamiseksi, mutta sinun pitäisi kuitenkin miettiä jonkin aikaa, kuka aikoo suorittaa riskiarvioinnin, miten työntekijät otetaan mukaan prosessiin jne.
fr: Vous n'avez pas besoin d'une préparation spécifique pour commencer à utiliser l'outil, toutefois, vous devriez prendre un certain temps pour réfléchir à qui va effectuer l'évaluation des risques, comment les travailleurs vont être impliqués dans le processus, etc.
hu: Nem szükséges semmiféle speciális előkészület az eszköz használatának megkezdéséhez, azonban érdemes időt szánni arra, hogy átgondolja, ki fogja elvégezni a kockázatelemzést, hogyan lesznek bevonva a munkavállalók a folyamatba, stb.
lt: Nereikia jokio specialaus pasirengimo, kad pradėtumėte naudoti įrankį, tačiau turėtumėte skirti šiek tiek laiko pagalvoti, kas atliks rizikos vertinimą, kaip darbuotojai bus įtraukti į procesą ir t.t.
mt: M'għandekx bżonn ebda preparazzjoni speċifika biex tibda tuża l-għodda, iżda għandek tieħu ftit ħin biex taħseb min se jagħmel il-valutazzjoni tad-riskju, kif se jiġu involuti l-ħaddiema fil-proċess, eċċ.
nl: U heeft geen specifieke voorbereiding nodig om de tool te gebruiken, maar u moet wel wat tijd nemen om na te denken over wie de risicobeoordeling gaat uitvoeren, hoe werknemers bij het proces betrokken gaan worden, etc.
pl: Nie musisz przygotowywać się specjalnie, aby zacząć korzystać z narzędzia, ale powinieneś poświęcić trochę czasu na zastanowienie się, kto ma przeprowadzić ocenę ryzyka, jak pracownicy będą zaangażowani w proces, itp.

source: You have to make sure to be in possession of a printed, accurate and up-dated risk assessment (at any time).
bg: Трябва да се уверите, че разполагате с отпечатана, точна и актуализирана оценка на риска (по всяко време).
da: Du skal sørge for at være i besiddelse af en trykt, nøjagtig og opdateret risikovurdering (på ethvert tidspunkt).
es: Debes asegurarte de tener en tu posesión una evaluación de riesgos impresa, precisa y actualizada (en cualquier momento).
fi: Sinun on varmistettava, että sinulla on painettu, tarkka ja ajantasainen riskiarviointi (milloin tahansa).
fr: Vous devez vous assurer d'être en possession d'une évaluation des risques imprimée, précise et mise à jour (en tout temps).
hu: Gondoskodnia kell arról, hogy birtokában legyen egy kinyomtatott, pontos és naprakész kockázatértékelésnek (bármikor).
lt: Jūs turite užtikrinti, kad turite spausdintą, tikslų ir atnaujintą rizikos vertinimą (bet kuriuo metu).
mt: Għandek iżgura li tkun għaddej minn valutazzjoni eżatta tad-riskju maħruġa u stordata (fi kwalunkwe ħin).
nl: U moet ervoor zorgen dat u te allen tijde in het bezit bent van een gedrukte, nauwkeurige en bijgewerkte risicobeoordeling.
pl: Musisz upewnić się, że posiadasz wydrukowaną, dokładną i aktualną ocenę ryzyka (w każdym momencie).

source: choice_option_header
bg: Опция ${number}
da: Mulighed ${number}
es: Opción ${number}
fi: Vaihtoehto ${number}
fr: Option ${number}
hu: Opció ${number}
lt: Variantas ${number}
mt: Għażla ${number}
nl: Optie ${number}
pl: Opcja ${number}

source: choice_recommendation_header
bg: Препоръка ${number}
da: Anbefaling ${number}
es: Recomendación ${number}
fi: Suositus ${number}
fr: Recommandation ${number}
hu: Ajánlás ${number}
lt: Rekomendacija ${number}
mt: Rakkomandazzjoni ${number}
nl: Aanbeveling ${number}
pl: Rekomendacja ${number}

source: description_report_completion_threshold
bg: Моля, въведете процента на завършване, над който докладът е наличен на този инструмент. Потребителят няма да може да преглежда или изтегля доклад, докато оценката не е завършена до посочения процент. Въведете “0”, за да е докладът винаги наличен.
da: Indtast venligst den fuldførelsesprocent over hvilken rapporten er tilgængelig på dette værktøj. Brugeren vil ikke kunne se eller downloade en rapport, indtil vurderingen er gennemført til den angivne procentdel. Indtast “0” for altid at have rapporten tilgængelig.
es: Por favor, introduzca el porcentaje de finalización por encima del cual el informe está disponible en esta herramienta. El usuario no podrá ver o descargar un informe hasta que la evaluación se complete en el porcentaje indicado. Introduce “0” para tener siempre disponible el informe.
fi: Anna valmiusprosentti, jonka yläpuolella raportti on tämän työkalun käytettävissä. Käyttäjä ei voi katsoa tai ladata raporttia, kunnes arviointi on tehty annetussa prosenttimäärässä. Anna “0”, jotta raportti on aina saatavilla.
fr: Veuillez entrer le pourcentage d'achèvement au-dessus duquel le rapport est disponible sur cet outil. L'utilisateur ne pourra pas voir ou télécharger un rapport jusqu'à ce que l'évaluation soit terminée jusqu'au pourcentage donné. Entrez “0” pour toujours avoir le rapport disponible.
hu: Kérjük, adja meg azt a teljesítési százalékot, amely felett a jelentés elérhető lesz ezen az eszközön. A felhasználó nem lesz képes megtekinteni vagy letölteni a jelentést, amíg a felmérés el nem éri a megadott százalékot. „0” érték megadása esetén a jelentés mindig elérhető.
lt: Įveskite užbaigimo procentą, nuo kurio šio įrankio ataskaita tampa prieinama. Vartotojas negalės peržiūrėti ar atsisiųsti ataskaitos, kol vertinimas nebus užbaigtas iki nurodyto procento. Įveskite “0”, kad ataskaita visada būtų prieinama.
mt: Jekk jogħġbok, daħħal il-perċentwali ta' kompletament fuq liema l-rapport jkun disponibbli fuq din l-għodda. L-utent ma jkunx jista' jara jew jniżżel rapport sakemm l-valutazzjoni tkun kompluta sa l-perċentwali mogħti. Daħħal “0” biex il-rapport jonqos disponibbli dejjem.
nl: Voer het voltooiingspercentage in waarboven het rapport beschikbaar is voor deze tool. De gebruiker kan geen rapport bekijken of downloaden totdat de beoordeling is voltooid tot het opgegeven percentage. Voer “0” in om het rapport altijd beschikbaar te hebben.
pl: Wprowadź procent zakończenia, powyżej którego raport jest dostępny w tym narzędziu. Użytkownik nie będzie mógł wyświetlić lub pobrać raportu, dopóki ocena nie zostanie zakończona w podanym procentie. Wprowadź „0”, aby raport był zawsze dostępny.

source: description_show_immediate_feedback
bg: След като потребителят е избрал опция за избор, покажете всички свързани препоръки, преди да преминете към следващия избор
da: Efter at brugeren har valgt en mulighed for et valg, vis eventuelle tilknyttede anbefalinger før du fortsætter til det næste valg
es: Después de que el usuario ha seleccionado una opción para una elección, muestra las recomendaciones asociadas antes de pasar a la siguiente elección
fi: Kun käyttäjä on valinnut valinnan vaihtoehdolle, näytä kaikki siihen liittyvät suositukset ennen seuraavan valinnan tekemistä
fr: Après que l'utilisateur a sélectionné une option pour un choix, affichez toutes les recommandations associées avant de passer au choix suivant
hu: Ha a felhasználó választott egy opciót, mutassa meg a hozzátartozó ajánlásokat, mielőtt továbbhaladna a következő választáshoz
lt: Kai vartotojas pasirenka variantą, prieš pereidami prie kito pasirinkimo, parodykite susijusias rekomendacijas.
mt: Wara li l-utent jagħżel għażla għal għażla, juri kwalunkwe rakkomandazzjonijiet assoċjati qabel ma jkompli mal-għażla li jmiss.
nl: Nadat de gebruiker een optie voor een keuze heeft geselecteerd, toon eventuele bijbehorende aanbevelingen voordat u doorgaat naar de volgende keuze
pl: Po wybraniu przez użytkownika opcji dla wyboru, pokaż wszelkie powiązane rekomendacje, zanim przejdziesz do następnego wyboru
