Repository: pypi-data/pypi-mirror-403
Catalog: packages/dsetool.policy/dsetool_policy-1.0.3.tar.gz/dsetool_policy-1.0.3/src/dsetool/policy/locales/*/LC_MESSAGES/euphorie.po
Languages: bg, da, es, fi, fr, hu, lt, mt, nl, pl

source: Seven questions will address your current practices with regard to dangerous substances and chemical products. If improvements are needed, you will immediately get tips and advice on what you need to do and on how you can do it as easily and efficiently as possible.
es: Siete preguntas abordarán tus prácticas actuales con respecto a sustancias peligrosas y productos químicos. Si se necesitan mejoras, obtendrás de inmediato consejos y recomendaciones sobre qué necesitas hacer y cómo puedes hacerlo de la manera más fácil y eficiente posible.
lt: Septyni klausimai skirti jūsų dabartinei praktikai susijusiai su pavojingomis medžiagomis ir chemijos produktais. Jei reikia tobulinti, jūs iškart gausite patarimų ir patarimų, ką reikia daryti ir kaip tai galima padaryti kuo lengviau ir efektyviau.

source: This is an interactive questionnaire and the questions might change related to given answers. You can use the skip button if you are not sure about an answer yet and get back to the question later. You will also receive a report containing your answers, recommendations and advice.
es: Este es un cuestionario interactivo y las preguntas pueden cambiar en función de las respuestas dadas. Puedes usar el botón omitir si aún no estás seguro de una respuesta y regresar a la pregunta más tarde. También recibirás un informe que contiene tus respuestas, recomendaciones y consejos.
lt: Tai interaktyvus klausimynas, ir klausimai gali keistis atsižvelgiant į pateiktus atsakymus. Jei dar nesate tikri dėl atsakymo, galite naudoti praleidimo mygtuką ir vėliau sugrįžti prie klausimo. Jūs taip pat gausite ataskaitą, kurioje bus jūsų atsakymai, rekomendacijos ir patarimai.

source: Let's quickly check if this tool might be helpful for you&hellip;
es: Vamos a verificar rápidamente si esta herramienta podría ser útil para ti&hellip;
lt: Greitai patikrinkime, ar šis įrankis gali būti naudingas jums&hellip;

source: Do you use, handle or store chemical products or chemical substances at work? Such products will be labelled with one or more of the currently used hazard pictograms (black and white in red frames) depicted below.
es: ¿Utilizas, manipulas o almacenas productos químicos o sustancias químicas en el trabajo? Dichos productos estarán etiquetados con uno o más de los pictogramas de peligro actualmente utilizados (blanco y negro enmarcados en rojo) que se muestran a continuación.
lt: Ar naudojate, laikote ar saugote chemijos gaminius ar chemines medžiagas darbe? Tokiems gaminiams bus skirtas vienas ar daugiau dabar naudojamų pavojingų simbolių (juoda ir balta raudonuose rėmeliuose), parodytas žemiau.

source: Current hazard pictograms:
es: Pictogramas de peligro actuales:
lt: Dabartinės pavojų piktogramos:

source: Are you sure that you have no chemical products or substances labelled with a hazard pictogram? Examples of chemical products with such labels, which can be found in most workplaces, are detergents, adhesives and paints.
es: ¿Estás seguro de que no tienes productos o sustancias químicas etiquetadas con un pictograma de peligro? Ejemplos de productos químicos con dichas etiquetas, que se pueden encontrar en la mayoría de los lugares de trabajo, son detergentes, adhesivos y pinturas.
lt: Ar esate tikri, kad turite cheminių produktų ar medžiagų, pažymėtų pavojų piktograma? Pavyzdžiai įmonėse dažnai randamų su tokiais žymėjimais pažymėtų cheminių produktų yra plovikliai, klijai ir dažai.

source: Could air pollution of any kind be generated, for example dust from grinding or sanding, combustion products such as exhausts and fumes, or degradation products from chemical products or hazardous waste?
es: ¿Podría generarse algún tipo de contaminación del aire, por ejemplo polvo de rectificado o lijado, productos de combustión como gases de escape y humos, o productos de degradación de productos químicos o residuos peligrosos?
lt: Ar galėtų būti sukurta bet kokio tipo oro tarša, pvz., dulkių nuo šlifavimo ar šveitimo, degimo produktų, tokių kaip išmetamosios dujos ir dūmai, ar cheminių produktų ar pavojingų atliekų skilimo produktų?

source: There is no need to continue with the survey.
es: No hay necesidad de continuar con la encuesta.
lt: Nereikia tęsti šios apklausos.

source: It seems it would make sense for you to do this assessment.
es: Parece que tendría sentido que realices esta evaluación.
lt: Atrodo, kad būtų prasminga jums atlikti šį vertinimą.

source: Click the start button below to begin the assessment.
es: Haz clic en el botón de inicio a continuación para comenzar la evaluación.
lt: Paspauskite pradėjimo mygtuką žemiau, kad pradėtumėte vertinimą.

source: ${action-plan} In the fourth stage of the assessment you can decide what steps you will take to address the risks you have identified previously and what resources this might require. Based on this, a report will be automatically produced in the next step.
bg: ${action-plan} На четвъртия етап от оценката можете да решиите какви стъпки ще предприемете за преодоляване на рисковете, които сте определили предварително и какви ресурси може да изисква тази стъпка. На базата на това, в следващата стъпка автоматично ще бъде генериран доклад.
da: ${action-plan} I den fjerde fase af vurderingen kan du bestemme, hvilke skridt du vil tage for at imødegå de risici, du tidligere har identificeret, og hvilke ressourcer dette måske ville kræve. Baseret på dette vil der automatisk blive produceret en rapport i det næste trin.
es: ${action-plan} En la cuarta etapa de la evaluación puedes decidir qué medidas tomarás para abordar los riesgos que has identificado previamente y qué recursos podrían ser necesarios. Basándote en esto, se generará automáticamente un informe en el siguiente paso.
fi: ${action-plan} Arvioinnin neljännessä vaiheessa voit päättää, mitä toimenpiteitä aiot toteuttaa aiemmin tunnistamiesi riskien torjumiseksi ja minkälaista resurssitarvetta tämä saattaa edellyttää. Tämän pohjalta raportti laaditaan automaattisesti seuraavassa vaiheessa.
fr: ${action-plan} Dans la quatrième étape de l'évaluation, vous pouvez décider des mesures à prendre pour répondre aux risques que vous avez identifiés précédemment et déterminer les ressources nécessaires. Sur cette base, un rapport sera automatiquement produit à l'étape suivante.
hu: ${action-plan} Az értékelés negyedik szakaszában eldöntheti, milyen lépéseket fog tenni a korábban azonosított kockázatok kezelésére és milyen erőforrásokra lehet szükség. Ezt követően a következő lépésben automatikusan jelentés készül.
lt: ${action-plan} Ketvirtame vertinimo etape galite nuspręsti, kokius žingsnius imsitės, kad įveiktumėte iš anksto identifikuotas grėsmes ir kokios gali būti tam skirtos reikalingos ištekliai. Remiantis tuo, bus automatiškai sukurtas ataskaitą per kitą žingsnį.
mt: ${action-plan} Fir-raba 'staddju tal-valutazzjoni tista' tiddetermina liema passi se tieħu biex tipprova l-riskji li identifikajt qabel u x'resorsi dan jista' jirrikjedi. Fuq il-bażi ta' dan, rapport se jiġi ġġenerat awtomatikament fi t-tieni pass.
nl: ${action-plan} In de vierde fase van de beoordeling kunt u beslissen welke stappen u gaat nemen om de risico's die u eerder heeft geïdentificeerd aan te pakken en welke middelen hiervoor nodig zijn. Op basis hiervan wordt in de volgende stap automatisch een rapport geproduceerd.
pl: ${action-plan} Na czwartym etapie oceny możesz zdecydować, jakie kroki podejmiesz, aby zaradzić wcześniej zidentyfikowanym ryzykom i jakie zasoby mogą być do tego potrzebne. Na tej podstawie w następnym kroku automatycznie wygenerowany będzie raport.

source: ${evaluation} Here you will be able to determine the level of risk attached to each of the items you identified as 'need to be addressed' in the 'Identification' stage.
bg: ${evaluation} Тук ще можете да определите нивото на риска, свързано с всеки от елементите, които сте определили като 'трябва да бъдат разгледани' на етапа 'Идентификация'.
da: ${evaluation} Her vil du kunne bestemme risikoniveauet for hvert af de punkter, du har identificeret som 'behov for at blive adresseret' i 'Identifikation' fasen.
es: ${evaluation} Aquí podrás determinar el nivel de riesgo asociado a cada uno de los elementos que identificaste como 'necesita ser abordado' en la etapa de 'Identificación'.
fi: ${evaluation} Tässä voit määrittää riskitason, joka liittyy jokaiseen 'täytyy korjata' -vaiheessa 'Tunnistaminen'-vaiheessa tunnistamaasi kohtaan.
fr: ${evaluation} Ici, vous pourrez déterminer le niveau de risque associé à chacun des éléments que vous avez identifiés comme 'à traiter' lors de l'étape 'Identification'.
hu: ${evaluation} Itt meg tudja határozni minden, az 'Azonosítás' szakaszban 'kezelésre szoruló'-ként azonosított elem kockázati szintjét.
lt: ${evaluation} Čia galėsite nustatyti rizikos lygį kiekvienam elementui, kurį identifikavote kaip 'būtina spręsti' 'Identifikacijos' etape.
mt: ${evaluation} Hawn tista' tkun tista' iddetermina l-livell ta 'riskju assoċjat ma' kull wieħed mill-items li identifikajt bħala 'jeħtieġ li jiġu indirizzati' fil-'staddju tal-identifikazzjoni'.
nl: ${evaluation} Hier kunt u het risiconiveau bepalen van elk item dat u hebt geïdentificeerd als 'moet worden aangepakt' in de 'Identificatie' fase.
pl: ${evaluation} Tutaj możesz określić poziom ryzyka przypisany do każdego z elementów, które zidentyfikowałeś jako 'do rozwiązania' na etapie 'Identyfikacja'.

source: ${identification} OiRA will present a series of potential health and safety hazards or problems that could exist in your workplace. By answering the statements/questions with either yes or no, you state if such hazards or problems are present. You can also decide to leave a question unanswered and thus put it on hold to be answered at a later stage.
bg: ${identification} OiRA ще ви представи редица потенциални рискове за здравето и безопасността или проблеми, които биха могли да съществуват на вашето работно място. Като отговаряте на изявленията/въпросите с 'да' или 'не', вие посочвате дали такива рискове или проблеми са налице. Също така можете да решите да оставите въпрос без отговор и по този начин да го задържите за отговаряне по-късно.
da: ${identification} OiRA vil præsentere en række potentielle sundheds- og sikkerhedsmæssige risici eller problemer, der kunne eksistere på din arbejdsplads. Ved at svare på udsagnene/spørgsmålene enten ja eller nej, angiver du om sådanne risici eller problemer er til stede. Du kan også beslutte at lade et spørgsmål ubesvaret og dermed sætte det på hold til at blive besvaret på et senere tidspunkt.
es: ${identification} OiRA presentará una serie de posibles riesgos o problemas de salud y seguridad que podrían existir en tu lugar de trabajo. Al responder las declaraciones/preguntas con sí o no, afirmas si dichos riesgos o problemas están presentes. También puedes decidir dejar una pregunta sin responder y, por lo tanto, ponerla en espera para ser respondida en una etapa posterior.
fi: ${identification} OiRA esittää sarjan mahdollisia terveys- ja turvallisuusriskejä tai ongelmia, joita voi esiintyä työpaikallasi. Vastaamalla lausuntoihin/kysymyksiin joko kyllä tai ei, kerrot, ovatko tällaiset riskit tai ongelmat olemassa. Voit myös päättää jättää kysymyksen vastaamatta ja siirtää sen myöhempään ajankohtaan.
fr: ${identification} OiRA va présenter une série de risques ou de problèmes potentiels en matière de santé et de sécurité qui pourraient exister sur votre lieu de travail. En répondant aux déclarations/questions par oui ou non, vous indiquez si de tels risques ou problèmes sont présents. Vous pouvez également décider de laisser une question sans réponse et de la mettre en attente pour y répondre ultérieurement.
hu: ${identification} Az OiRA számos lehetséges egészségi és biztonsági kockázatot, illetve problémát mutat be, amelyek a munkahelyén előfordulhatnak. A kérdésekre/vállalásokra igennel vagy nemmel válaszolva kijelenti, hogy ilyen veszélyek vagy problémák vannak-e. Úgy is dönthet, hogy egy kérdést megválaszolatlanul hagy, és így azt későbbi időpontban válaszolja meg.
lt: ${identification} OiRA pateiks potencialius sveikatos ir saugos pavojus ar problemas, kurie gali būti jūsų darbo vietoje. Atsakydami į teiginius/klausimus taip ar ne, nurodote, ar tokius pavojus ar problemas yra. Taip pat galite nuspręsti palikti klausimą neatsakytą ir taip uždėti jį ant laukimo, kad būtų atsakyta vėliau.
mt: ${identification} OiRA se tippreżenta serje ta 'potenzjali perikli tal-ħarsien u s-saħħa jew problemi li jistgħu jeżistu fil-post tax-xogħol tiegħek. Bir-risposta lejn l-affermazzjonijiet / mistoqsijiet b'lejn jew le, inti tiddikjara jekk tali perikli jew problemi huma mġedda. Inti tista 'tiddiċiedi wkoll li tħalli mistoqsija bla risposta u għalhekk toħloqha biex tiġi rrangata f'fażi oħra.
nl: ${identification} OiRA presenteert een reeks mogelijke gezondheids- en veiligheidsrisico's of problemen die op uw werkplek kunnen bestaan. Door de uitspraken/vragen te beantwoorden met ja of nee, vermeldt u of dergelijke risico's of problemen aanwezig zijn. U kunt er ook voor kiezen een vraag onbeantwoord te laten en deze zo in de wacht te zetten om deze op een later tijdstip te beantwoorden.
pl: ${identification} OiRA przedstawi Ci serię potencjalnych zagrożeń dla zdrowia i bezpieczeństwa lub problemów, które mogą występować w Twoim miejscu pracy. Odpowiadając na stwierdzenia/pytania tak lub nie, informujesz, czy takie zagrożenia lub problemy są obecne. Możesz również zdecydować o nieodpowiedzi na pytanie i tym samym odłożyć je na później.

source: ${preparation} This gives you an overview of the particular assessment you are about to begin and can allow you to further customise the assessment to the specific nature of your business.
bg: ${preparation} Това ви дава общ преглед на конкретната оценка, която сте на път да започнете и може да ви позволи да я приспособите още повече към специфичното естество на вашия бизнес.
da: ${preparation} Dette giver dig en oversigt over den særlige vurdering, du er ved at begynde, og kan give dig mulighed for at yderligere tilpasse vurderingen til din virksomheds specifikke karakter.
es: ${preparation} Esto te da una visión general de la evaluación particular que estás a punto de comenzar y te permite personalizar aún más la evaluación a la naturaleza específica de tu negocio.
fi: ${preparation} Tämä antaa sinulle yleiskatsauksen arviointiin, jonka olet aloittamassa, ja voit mukauttaa arviointia yrityksesi erityisluonteen mukaan.
fr: ${preparation} Ceci vous donne un aperçu de l'évaluation particulière que vous vous apprêtez à commencer et peut vous permettre de personnaliser davantage l'évaluation en fonction de la nature spécifique de votre entreprise.
hu: ${preparation} Áttekintést ad arról a konkrét értékelésről, amelyet el készül kezdeni, és lehetőséget ad arra, hogy tovább személyre szabhassa az értékelést vállalkozása specifikus jellemzőihez.
lt: ${preparation} Tai suteikia jums apžvalgą apie konkrečią vertinimą, kurį ketinate pradėti, ir leidžia jums dar labiau pritaikyti vertinimą pagal jūsų verslo specifiką.
mt: ${preparation} Dan jagħtek ħarsa ġenerali dwar il-valutazzjoni speċifika li qiegħed biex tibda u tista 'tħallik tajjeb il-valutazzjoni għall-natura speċifika tan-negozju tiegħek.
nl: ${preparation} Dit geeft u een overzicht van de specifieke beoordeling die u op het punt staat te beginnen en kan u toestaan om de beoordeling verder aan te passen aan de specifieke aard van uw bedrijf.
pl: ${preparation} Daje Ci to przegląd konkretnego oceniania, które zamierzasz rozpocząć i pozwala dalej dostosować ocenę do specyfiki Twojego biznesu.

source: Answered
bg: Отговорено
da: Besvaret
es: Respondido
fi: Vastattu
fr: Répondu
hu: Megválaszolt
lt: Atsakyta
mt: Irreġistrat
nl: Beantwoord
pl: Odpowiedziano

source: Choice
bg: Избор
da: Valg
es: Elección
fi: Valinta
fr: Choix
hu: Választás
lt: Pasirinkimas
mt: Għażla
nl: Keuze
pl: Wybór

source: Content rules: Manage rules
bg: Правила за съдържание: Управление на правила
da: Indholdsregler: Administrer regler
es: Reglas de contenido: Gestionar reglas
fi: Sisällön säännöt: Hallinnoi sääntöjä
fr: Règles de contenu : Gérer les règles
hu: Tartalmi szabályok: Szabályok kezelése
lt: Turinio taisyklės: valdykite taisykles
mt: Regoli tal-Kontenut: Immaniġġja regoli
nl: Content regels: Regels beheren
pl: Zasady dotyczące treści: Zarządzaj zasadami

source: Do I need to prepare?
bg: Трябва ли да се подготвя?
da: Skal jeg forberede mig?
es: ¿Necesito prepararme?
fi: Tarvitseeko minun valmistautua?
fr: Dois-je me préparer?
hu: Fel kell készülnöm?
lt: Ar man reikės pasiruošti?
mt: Ħtieġa nipprepara?
nl: Moet ik me voorbereiden?
pl: Czy muszę się przygotować?

source: Euphorie: Add new RIE Content
bg: Euphorie: Добавяне на ново RIE съдържание
da: Euphorie: Tilføj nyt RIE indhold
es: Euphoria: Añadir nuevo contenido RIE
fi: Euphoria: Lisää uusi RIE-sisältö
fr: Euphorie : Ajouter un nouveau contenu RIE
hu: Euphorie: Új RIE tartalom hozzáadása
lt: Euphorie: pridėti naują RIE turinį
mt: Euphorie: Żid kontenut ġdid ta' RIE
nl: Euphorie: Voeg nieuwe RIE Content toe
pl: Euphorie: Dodaj nową zawartość RIE

source: Euphorie: Delete published content
bg: Euphorie: Изтриване на публикувано съдържание
da: Euphorie: Slet offentliggjort indhold
es: Euphoria: Eliminar contenido publicado
fi: Euphoria: Poista julkaistu sisältö
fr: Euphorie : Supprimer le contenu publié
hu: Euphorie: Közzétett tartalom törlése
lt: Euphorie: ištrinti publikuotą turinį
mt: Euphorie: Ħassar kontenut ippubblikat
nl: Euphorie: Verwijder gepubliceerde content
pl: Euphorie: Usuń opublikowaną zawartość

source: Euphorie: Manage country
bg: Euphorie: Управление на държава
da: Euphorie: Administrer land
es: Euphoria: Gestionar país
fi: Euphoria: Hallinnoi maata
fr: Euphorie : Gérer le pays
hu: Euphorie: Ország kezelése
lt: Euphorie: valdyti šalį
mt: Euphorie: Immaniġġja pajjiż
nl: Euphorie: Beheer land
pl: Euphorie: Zarządzaj krajem

source: Euphorie: Publish a Survey
bg: Euphorie: Публикуване на анкета
da: Euphorie: Offentliggør en undersøgelse
es: Euphoria: Publicar una encuesta
fi: Euphoria: Julkaise kysely
fr: Euphorie : Publier une enquête
hu: Euphorie: Felmérés közzététele
lt: Euphorie: publikuoti apklausą
mt: Euphorie: Ippubblika stħarriġ
nl: Euphorie: Publiceer een enquête
pl: Euphorie: Publikuj ankietę

source: Euphorie: View a Survey
bg: Euphorie: Преглед на анкета
da: Euphorie: Vis en undersøgelse
es: Euphoria: Ver una encuesta
fi: Euphoria: Katso kysely
fr: Euphorie : Voir une enquête
hu: Euphorie: Felmérés megtekintése
lt: Euphorie: peržiūrėti apklausą
mt: Euphorie: Ara stħarriġ
nl: Euphorie: Bekijk een enquête
pl: Euphorie: Zobacz ankietę

source: How long will it take?
bg: Колко време ще отнеме?
da: Hvor lang tid vil det tage?
es: ¿Cuánto tiempo tomará?
fi: Kuinka kauan se kestää?
fr: Combien de temps cela va-t-il prendre?
hu: Mennyi időbe fog telni?
lt: Kiek tai užtruks?
mt: Kemm se jidum?
nl: Hoe lang zal het duren?
pl: Ile to zajmie?

source: However, OiRA is designed to be of most value to smaller businesses.
bg: Въпреки това, OiRA е създадено предимно за малките предприятия.
da: Men, OiRA er designet til at have størst værdi for mindre virksomheder.
es: Sin embargo, OiRA está diseñado para ser de mayor valor para las pequeñas empresas.
fi: OiRA on kuitenkin suunniteltu erityisesti pienyritysten tarpeisiin.
fr: Cependant, OiRA est conçu pour être le plus utile pour les petites entreprises.
hu: Az OiRA azonban úgy lett kialakítva, hogy a legtöbb értéket a kisebb vállalkozásoknak nyújtsa.
lt: Tačiau OiRA yra sukurtas, kad būtų naudingiausias mažesnėms įmonėms.
mt: Madankollu, OiRA huwa ddizajnat li jkun ta 'valur qawwi għan-negozji ż-żgħar.
nl: OiRA is echter ontworpen om het meest waardevol te zijn voor kleinere bedrijven.
pl: Jednak OiRA jest zaprojektowana tak, aby była najbardziej wartościowa dla małych firm.

source: However, you can spend whatever time you have available on an assessment and then return to it when convenient to pick up from the same point you left off.
bg: Обаче, можете да отделите колкото време имате възможност за оценка, а след това да се върнете към нея, когато е удобно, за да продължите от точката, на която сте спрели.
da: Dog kan du bruge lige så meget tid du har til rådighed på en vurdering og derefter vende tilbage til den, når det passer dig, for at genoptage fra det sted, du slap.
es: Sin embargo, puedes dedicar el tiempo que tengas disponible a una evaluación y luego volver a ella cuando te resulte conveniente para continuar desde el mismo punto en el que la dejaste.
fi: Voit kuitenkin käyttää tarjolla olevaa aikaa arviointiin ja palata siihen myöhemmin kätevästi siitä kohdasta, johon jäit.
fr: Cependant, vous pouvez passer autant de temps que vous le souhaitez sur une évaluation et y revenir lorsque cela vous convient pour reprendre là où vous vous êtes arrêté.
hu: Azonban tetszőleges időt tölthet egy értékelésen, majd visszatérhet hozzá, amikor csak kényelmes, és ott folytathatja, ahol abbahagyta.
lt: Tačiau, jūs galite skirti tiek laiko, kiek turite, vertinimui ir tada sugrįžti, kai jums patogu, ir tęsti nuo tos pačios vietos, kurioje nutrūkote.
mt: Madankollu, tista 'tħallas kemm trid mill-ħin li għandek disponibbli fuq valutazzjoni imbagħad terġa' għaliha meta huwa konvenjenti li tkompli mill-istess punt li weġġajt millu.
nl: Je kan echter zoveel tijd besteden als je beschikbaar hebt aan een beoordeling en dan terugkeren wanneer het uitkomt om verder te gaan waar je gebleven was.
pl: Jednak możesz poświęcić ocenie tyle czasu, ile masz dostępne, a następnie wrócić do niej, kiedy jest to wygodne, aby kontynuować od miejsca, w którym skończyłeś.

source: It's impossible to say how long an assessment will take in general as the tools differ according to sectors and countries.
bg: Невъзможно е да се каже колко време ще отнемеада оценката като цяло, тъй като инструментите се различават според секторите и държавите.
da: Det er umuligt at sige, hvor lang tid en vurdering generelt vil tage, da værktøjerne varierer i henhold til sektorer og lande.
es: Es imposible decir cuánto tiempo tomará una evaluación en general, ya que las herramientas varían según los sectores y los países.
fi: On mahdotonta sanoa, kuinka kauan arviointi yleisesti ottaen kestää, koska työkalut vaihtelevat sektoreittain ja maittain.
fr: Il est impossible de dire combien de temps une évaluation prendra en général, car les outils diffèrent selon les secteurs et les pays.
hu: Általánosságban nem lehet megmondani, mennyi idő egy értékelés, mert az eszközök szektorok és országok szerint változnak.
lt: Neįmanoma pasakyti, kiek užtruks vertinimas bendrai, nes įrankiai skiriasi pagal sektorius ir šalis.
mt: Huwa impossibbli biex tgħid kemm it-tul ta 'valutazzjoni ġeneralment, għax l-għodod jidifferu skond is-setturi u l-pajjiżi.
nl: Het is onmogelijk om te zeggen hoe lang een beoordeling over het algemeen zal duren, omdat de tools verschillen per sector en land.
pl: Nie da się powiedzieć, ile czasu zajmie ocena, ponieważ narzędzia różnią się w zależności od sektorów i krajów.

source: Learn more about the Dangerous Substances eTool
bg: Научете повече за Dangerous Substances eTool
da: Lær mere om det farlige stoffer e-værktøj
es: Aprenda más sobre el eTool de Sustancias Peligrosas
fi: Lue lisää vaarallisten aineiden eTyökalusta
fr: En savoir plus sur l'outil eTool Substances Dangereuses
hu: Tudjon meg többet a veszélyes anyagok eTools-ról
lt: Sužinokite daugiau apie pavojingų medžiagų eTool
mt: Ittagħlim aktar dwar Dangerous Substances eTool
nl: Meer weten over de Dangerous Substances eTool
pl: Dowiedz się więcej o e-narzędziu Niebezpieczne Substancje
