Repository: pypi-data/pypi-mirror-403
Catalog: packages/geopic-tag-reader/geopic_tag_reader-1.8.1.tar.gz/geopic_tag_reader-1.8.1/geopic_tag_reader/translations/*/LC_MESSAGES/geopic_tag_reader.po
Languages: tr, uk

source: Latitude:
tr: Enlem:
uk: Широта:

source: Longitude:
tr: Boylam:
uk: Довгота:

source: GPS accuracy:
tr: GPS doğruluğu:
uk: Точність GPS:

source: not set
tr: ayarlanmamış
uk: не встановлено

source: Timestamp:
tr: Zaman damgası:
uk: Часовий штамп:

source: (Camera)
tr: (Kamera)
uk: (Камера)

source: Heading:
tr: Başlık:
uk: Заголовок:

source: Type:
tr: Tip:
uk: Тип:

source: Make:
tr: Oluşturan:
uk: Зробити:

source: Model:
uk: Модель:

source: Focal length:
tr: Odak uzaklığı:
uk: Фокусна відстань:

source: Field of view:
tr: Görüş alanı:
uk: Поле зору:

source: Sensor width:
tr: Sensör genişliği:
uk: Ширина датчика:

source: Crop parameters:
tr: Kırpma parametresi:
uk: Параметри обрізки:

source: Pitch:
tr: Eğim:
uk: Поле:

source: Roll:
tr: Yuvarla:
uk: Рулон:

source: Yaw:
tr: Yalpalama:
uk: Відхилення:

source: Warnings raised by reader:
tr: Okuyucularımızın uyarıları:
uk: Попередження, висловлені читачем:

source: Read latitude is out of WGS84 bounds (should be in [-90, 90])
tr: Okunan enlem WGS84 sınırlarının dışındadır (-90, 90 aralığında olmalıdır)
uk: Зчитувана широта виходить за межі WGS84 (повинна бути в діапазоні [-90, 90])

source: Read longitude is out of WGS84 bounds (should be in [-180, 180])
tr: Okunan boylam WGS84 sınırlarının dışındadır (-180, 180 aralığında olmalıdır)
uk: Довгота виходить за межі WGS84 (повинна бути в діапазоні [-180, 180])

source: Skipping Mapillary date/time as it was not recognized: {v}
tr: Tanınmadığı için Mapillary tarih/saati atlanıyor: {v}
uk: Пропуск дати/часу Mapillary, оскільки вони не були розпізнані: {v}

source: No heading value was found, this reduces usability of picture
tr: Başlık değeri bulunamadı, bu durum resmin kullanılabilirliğini azaltır
uk: Не знайдено значення заголовка, це знижує зручність використання зображення

source: No make and model value found, no assumption on focal length or GPS precision can be made
tr: Marka ve model değeri bulunamadı, odak uzaklığı veya GPS hassasiyeti konusunda herhangi bir varsayımda bulunulamaz
uk: Не знайдено значення марки та моделі, неможливо зробити припущення щодо фокусної відстані або точності GPS

source: No focal length value was found, this prevents calculating field of view
tr: Odak uzaklığı değeri bulunamadı, bu durum görüş alanının hesaplanmasını engelliyor
uk: Не знайдено значення фокусної відстані, що унеможливлює розрахунок поля зору

source: No GPS accuracy value found, this prevents computing a quality score
tr: GPS doğruluk değeri bulunamadı, bu durum kalite puanının hesaplanmasını engelliyor
uk: Не знайдено значення точності GPS, що унеможливлює обчислення показника якості

source: No GPS horizontal positioning error value found, GPS accuracy can only be estimated
tr: GPS yatay konumlandırma hatası değeri bulunamadı, GPS doğruluğu yalnızca tahmin edilebilir
uk: Не виявлено значення горизонтальної похибки позиціонування GPS, точність GPS можна лише оцінити

source: No GPS coordinates or broken coordinates in picture EXIF tags
tr: Resim EXIF etiketlerinde GPS koordinatları veya bozuk koordinatlar yok
uk: Відсутність GPS-координат або пошкоджені координати в тегах EXIF зображення

source: No valid date in picture EXIF tags
tr: Resim EXIF etiketlerinde geçerli tarih yok
uk: Немає дійсної дати в тегах EXIF зображення

source: The picture is missing mandatory metadata:
tr: Resimde zorunlu meta veriler eksik:
uk: На зображенні відсутні обов'язкові метадані:

source: GPSLatitudeRef not found, assuming GPSLatitudeRef is North
tr: GPSLatitudeRef bulunamadı, GPSLatitudeRef'in Kuzey olduğu varsayılıyor
uk: GPSLatitudeRef не знайдено, припускаючи, що GPSLatitudeRef є північним

source: Broken GPS coordinates in picture EXIF tags
tr: Resim EXIF etiketlerinde bozuk GPS koordinatları
uk: Пошкоджені GPS-координати в тегах EXIF зображення

source: GPSLongitudeRef not found, assuming GPSLongitudeRef is East
tr: GPSLongitudeRef bulunamadı, GPSLongitudeRef'in Doğu olduğu varsayılıyor
uk: GPSLongitudeRef не знайдено, припускаючи, що GPSLongitudeRef є східним

source: Precise timezone information not found, fallback to UTC
tr: Kesin saat dilimi bilgisi bulunamadı, UTC'ye geri dönüldü
uk: Точна інформація про часовий пояс не знайдена, використовується UTC

source: Precise timezone information not found (and no GPS coordinates to help), fallback to UTC
tr: Kesin saat dilimi bilgisi bulunamadı (ve yardımcı olacak GPS koordinatları da yok), UTC'ye geri dönün
uk: Точна інформація про часовий пояс не знайдена (і немає координат GPS, які могли б допомогти), перехід на UTC

source: Skipping original date/time (from {datefield}) as it was not recognized: {v}
tr: Orijinal tarih/saat ({datefield}) tanınmadığı için atlanıyor: {v}
uk: Пропускається оригінальна дата/час (з {datefield}), оскільки вони не були розпізнані: {v}

source: GPSTimeStamp and GPSDateTime don't contain supported time format (in {group} group)
tr: GPSTimeStamp ve GPSDateTime desteklenen saat biçimini içermiyor ({group} grubunda)
uk: GPSTimeStamp і GPSDateTime не містять підтримуваного формату часу (у групі {group})

source: Skipping GPS date/time ({group} group) as it was not recognized: {v}
tr: Tanınmadığı için GPS tarihi/saati ({group} grubu) atlanıyor: {v}
uk: Пропуск дати/часу GPS (група {group}), оскільки вони не були розпізнані: {v}

source: Microseconds read from decimal seconds value ({microsecondsFromSeconds}) is not matching value from EXIF field ({microseconds}). Max value will be kept.
tr: Ondalık saniye değerinden ({microsecondsFromSeconds}) okunan mikrosaniye değeri, EXIF alanından ({microseconds}) alınan değerle eşleşmiyor. Maksimum değer korunacaktır.
uk: Мікросекунди, зчитані з десяткового значення секунд ({microsecondsFromSeconds}), не відповідають значенню з поля EXIF ({microseconds}). Буде збережено максимальне значення.

source: Unsupported key in additional tags ({k})
tr: Ek etiketlerde desteklenmeyen anahtar ({k})
uk: Непідтримуваний ключ у додаткових тегах ({k})
