Repository: pypi-data/pypi-mirror-403
Catalog: packages/akademy-party/akademy_party-1.1.0-py3-none-any.whl/trytond/modules/akademy_party/locale/*.po
Languages: fr

# field:party.party,bi_number:
source: B.I nº
fr: ID nº

# field:party.party,date_birth:
source: Nascimento
fr: Naissance

# field:party.party,father:
source: Pai
fr: Père

# field:party.party,is_institution:
source: Instituição
fr: Institution

# field:party.party,is_person:
source: Pessoa
fr: Personne

# field:party.party,marital_status:
source: Estado civil
fr: État civil

# field:party.party,mother:
source: Mãe
fr: Mère

# help:party.party,bi_number:
source: Número do bilhete de intidade.
fr: Numéro de carte d'identité.

# help:party.party,father:
source: Nome do pai.
fr: Nom du père.

# help:party.party,is_institution:
source: A entidade é uma instituição ou organização.
fr: L'entité est une institution ou une organisation.

# help:party.party,is_person:
source: A entidade é uma pessoa.
fr: L'entité est une personne.

# help:party.party,mother:
source: Nome da mãe.
fr: Nom de la mère.

# model:ir.ui.menu,name:akademy_entities
source: Entidades
fr: Entités

# model:ir.ui.menu,name:akademy_party
source: Gestão Entidades
fr: Gestion d'entités

# model:party.party,name:
source: Party
fr: Tier

# selection:party.party,gender:
source: Agênero
fr: Non-genre

# selection:party.party,gender:
source: Dois Espíritos
fr: Deux esprits

# selection:party.party,gender:
source: Gênero Fluído
fr: Fluidité de genre

# selection:party.party,gender:
source: Gêneroqueer
fr: Personnes non binaires

# selection:party.party,gender:
source: Masculino
fr: Masculin

# selection:party.party,gender:
source: Não-Binário
fr: Non-binaire

# selection:party.party,gender:
source: Pangênero
fr: Pangender

# selection:party.party,gender:
source: Transgênero
fr: Transgenre

# selection:party.party,marital_status:
source: Casado(a)
fr: Marié(e)

# selection:party.party,marital_status:
source: Casamento Civil
fr: Mariage civil

# selection:party.party,marital_status:
source: Casamento Religioso
fr: Mariage Religieux

# selection:party.party,marital_status:
source: Casamento de Fato
fr: Mariage de fait

# selection:party.party,marital_status:
source: Divorciado(a)
fr: Divorcé(e)

# selection:party.party,marital_status:
source: Relacionamento Aberto
fr: Relation Ouverte

# selection:party.party,marital_status:
source: Relação Doméstica Registrada
fr: Relation Domestique Enregistrée

# selection:party.party,marital_status:
source: Separado(a)
fr: Séparé(e)

# selection:party.party,marital_status:
source: Solteiro(a)
fr: Célibataire

# selection:party.party,marital_status:
source: União Estável
fr: Mariage de fait

# selection:party.party,marital_status:
source: Víuvo(a)
fr: Veuf/Veuve
