Repository: pypi-data/pypi-mirror-403
Catalog: packages/mkdocs-quiz/mkdocs_quiz-1.5.3.tar.gz/mkdocs_quiz-1.5.3/mkdocs_quiz/locales/*.po
Languages: hi, id, pt_br

source: Submit
hi: जमा करें
id: Kirim
pt_br: Enviar

source: Question {n}
hi: प्रश्न {n}
id: Pertanyaan {n}
pt_br: Questão {n}

source: Quiz Progress
hi: क्विज़ प्रगति
id: Progres Kuis
pt_br: Progresso do quiz

source: questions answered
hi: प्रश्नों के उत्तर दिए गए
id: pertanyaan terjawab
pt_br: questões respondidas

source: correct
hi: सही
id: benar
pt_br: correto

source: Quiz Complete!
hi: क्विज़ पूर्ण!
id: Kuis Selesai!
pt_br: Quiz completo!

source: Reset quiz
hi: क्विज़ रीसेट करें
id: Atur ulang kuis
pt_br: Reiniciar quiz

source: Quiz results are saved to your browser's local storage and will persist between sessions.
hi: क्विज़ परिणाम आपके ब्राउज़र के स्थानीय संग्रहण में सहेजे जाते हैं और सत्रों के बीच बने रहेंगे।
id: Hasil kuis disimpan di penyimpanan lokal browser Anda dan akan tetap ada di antara sesi.
pt_br: Os resultados do quiz são salvos no local storage do seu browser e serão persistidos entre as sessões.

source: Outstanding! You aced it!
hi: शानदार! आपने बहुत अच्छा किया!
id: Luar biasa! Anda berhasil dengan sempurna!
pt_br: Excelente! Você arrasou!

source: Great job! You really know your stuff!
hi: बहुत बढ़िया! आप वाकई इसमें माहिर हैं!
id: Kerja bagus! Anda benar-benar menguasai materi ini!
pt_br: Excelente trabalho! Você realmente entende do assunto!

source: Good effort! Keep learning!
hi: अच्छा प्रयास! सीखते रहें!
id: Usaha yang baik! Terus belajar!
pt_br: Bom trabalho! Continue aprendendo!

source: Not bad, but there's room for improvement!
hi: बुरा नहीं, लेकिन सुधार की गुंजाइश है!
id: Tidak buruk, tapi masih ada ruang untuk perbaikan!
pt_br: Nada mal, mas há espaço para melhorias!

source: Better luck next time! Keep trying!
hi: अगली बार बेहतर होगा! कोशिश करते रहें!
id: Semoga lebih baik lain kali! Terus mencoba!
pt_br: Boa sorte na próxima vez! Continue tentando!

source: Are you sure you want to reset the quiz? This will clear your progress.
hi: क्या आप वाकई क्विज़ रीसेट करना चाहते हैं? इससे आपकी प्रगति मिट जाएगी।
id: Apakah Anda yakin ingin mengatur ulang kuis? Ini akan menghapus progres Anda.
pt_br: Tem certeza de que deseja reiniciar o teste? Isso apagará seu progresso.

source: Try Again
hi: पुनः प्रयास करें
id: Coba Lagi
pt_br: Tente novamente

source: Correct answer!
hi: सही उत्तर!
id: Jawaban benar!
pt_br: Resposta correta!

source: Incorrect answer. Please try again.
hi: गलत उत्तर। कृपया पुनः प्रयास करें।
id: Jawaban salah. Silakan coba lagi.
pt_br: Resposta incorreta. Tente de novo.

source: Incorrect answer.
hi: गलत उत्तर।
id: Jawaban salah.
pt_br: Resposta incorreta.

source: Answered:
hi: उत्तर दिए:
id: Dijawab:
pt_br: Respondido:

source: Correct:
hi: सही:
id: Benar:
pt_br: Correto:

source: Reset
hi: रीसेट
id: Atur ulang
pt_br: Reiniciar

source: (empty)
hi: (खाली)
id: (kosong)
pt_br: (vazio)
