Repository: pypi-data/pypi-mirror-403
Catalog: packages/mkdocs-quiz/mkdocs_quiz-1.5.4-py3-none-any.whl/mkdocs_quiz/locales/*.po
Languages: no, sv

source: Submit
no: Send inn
sv: Skicka

source: Question {n}
no: Spørsmål {n}
sv: Fråga {n}

source: Quiz Progress
no: Pågående quiz
sv: Quiz-framsteg

source: questions answered
no: spørsmål besvart
sv: frågor besvarade

source: correct
no: riktig
sv: korrekt

source: Quiz Complete!
no: Quiz fullført!
sv: Quiz slutfört!

source: Reset quiz
no: Tilbakestill quiz
sv: Återställ quiz

source: Quiz results are saved to your browser's local storage and will persist between sessions.
no: Quiz resultatene blir liggende i nettleserens lokale lagring og vil bestå mellom økter.
sv: Quiz-resultat sparas i webbläsarens lokala lagring och kommer att finnas kvar mellan sessioner.

source: Outstanding! You aced it!
no: Utmerket! Du er virkelig et ess!
sv: Enastående! Du klarade det perfekt!

source: Great job! You really know your stuff!
no: Bra jobba! Det her var du flink på!
sv: Bra gjort! Du kan verkligen dina saker!

source: Good effort! Keep learning!
no: Godt forsøk! Dette emnet kan du mye om!
sv: Bra försök! Fortsätt lära!

source: Not bad, but there's room for improvement!
no: Ikke verst, men det finnes rom for forbedring!
sv: Inte dåligt, men det finns utrymme för förbättring!

source: Better luck next time! Keep trying!
no: Bedre lykke neste gang! Ikke gi opp!
sv: Bättre lycka nästa gång! Fortsätt försöka!

source: Are you sure you want to reset the quiz? This will clear your progress.
no: Er du sikker på at du vil tilbakestille quizen? Dette vil slette fremgangen din.
sv: Är du säker på att du vill återställa quizet? Detta kommer att radera dina framsteg.

source: Try Again
no: Prøv igjen
sv: Försök igen

source: Correct answer!
no: Riktig svar!
sv: Rätt svar!

source: Incorrect answer. Please try again.
no: Feil svar. Vennligst prøv igjen.
sv: Fel svar. Försök igen.

source: Incorrect answer.
no: Feil svar.
sv: Fel svar.

source: Answered:
no: Besvart:
sv: Besvarade:

source: Correct:
no: Riktig:
sv: Korrekta:

source: Reset
no: Tilbakestill
sv: Återställ

source: (empty)
no: (tom)
sv: (tomt)
