Repository: pypi-data/pypi-mirror-403
Catalog: packages/allianceauth-afat/allianceauth_afat-4.3.2-py3-none-any.whl/afat/locale/*/LC_MESSAGES/django.po
Languages: de, ru, uk

source: Fleet Activity Tracking
de: Flotten Aktivitäts Verfolgung
ru: Учет Боевых Вылетов
uk: Відстежування активності у флоті

source: Fleet type
de: Flottenart
ru: Тип флота
uk: Тип флоту

source: Is enabled
de: Ist aktiviert
ru: Разрешен
uk: Увімкнено

source: Activate selected fleet types
de: Aktiviere ausgewählte Flottenarten
ru: Активировать выбранные типы флота
uk: Активуйте обрані типи флотів

source: Failed to activate {failed} fleet type
de: Aktivieren von {failed} Flottenart ist fehlgeschlagen
ru: Не удалось активировать {failed} тип флота
uk: Не вдалось активувати: {failed} тип флоту

source: Activated {notifications_count} fleet type
de: {notifications_count} Flottenart aktiviert
ru: Активирован {notifications_count} тип флота
uk: Активовано {notifications_count} тип флоту

source: Deactivate selected fleet types
de: Deaktiviere ausgewählte Flottenarten
ru: Деактивировать выбранные типы флота
uk: Деактивувати обрані типи флотів

source: Failed to deactivate {failed} fleet type
de: Deaktivieren von {failed} Flottenart ist fehlgeschlagen
ru: Не удалось деактивировать {failed} тип флота
uk: Не вдалось деактивувати {failed} тип флоту

source: Deactivated {notifications_count} fleet type
de: {notifications_count} Flottenart deaktiviert
ru: Деактивировать {notifications_count} тип флота
uk: Деактивовано {notifications_count} тип флоту

source: Fleet types
de: Flottenarten
ru: Типы флота
uk: Типи флоту

source: Ship classes
de: Schiffsklassen
ru: Классы кораблей
uk: Класи кораблів

source: This field is mandatory
de: Dies ist ein Pflichtfeld
ru: Обязательное поле
uk: Це поле обовʼязкове

source: Fleet name
de: Flottenname
ru: Название флота
uk: Назва флоту

source: Enter fleet name
de: Flottenname hier eintragen
ru: Введите название флота
uk: Введіть назву флоту

source: Fleet type (optional)
de: Flottenart (optional)
ru: Тип флота (не обязательно)
uk: Тип флоту (необов'язково)

source: Doctrine (optional)
de: Doktrin (optional)
uk: Доктрина (необов'язково)

source: Character Name
de: Charaktername
ru: Имя пилота
uk: Ім'я персонажа

source: System
ru: Система
uk: Система

source: Ship type
de: Schiffstyp
ru: Тип корабля
uk: Тип корабля

source: FAT link expiry time in minutes
de: FAT-Link Ablaufzeit in Minuten
ru: Срок действия ссылки РБВ в минутах
uk: Термін дії FAT-посилання в хвилинах

source: Expiry time in minutes
de: Ablaufzeit in Minuten
ru: Срок действия в минутах
uk: Термін дії в хвилинах

source: %(count)d year
de: %(count)d Jahr
uk: %(count)d рік

source: %(count)d day
de: %(count)d Tag
uk: %(count)d день

source: %(count)d hour
de: %(count)d Stunde
uk: %(count)d година

source: %(count)d minute
uk: %(count)d хвилина

source: %(count)d second
de: %(count)d Sekunde
uk: %(count)d секунд

source: %(l10n_year)s, %(l10n_day)s, %(l10n_hour)s, %(l10n_minute)s and %(l10n_second)s
de: %(l10n_year)s, %(l10n_day)s, %(l10n_hour)s, %(l10n_minute)s und %(l10n_second)s
uk: %(l10n_year)s, %(l10n_day)s, %(l10n_hour)s, %(l10n_minute)s та %(l10n_second)s

source: Delete
de: Löschen
ru: Удалить
uk: Видалити

source: Stop tracking
de: Tracking stoppen
ru: Остановить отслеживание
uk: Припинити відстеження

source: <p>Are you sure you want to close ESI fleet with ID {esi_fleet_id} from {character_name}?</p>
de: <p>Bist Du sicher das Du die ESI Flotte mit ID {esi_fleet_id} von {character_name} schließen möchtest?</p>
uk: <p>Ви впевнені, що хочете закрити флот ESI з ID {esi_fleet_id} від {character_name}</p>

source: <p>Are you sure you want to delete FAT link {fatlink_fleet}?</p>
de: <p>Bist Du sicher das Du den FAT-Link {fatlink_fleet} löschen möchtest?</p>
ru: <p>Действительно удалить ссылку РБВ {fatlink_fleet}?</p>
uk: <p>Ви впевнені, що хочете видалити посилання FAT {fatlink_fleet}?</p>

source: <p>Are you sure you want to remove {character_name} from this FAT link?</p>
de: <p>Bist Du sicher das Du {character_name} von diesem FAT-Link löschen möchtest?</p>
ru: <p>Действительно удалить {character_name} из этого БВ?</p>
uk: <p>Ви впевнені, що хочете видалити {character_name} з цього посилання FAT?</p>

source: {fatlink_hash} (Deleted)
de: {fatlink_hash} (Gelöscht)
ru: {fatlink_hash} (Удалено)
uk: {fatlink_hash} (Видалено)

source: Monday
de: Montag
ru: Понедельник
uk: Понеділок

source: Tuesday
de: Dienstag
ru: Вторник
uk: Вівторок

source: Wednesday
de: Mittwoch
ru: Среда
uk: Середа

source: Thursday
de: Donnerstag
ru: Четверг
uk: Четвер

source: Friday
de: Freitag
ru: Пятница
uk: П'ятниця

source: Saturday
de: Samstag
ru: Суббота
uk: Субота

source: Sunday
de: Sonntag
ru: Воскресенье
uk: Неділя

source: Can access the AFAT module
de: Kann auf das AFAT Modul zugreifen
ru: Имеет доступ к модулю AFAT
uk: Може отримати доступ до модуля AFAT

source: Can manage the AFAT module
de: Kann das AFAT Modul verwalten
ru: Может управлять модулем АFAT (БВ и ссылки РБВ)
uk: Може керувати модулем AFAT

source: Can create FAT links
de: Kann FAT-Links erstellen
ru: Может создавать ссылки РБВ
uk: Може створювати FAT-посилання

source: Can see own corporation statistics
de: Kann Statistiken der eigenen Corporation sehen
ru: Может просматривать статистику корпорации
uk: Може переглядати статистику своєї корпорації

source: Can see statistics of other corporations
de: Kann Statistiken anderer Corporationen sehen
ru: Может просматривать статистику всех корпораций
uk: Може переглядати статистику інших корпорацій

source: Can view the modules log
de: Kann das Log des Moduls sehen
ru: Может просматривать журнал модуля
uk: Може переглядати журнал модуля

source: Descriptive name of the fleet type
de: Beschreibender Name für die Flottenart
ru: Характерное название данного типа флота
uk: Опис типу флоту

source: Whether this fleet type is active or not
de: Ist diese Flottenart aktiv oder nicht
ru: Активен или нет данный тип флота
uk: Чи активний цей тип флоту

source: FC is not in the registered fleet anymore or fleet is no longer available.
de: Der FC ist nicht mehr in der registrierten Flotte oder die Flotte ist nicht länger verfügbar.
ru: ФК больше не состоит в зарегистрированном флоте или флот недоступен.
uk: ФлітКом не знаходиться в зареєстрованому флоті або флот вже не доступний.

source: Registered fleet seems to be no longer available.
de: Die registrierte Flotte scheint nicht mehr verfügbar zu sein.
ru: Похоже, зарегистрированный флот больше недоступен.
uk: Зареєстрований флот, здається, більше не доступний.

source: FC is no longer the fleet boss.
de: Der FC ist nicht länger Flottenchef.
ru: ФК больше не руководитель флота.
uk: ФлітКом більше не бос флоту.

source: FC switched to another fleet.
de: Der FC wechselte zu einer anderen Flotte.
ru: ФК перешел в другой флот.
uk: ФлітКом перейшов до іншого флоту.

source: When was this FAT link created
de: Wann wurde dieser FAT-Link erstellt
ru: Время БВ
uk: Коли було створено це FAT-посилання

source: The FAT link fleet name
de: FAT-Link Flottenname
ru: Название флота БВ
uk: Назва флоту FAT-посилання

source: The FAT link hash
de: FAT-Link Hash
ru: Хэш БВ
uk: Хеш FAT-посилання

source: Who created the FAT link?
de: Wer hat diesen FAT-Link erstellt?
ru: Кто создал БВ?
uk: Хто створив FAT-посилання?

source: Character this FAT link has been created with
de: Der Charakter durch den dieser FAT-Link erstellt wurde
ru: Пилот, от имени которого создан БВ
uk: Персонаж через которого було створено FAT-посилання

source: The FAT link fleet type, if it's set
de: FAT-Link Flottenart, wenn gesetzt
ru: Тип флота БВ, при наличии
uk: Тип флоту FAT-посилання, якщо встановлено

source: The FAT link doctrine
de: FAT-Link Doktrin
uk: Доктрина FAT-посилання

source: Whether this FAT link was created via ESI or not
de: Wurde dieser FAT-Link mittels ESI erstellt oder nicht
ru: БВ создан с ESI отслеживанием или нет
uk: Чи створено це FAT-посилання через ESI

source: Whether the fleet to this FAT link is available in ESI or not
de: Ist die Flotte zu diesem FAT-Link in ESI verfügbar oder nicht
ru: Флот этого БВ все еще доступен посредством ESI или нет
uk: Чи доступний флот для цього FAT-посилання в ESI

source: Has this FAT link being re-opened?
de: Wurde dieser FAT-Link nochmals geöffnet?
ru: Ссылка РБВ была реактивирована?
uk: Чи перевідкрито це FAT-посилання?

source: FAT link
ru: Ссылка РБВ
uk: FAT-посилання

source: FAT links
ru: Ссылки РБВ
uk: FAT-посилання

source: FAT link duration
de: FAT-Link Laufzeit
ru: Цикл жизни ссылки
uk: Тривалість FAT-посилання

source: FAT link durations
de: FAT-Link Laufzeiten
ru: Длительности БВ
uk: Тривалість FAT-посилання

source: Character who registered this FAT
de: Charakter welcher diesen FAT registriert hat
ru: Пилот - участник БВ
uk: Персонаж який зареєстрував цей FAT

source: Corporation EVE ID of the character who registered this FAT at the time of registration
de: EVE ID der Corporation des Charakters, der für diesen FAT registriert ist, zum Zeitpunkt der Registrierung
uk: EVE ID копрорації персонажа, який зареєстрував цей FAT на момент реєстрації

source: Alliance EVE ID of the character who registered this FAT at the time of registration
de: EVE ID der Allianz des Charakters, der für diesen FAT registriert ist, zum Zeitpunkt der Registrierung
uk: EVE ID альянсу персонажа, який зареєстрував цей FAT на момент реєстрації

source: The FAT link the character registered at
de: Der FAT-Link zu dem der Charakter registriert ist
ru: Использованная ссылка РБВ
uk: FAT-посилання персонажа який зареєстрував

source: The system the character is in
de: Das System in dem der Charakter ist
ru: Местонахождение пилота
uk: Система розташування персонажа

source: The ship the character was flying
de: Das Schiff welches der Charakter geflogen ist
ru: Корабль пилота
uk: Корабель персонажа

source: FATs
ru: БВП
uk: FATи

source: FAT link created
de: FAT-Link erstellt
ru: Ссылка РБВ создана
uk: FAT-посилання створено

source: FAT link changed
de: FAT-Link geändert
ru: Ссылка РБВ изменена
uk: FAT-посилання змінено

source: FAT link removed
de: FAT-Link entfernt
ru: Ссылка РБВ удалена
uk: FAT-посилання видалено

source: FAT link re-opened
de: FAT-Link erneut geöffnet
ru: Ссылка РБВ реактивирована
uk: FAT-посилання перевідкрито

source: FAT removed
de: FAT entfernt
ru: БВП аннулирован
uk: FAT видалено

source: Manual FAT added
de: Manueller FAT Eintrag hinzugefügt
ru: Особая регистрация БВП
uk: Ручний FAT додано

source: Log
ru: Журнал
uk: Журнал

source: Logs
ru: Журнал
uk: Журнал

source: Short name to identify this doctrine
de: Kurzname der Doktrin
ru: Короткое название формата
uk: Коротка назва для ідентифікації цієї доктрини

source: Name
ru: Название
uk: Назва

source: You can add notes about this doctrine here if you want. (optional)
de: Du kannst hier bei Bedarf Notizen zu dieser Doktrin hinzufügen. (optional)
uk: Ви можете додати примітки щодо цієї доктрини. (необов'язково)

source: Notes
de: Notizen
ru: Примечания
uk: Примітки

source: Whether this doctrine is enabled or not.
de: Ist diese Doktrin aktiv oder nicht.
uk: Чи активна ця доктрина.

source: Doctrine
de: Doktrin
ru: Формат
uk: Доктрина

source: Doctrines
de: Doktrinen
uk: Доктрини

source: Default FAT link expiry time
de: FAT-Link Ablaufzeit in Minuten
uk: Термін дії FAT-посилання за замовчуванням

source: Default FAT link reopen duration
de: Standarddauer für wieder geöffnete FAT-Links
uk: Тривалість повторного відкриття посилання FAT за замовчуванням

source: Default FAT link reopen grace time
de: Standarddauer in der FAT-Links wieder geöffnet werden können
uk: Час для повторного відкриття посилання FAT за замовчуванням

source: Default log duration
de: Standardprotokolldauer
uk: Час зберігання журналу за замовчуванням

source: Use doctrines from fittings module
de: Doktrinen vom Fittings Modul nutzen
uk: Використовувати доктрини з модуля фітингів

source: Default expiry time for clickable FAT links in minutes. (Default: 60 minutes)
de: Standardablaufzeit für klickbare FAT-Links in Minuten. (Standard: 60 Minuten)
uk: Час до закінчення терміну дії активних FAT-посилань. (За замовчуванням: 60 хвилин)

source: Default time in minutes a FAT link can be re-opened after it is expired. (Default: 60 minutes)
de: Standardzeit in Minuten in der ein FAT-Link nach Ablauf wieder geöffnet werden. (Standard: 60 Minuten)
uk: Час протягом якого можна знову відкрити посилання FAT після його завершення. (За замовчуванням: 60 хвилин)

source: Default time in minutes a FAT link is re-opened for. (Default: 60 minutes)
de: Standardzeit in Minuten die ein FAT-Link wieder geöffnet wird. (Standard: 60 Minuten)
uk: Тривалість повторного відкриття посилання FAT у хвилинах. (За замовчуванням: 60 хвилин)

source: Default time in days a log entry is kept. (Default: 60 days)
de: Standardzeit in Tagen die ein Protokolleintrag gespeichert wird. (Standard: 60 Tage)
uk: Тривалість зберігання запису в журналі в днях. (За замовчуванням: 60 днів)

source: Whether to use the doctrines from the Fittings modules in the doctrine dropdown. Note: The fittings module needs to be installed for this.
de: Sollen die Doktrinen aus dem Fittings Modul genutzt werden? Hinweis: das Fittings Module muss hierfür installiert sein.
ru: Использование форматов из модуля Fittings в списке выбора формата. Примечание: модуль Fittings должен быть установлен.
uk: Чи використовувати доктрини з модуля фітингів у випадаючому списку доктрин. Примітка: для цього необхідно встановити модуль фітингів.

source: Setting
de: Einstellung
ru: Установка
uk: Налаштування

source: Settings
de: Einstellungen
ru: Настройки
uk: Налаштування

source: AFAT Settings
de: AFAT Einstellungen
uk: Налаштування AFAT

source: The filter name that is shown to the admin.
de: Der Filtername, der dem Administrator angezeigt wird.
uk: Назва фільтра, що відображатиметься адміну.

source: The filter description that is shown to end users.
de: Die Filterbeschreibung welche den Benutzern angezeigt wird.
ru: Описание фильтра, отображаемое пользователю.
uk: Опис фільтра, який відображається користувачам.

source: Please create a filter!
de: Bitte erstelle einen Filter!
ru: Пожалуйста, создайте фильтр!
uk: Будь ласка, створіть фільтр!

source: Please create an audit function!
de: Bitte erstelle eine Audit-Funktion!
ru: Пожалуйста, создайте функцию аудита!
uk: Будь ласка, створіть функцію аудиту!

source: The number of days to look back for FATs.
de: Die Anzahl der Tage, die für FATs zurückgesucht werden soll.
uk: Кількість днів за які подвитись ФАТи.

source: The number of FATs needed to pass the filter.
de: Die Anzahl der FATs, die zum Passieren des Filters erforderlich sind.
uk: Кількість ФАТів, необхідних для проходження фільтру.

source: Any of the selected fleet types are needed to pass the filter.
de: Um den Filter zu bestehen, muss einer der ausgewählten Flottentypen vorhanden sein.
uk: Будь який з обраних типів флотів, які необхідні для проходження фільтру.

source: Any of the selected ship classes are needed to pass the filter.
de: Um den Filter zu bestehen, muss eine der ausgewählten Schiffsklassen vorhanden sein.
uk: Будь який з обраних класів кораблів, які необхідні для проходження фільтру.

source: Smart Filter: FATs in time period
de: Smart Filter: FATs in Zeitraum
uk: Смарт-фільтр: ФАТи за період часу

source: Close
de: Schließen
ru: Закрыть
uk: Закрити

source: Cancel
de: Abbrechen
ru: Отмена
uk: Скасувати

source: Confirm
de: Bestätigen
ru: Подтвердить
uk: Підтвердити

source: Previous month
de: Vorheriger Monat
ru: Предыдущий месяц
uk: Попередній місяць

source: Next month
de: Nächster Monat
ru: Следующий месяц
uk: Наступний місяць

source: Current month
de: Aktueller Monat
ru: Текущий месяц
uk: Поточний місяць

source: Dashboard
ru: Панель
uk: Панель керування

source: Statistics
de: Statistik
ru: Статистика
uk: Статистика

source: Add FAT link
de: FAT-Link hinzufügen
ru: Добавить ссылку
uk: Додати FAT-посилання

source: View log
de: Log ansehen
ru: Открыть журнал
uk: Переглянути журнал

source: Previous year
de: Vorheriger Monat
ru: Предыдущий год
uk: Попередній рік

source: Next year
de: Nächstes Jahr
ru: Следующий год
uk: Наступний рік

source: Current year
de: Aktuelles Jahr
ru: Текущий год
uk: Поточний рік

source: Loading …
de: Lade …
ru: Загрузка …
uk: Завантаження …

source: Most recent FAT links <small>(latest 10)</small>
de: Neueste FAT-Links <small>(letzten 10)</small>
ru: Недавние Боевые Вылеты <small>(последние 10)</small>
uk: Найновіші FAT-посилання <small>(останні 10)</small>

source: Creator
de: Ersteller
ru: Создатель
uk: Автор

source: EVE time
de: EVE Zeit
ru: Время EVE
uk: Час за EVE

source: Actions
de: Aktionen
ru: Действия
uk: Дії

source: Your most recent FATs
de: Deine neuesten FAT-Links
ru: Ваши недавние БВП
uk: Ваші останні FATи

source: Only characters that have recent FATs are shown. <small>(latest 10 FATs per character)</small>
de: Nur Charaktere mit kürzlichen FATs werden angezeigt. <small>(Letzte 10 FATs je Charakter)</small>
ru: Показаны пилоты, у которых недавно были БВП. <small>(последние 10 БВП для пилота)</small>
uk: Показано лише персонажів, які мають останні FATи. <small>(останні 10 FATи на персонажа)</small>

source: Location
de: Ort
ru: Местоположение
uk: Розташування

source: Ship
de: Schiff
ru: Корабль
uk: Корабель

source: No recent FAT activity registered for any of your characters.
de: Keine Aktivität für Deine Charaktere registriert.
ru: Для ваших пилотов БВП не найдены.
uk: Немає останньої активності FAT для жодного з ваших персонажів.

source: Delete FAT link
de: FAT-Link löschen
ru: Удаление линка
uk: Видалити FAT-посилання

source: Create a clickable FAT link
de: Klickbaren FAT-Link erstellen
ru: Регистрация Боевого Вылета, учет пилотов по ссылке
uk: Створити FAT-посилання

source: This option will create a clickable link to share with your fleet members.
de: Diese Option erstellt einen klickbaren Link den Du in der Flotte teilen kannst.
ru: Эта опция регистрирует БВ и формирует ссылку РБВ, предназначенную для учета пилотов.
uk: Ця опція створить посилання для ваших членів флоту.

source: Create link
de: Link erstellen
ru: Создать ссылку
uk: Створити посилання

source: Create a FAT link using ESI
de: ESI-Link erstellen
ru: Регистрация Боевого Вылета, учет пилотов посредством ESI
uk: Створити FAT-посилання за допомогою ESI

source: This option will automatically register and track the entire fleet without fleet members having to click a link. <b>Use this if you are the Fleet Boss</b>, otherwise please use the clickable FAT link option.
de: Diese Option wird die Flotte automatisch registrieren und tracken. Es muss kein Link in der Flotte geteilt werden. <b>Nutze diese Option wenn Du der Flottenkommandant bist</b>, ansonsten nutze die Option für klickbare FAT-Links.
ru: Эта опция будет автоматически регистрировать и отслеживать флот при этом членам флота не нужно будет переходить по ссылке <b>Используйте если вы флитком</b>, Иначе воспользуйтесь ссылкой на БВА
uk: Ця опція автоматично зареєструє та відстежить флот без того, щоб учасники флоту переxодили за посиланням. <b>Використовуйте це, якщо ви є командиром флоту</b>, в іншому випадку, будь ласка, використовуйте опцію FAT-посилання.

source: This will start tracking your fleet automatically and add pilots to it as they join until the fleet is either closed in-game (meaning you leave the fleet), or you stop the tracking here.
de: Piloten die Deiner Flotte beitreten werden automatisch zu diesem FAT-Link hinzugefügt bis die Flotte geschlossen in Eve wird (Du verlässt die Flotte ingame) oder Du das Tracking hier stoppst.
ru: Эта опция начинает автоматическое отслеживание всеx пилотов флота до закрытия флота в игре (в том числе выхода командующего из флота) или остановки отслеживания здесь.
uk: Ця опція автоматично почне відстежувати ваш флот та додавати пілотів до нього, як тільки вони приєднаються, поки флот не буде закритий у грі (що означає, що ви покидаєте флот), або поки ви не зупините відстеження тут.

source: Add ESI link
de: ESI-Link hinzufügen
ru: Начать ESI отслеживание флота
uk: Додати ESI посилання

source: Link created (EVE Time)
de: Link erstellt (EVE Zeit)
ru: Время создания (Время EVE)
uk: Час створення посилання (EVE Time)

source: Link expires (EVE Time)
de: Link läuft ab (EVE Zeit)
ru: Срок действия истекает (Время EVE)
uk: Посилання прострочиться (EVE Time)

source: Link expired (EVE Time)
de: Link abgelaufen (EVE Zeit)
ru: Срок действия истек (Время EVE)
uk: Посилання прострочене (EVE Time)

source: Participation is being tracked via ESI
de: Teilnahme wird mittels ESI verfolgt
ru: Учет пилотов осуществляется посредством ESI
uk: Участь відстежується через ESI

source: <p>Are you sure you want to close ESI fleet with ID %(esi_fleet_id)s from %(character_name)s</p>
de: <p>Bist Du sicher das Du die ESI Flotte mit ID %(esi_fleet_id)s von %(character_name)s schließen möchtest?</p>
ru: <p>Действительно прекратить ESI отслеживание флота с идентификатором %(esi_fleet_id)s пилота %(character_name)s</p>
uk: <p>Ви впевнені, що хочете закрити флот ESI з ID %(esi_fleet_id)s від %(character_name)s</p>

source: Participation has been tracked via ESI
de: Teilnahme wurde mittels ESI verfolgt
ru: Учет пилотов осуществлялся посредством ESI
uk: Участь відстежується через ESI

source: This link has already expired but is within the grace<br>time of %(reopen_grace_time)s minutes where it can be re-opened.
de: Dieser Link ist bereits angelaufen aber noch in der Nachfrist<br>von %(reopen_grace_time)s Minuten um ihn wieder zu öffnen.
ru: Срок действия ссылки истек, но в течение <br>%(reopen_grace_time)s минут она может быть реактивирована.
uk: Це посилання вже деактивовано, але можна його повторно відкрити через %(reopen_grace_time)s хвилин.

source: <p>Are you sure you want to re-open this FAT link for another %(reopen_duration)s minutes?<br>FAT links can be re-opened only once!<br><em>(Be aware, this action will be logged)</em></p>
de: <p>Bist Du sicher das Du diesen FAT-Link für weitere %(reopen_duration)s Minuten wieder öffnen willst?<br>FAT-Links können nur einmal wieder geöffnet werden!<br><em>(Diese Aktion wird geloggt)</em></p>
ru: <p>Действительно реактивировать ссылку на %(reopen_duration)s минут?<br>Ссылка может быть реактивирована только один раз!<br><em>(Предупреждение: данное действие будет занесено в журнал)</em></p>
uk: <p>Ви впевнені, що хочете повторно відкрити це FAT-посилання на %(reopen_duration)s хвилин?<br>FAT-посилання можна повторно відкрити лише один раз!<br><em>(Будь ласка, зверніть увагу, ця дія буде записана)</em></p>

source: Re-Open
de: Wieder öffnen
ru: Реактивировать
uk: Повторно відкрити

source: Re-open FAT link
de: FAT-Link wieder öffnen
ru: Реактивировать ссылку РБВ
uk: Повторно відкрити FAT-посилання

source: FAT Link
ru: Боевой Вылет
uk: FAT-посилання

source: Copy me!
de: Kopier mich!
ru: Скопируй меня!
uk: Скопіювати!

source: Close ESI fleet tracking
de: ESI-Tracking beenden
ru: Завершить ESI отслеживание
uk: Закрити відстеження флоту через ESI

source: Set name
de: Name setzen
ru: Задать имя
uk: Встановити назву

source: Manual FAT
de: Manueller FAT
ru: Особая регистрация БВ
uk: FAT вручну

source: FATs for this FAT link <small>(updated every 15 seconds)</small>
de: FATs für diesen FAT-Link <small>(alle 15 Sekunden aktualisiert)</small>
ru: частота проверки флота <small>(обновляется каждые 15 секунд)</small>
uk: FATи для цього FAT-посилання <small>(оновлено кожні 15 секунд)</small>

source: FATs for this FAT link
de: FATs für diesen FAT-Link
ru: частота проверки флота
uk: FATи для цього FAT-посилання

source: Character
de: Charakter
ru: Пилот
uk: Персонаж

source: Ship type overview
de: Schiffsübersicht
ru: Обзор типов кораблей
uk: Огляд типу корабля

source: Count
de: Anzahl
ru: Количество
uk: Кількість
