Repository: pypi-data/pypi-mirror-403
Catalog: packages/allianceauth-afat/allianceauth_afat-4.3.2-py3-none-any.whl/afat/locale/*/LC_MESSAGES/django.po
Languages: de, ru, uk

source: <h4>Warning!</h4><p>You do not have permission to view statistics for that corporation.</p>
de: <h4>Warnung!</h4><p>Du hast nicht die Berechtigung die Statistiken für diese Corporation zu sehen.</p>
ru: <h4>Внимание!</h4><p>У Вас нет прав для просмотра статистики этой корпорации.</p>
uk: <h4>Попередження!</h4><p>Ви не маєте дозволу переглядати статистику для цієї корпорації.</p>

source: Stop automatic tracking through ESI for this fleet and close the associated FAT link.
de: Stopp das automatische Tracking mittels ESI für diese Flotte und schließe den zugehörigen FAT-Link.

source: Are you sure you want to close ESI fleet with ID %(esi_fleet_id)s from %(character_name)s?
de: Bist Du sicher, dass Du die ESI Flotte mit ID %(esi_fleet_id)s von %(character_name)s schließen möchtest?

source: View the FATs associated with this link.
de: Alle FATs, die mit diesem Link verbunden sind, ansehen.

source: Delete this FAT link from the system. This action is irreversible.
de: Diesen FAT-Link aus dem System löschen. Dieser Vorgang ist unwiderruflich.

source: Are you sure you want to delete the FAT link and all registered FATs for fleet "%(fleet_name)s"?
de: Bist Du sicher, dass Du den FAT-Link und alle registrierten FATs für die Flotte „%(fleet_name)s“ löschen möchtest?

source: FAT
ru: БВП
