Repository: pypi-data/pypi-mirror-403
Catalog: packages/allianceauth-afat/allianceauth_afat-4.3.2-py3-none-any.whl/afat/locale/*/LC_MESSAGES/django.po
Languages: de, ru, uk

source: Is someone missing from the list of FATs? Use this form to add them.
de: Es fehlen Piloten in der Liste dieses FATs? Nutze dieses Formular um sie manuell hinzuzufügen.
ru: Пилот отсутствует в списке? Используйте форму, чтобы добавить его.
uk: Хтось відсутній у списку FAT? Використовуйте цю форму, щоб додати їх.

source: Note
de: Hinweis
ru: Примечание
uk: Примітка

source: This action is logged!
de: Diese Aktion wird geloggt!
ru: Действие будет занесено в журнал!
uk: Ця дія записана!

source: Character name
de: Charaktername
ru: Имя пилота
uk: Назва персонажа

source: Add manual FAT
de: Manuellen FAT hinzufügen
ru: Создать ссылку вручную
uk: Додати FAT вручну

source: Legend
de: Legende
ru: Условные обозначения
uk: Легенда

source: Fleet is currently active and FATs are automatically being tracked via ESI
de: Flotte ist momentan aktiv und FATs werden mittels ESI hinzugefügt
ru: Флот активен и пилоты автоматически отслеживаются посредством ESI
uk: Флот активний і FATи автоматично відстежуються через ESI

source: FATs have been automatically tracked via ESI
de: FATs wurden automatisch mittels ESI verfolgt
ru: Пилоты автоматически отслеживались посредством ESI
uk: FATи було автоматично відстежено через ESI

source: You currently have an active ESI fleet under the following character:
de: Du hast aktuell eine aktive ESI Flotte mit dem folgenden Charaktere:
ru: У Вас %(open_esi_fleets)s активный ESI флот под управлением следующих пилотов:
uk: У вас активний %(open_esi_fleets)s ESI флот, персонаж:

source: ESI fleet ID
de: ESI Flotten ID
ru: ESI ID флота
uk: ID флоту в ESI

source: This fleet is already automatically tracked.
de: Diese Flotte wird bereits automatisch verfolgt.
ru: Эти флоты отслеживаются автоматически.
uk: Цей флот уже відстежується автоматчино.

source: However, you can still open more fleets with other alts, if that&apos;s what you like to do.
de: Du kannst jedoch weitere Flotten mit Deinen Alts starten, wenn Du möchtest.
ru: При необходимости, Вы можете создать новые флоты под командованием других пилотов.
uk: Однак, ви можете відкрити більше флотів з іншими альтами, якщо ви хочете зробити це.

source: Note: Information about your registered fleets might be delayed by up to 5 minutes.
de: Hinweis: Informationen über registrierte Flotten können bis zu 5 Minuten verzögert sein.
ru: Примечание: информация о Ваших зарегистрированных флотах может задерживаться до 5 минут.
uk: Примітка: інформація про ваші зареєстровані флоти може відображатися з запізненням до 5 хвилин.

source: Close ESI Fleet Tracking
de: ESI Tracking beenden
ru: Завершить ESI отслеживание
uk: Закрити відстеження флоту через ESI

source: Do you want to help translate this app into your language or improve the existing translation?
de: Du möchtest helfen diese App in Deine Sprache zu übersetzen oder die bestehende Übersetzung zu verbessern?
ru: Вы хотите помочь перевести это приложение на ваш язык или улучшить текущий перевод?
uk: Хочете допомогти перекласти цю програму вашою мовою чи покращити наявний переклад?

source: Join our team of translators!
de: Tritt unserm Team von Übersetzern bei!
ru: Присоединяйтесь к нашей команде переводчиков!
uk: Приєднуйтесь до нашої команди перекладачів!

source: Fields marked with an asterisk (*) are mandatory
de: Mit einem Sternchen (*) gekennzeichnete Felder sind Pflichtfelder
ru: Поля, отмеченные (*) обязательны
uk: Поля, позначені зірочкою (*), є обов'язковими

source: Graphs
de: Grafiken
ru: Графики
uk: Графіки

source: Corporations
de: Corporationen
ru: Корпорации
uk: Корпорації

source: Member corporations
de: Mitglieder-Corporationen
ru: Корпорации-участницы
uk: Корпорації учасників

source: Corporation
ru: Корпорация
uk: Корпорація

source: Avg FATs
de: Durschn. FATs
ru: Количество флотов/линков (в среднем)
uk: Середня к-сть FATів

source: Corporation statistics
de: Corporation-Statistik
ru: Статистика корпорации
uk: Статистика корпорації

source: View detailed corporation statistics for:
de: Zeige detaillierte Corporation-Statistik für:
uk: Переглянути детальну статистику корпорації для:

source: FATs by ship type
de: FATs nach Schiffsart
ru: Ссылки флотов по типам кораблей
uk: FATи за типом корабля

source: Corporation performance
ru: Показатели корпорации
uk: Ефективність корпорації

source: FATs by time
de: FATs nach Zeit
ru: по продолжительности
uk: FATи по-часу

source: FATs by weekday
de: FATs nach Wochentag
ru: Количество флотов/линков по дням недели
uk: FATи по-днях

source: Ship Types
de: Schiffstypen
ru: Тип корабля
uk: Типи кораблів

source: Average FATs by corporation
de: Durchschnittliche FATs nach Corporation
ru: Среднее кол-во линков по корпорациям
uk: К-сть FATів корпороції в середньому

source: Average # of FATs
de: Durchschnittliche Anz. FATs
ru: Среднее количество флотов/ссылок
uk: Середня к-сть FATів

source: # of FATs
de: Anz. FATs
ru: Количество флотов/ссылок
uk: К-сть FATів

source: Character statistics
de: Charakterstatistik
ru: Статистика пилота
uk: Статистика персонажа

source: Raw data
de: Rohdaten
ru: Исходные данные
uk: Необроблені дані

source: FATs by time of day
de: FATs nach Tageszeit
ru: Количество флотов/ссылок по времени суток
uk: FATи по годинах

source: FATs for
de: FATs für
ru: Количество флотов/ссылок для
uk: FATи для

source: Members
de: Mitglieder
ru: Участники
uk: Учасники

source: By main character
de: Bei Hauptcharakter
uk: За основним персонажем

source: All characters
de: Alle Charaktere
uk: Всі персонажі

source: Main characters
de: Hauptcharakter
uk: Основні персонажі

source: %(corp)s main characters and their accumulated FATs for %(month_name)s %(year)s.
de: %(corp)s Hauptcharaktere und ihre angesammelten FATs für %(month_name)s %(year)s
uk: %(corp)s основні персонажі і загальна сума FATів на %(month_name)s %(year)s.

source: This corporation doesn't seem to have any main characters registered.
de: Für diese Corporation scheinen keine Hauptcharaktere registriert zu sein.
uk: Ця корпорація не має зареєстрованих основних персонажів.

source: This pilot does not seem to have any FATs on any associated character.
de: Dieser Pilot scheint keine FATs für einen registrierten Charakter zu haben.
uk: Цей пілот немає FATів на жодному з пов'язаних персонажів.

source: All characters associated with this main character.
de: Alle Charaktere, die mit diesem Hauptcharakter assoziiert sind.
uk: Всі персонажі, пов'язані з цим основним персонажем.

source: My Stats
de: Meine Statistik
ru: Мои показатели
uk: Моя статистика

source: Alliance statistics for
de: Allianz-Statistik für
ru: Cтатистика альянса
uk: Статистика альянсу для

source: Corporation statistics for
de: Corporation-Statistik für
ru: Статистика корпорации
uk: Статистика корпорації для

source: Click on an alliance name to see their corporations
de: Klicke auf eine Allianz um deren Corporations zu sehen
ru: Нажмите на название альянса, чтобы увидеть его корпорации
uk: Натисніть на назву альянсу, щоб переглянути її корпорації

source: Your monthly stats for %(year)s
de: Deine monatliche Statistik für %(year)s
uk: Ваша щомісячна статистика за %(year)s

source: Only months with FAT data for the selected year are shown.
de: Nur Monate in denen auch FAT-Links registriert sind werden angezeigt.
ru: Отображаются только месяцы с данными по БВП за выбранный год.
uk: Показано лише місяці з даними FAT для вибраного року.

source: Only characters that have FATs for the selected year are shown.
de: Nur Charaktere für die auch FAT-Links registriert sind werden angezeigt.
ru: Показаны пилоты, у которых были БВП в выбранном году.
uk: Показано лише персонажі, які мають FATи для вибраного року.

source: Total monthly FATs
de: Gesamte monatliche FATs
uk: Загальна к-сть FATів за місяць

source: This is the monthly total FAT count for all your characters combined.
de: Dies ist die monatliche Gesamtanzahl an FATs aller Deiner Charaktere zusammen.
uk: Це загальна к-сть FATів за місяць для всіх ваших персонажів.

source: Month
de: Monat
ru: Месяц
uk: Місяць

source: FAT count
de: FAT Anzahl
ru: кол-во ссылок
uk: К-сть FATів

source: Total FATs for %(year)s
de: Gesamte FATs für %(year)s
uk: Загальна к-сть FATів за %(year)s

source: Monthly FATs by character
de: Monatliche FATs nach Charakter
uk: FATи за місяць по персонажу

source: Statistics for
de: Statistik für
uk: Статистика для

source: No FATs for %(year)s for any of your characters …
de: Keine FATs für %(year)s für einen Deiner Charaktere …
uk: Немає FATів у %(year)s для жодного з ваших персонажів …

source: Recent activity
de: Kürzliche Aktivität
ru: Недавняя активность
uk: Остання активність

source: No recent FAT links
de: Keine FAT-Links
ru: Отсутствуют недавние БВП
uk: Немає останніх FAT-посилань

source: Create a FAT link
de: FAT-Link erstellen
ru: Создание линка
uk: Створити FAT-посилання

source: FAT link details
ru: Подробности линка
uk: Деталі FAT-посилання

source: Delete FAT
de: FAT löschen
ru: Завершение Боевого Вылета
uk: Видалити FAT

source: All FAT links
de: Alle FAT-Links
ru: Все линки
uk: Всі FAT-посилання

source: Fleet Activity Tracking logs
de: Flotten Aktivitäts Verfolgung Logs
uk: Логи по ФАТам

source: Time
de: Zeit
ru: Время
uk: Час

source: Event
de: Ereignis
ru: Событие
uk: Подія

source: User
de: Nutzer
ru: Пользователь
uk: Користувач

source: Description
de: Beschreibung
ru: Описание
uk: Опис

source: Logs are kept for %(duration)s day. Logs older than that are removed automatically.
de: Logs werden für %(duration)s Tage gespeichert. Danach werden sie automatisch gelöscht.
ru: Записи журнала сохраняются в течение %(duration)s дня, после чего автоматически удаляются.
uk: Логи зберігаються %(duration)s день. Старі логи видаляються автоматично.

source: Fleet Activity Tracking statistics
de: Flotten Aktivitäts Verfolgung Statistik
uk: Статистика відстеження активності

source: Fleet activity
de: Flottenaktivität
ru: Активность во флотах
uk: Активність флоту

source: View detailed alliance statistics for:
de: Zeige detaillierte Allianz-Statistik für:
uk: Переглянути детальну статистику альянсу для:

source: Fleet Activity Tracking statistics for <strong>%(corporation)s</strong> for the year <strong>%(year)s</strong>.
de: Flotten Aktivitäts Verfolgung Statistiken für <strong>%(corporation)s</strong> für das Jahr <strong>%(year)s</strong>
uk: Статистика відстеження ФАТів <strong>%(corporation)s</strong> за <strong>%(year)s рік</strong>.

source: Total FATs for %(year)s: <strong>%(fats_per_year)s</strong>
de: Gesamte FATs für %(year)s: <strong>%(fats_per_year)s</strong>
uk: Сума FATів за %(year)s: <strong>%(fats_per_year)s</strong>

source: January
de: Januar
ru: Январь
uk: Січень

source: February
de: Februar
ru: Февраль
uk: Лютий

source: March
de: März
ru: Март
uk: Березень

source: April
ru: Апрель
uk: Квітень

source: May
de: Mai
ru: Май
uk: Травень

source: June
de: Juni
ru: Июнь
uk: Червень

source: July
de: Juli
ru: Июль
uk: Липень

source: August
ru: Август
uk: Серпень

source: September
ru: Сентябрь
uk: Вересень

source: October
de: Oktober
ru: Октябрь
uk: Жовтень

source: November
ru: Ноябрь
uk: Листопад

source: December
de: Dezember
ru: Декабрь
uk: Грудень

source: <h4>Success!</h4><p>Clickable FAT link created!</p><p>Make sure to give your fleet members the link to click so that they get credit for this fleet.</p>
de: <h4>Erfolg!</h4><p>Klickbarer FAT-Link erstellt!</p><p>Bitte stelle sicher diesen Link in Deiner Flotte zu teilen.</p>
ru: <h4>Успех!</h4><p>Ссылка РБВ создана!</p><p>Предоставьте данную ссылку членам флота, чтобы они могли зарегистрировать свое участие.</p>
uk: <h4>Успіх!</h4><p>Створено FAT-посилання!</p><p>Переконайтеся, що ваші члени флоту перейшли за посиланням, щоб отримати відзнаку за цей флот.</p>

source: <h4>Error!</h4><p>Something went wrong when attempting to submit your clickable FAT link.</p>
de: <h4>Fehler!</h4><p>Es ist etwas schief gelaufen beid er Erstellung Deines FAT-Links.</p>
ru: <h4>Ошибка!</h4><p>Что-то пошло не так при попытке создания ссылки РБВ.</p>
uk: <h4>Помилка!</h4><p>Щось пішло не так, коли спробували відправити ваше FAT-посилання.</p>

source: <h4>Warning!</h4><p>You must fill out the form on the "Add FAT link" page to create a clickable FAT link</p>
de: <h4>Warnung!</h4><p>Du musst das Formular auf der „FAT-Link hinzufügen“ Seite ausfüllen um einen FAT-Link zu erstellen.</p>
ru: <h4>Внимание!</h4><p>Для создания ссылки необходимо заполнить поля формы</p>
uk: <h4>Попередження!</h4><p>Вам слід заповнити форму на сторінці "Додати FAT-посилання", щоб створити його</p>

source: <h4>Warning!</h4><p>To use the ESI function, you need to be in fleet and you need to be the fleet boss! You can create a clickable FAT link and share it, if you like.</p>
de: <h4>Warnung!</h4><p>Um die ESI Funktion zu nutzen musst Du in einer Flotte sein und Du musst der Flottenkommandant sein. Du kannst allerdings auch einen klickbaren FAT-Link erstellen, wenn Du magst.</p>
ru: <h4>Внимание!</h4><p>Для использования ESI отслеживания вы должны быть командиром флота!</p>
uk: <h4>Попередження!</h4><p>Щоб використовувати функцію ESI, вам слід бути у флоті і бути босом флоту! Ви можете створити FAT-посилання для вашого персонажа і поділитися ним.</p>

source: <h4>Warning!</h4><p>Fleet with ID "{fleet_id}" for your character {creator__character_name} has already been registered and pilots joining this fleet are automatically tracked.</p>
de: <h4>Warnung!</h4><p>Die Flotte mit der ID „{fleet_id}“ für Deinen Charakter {creator__character_name} wurde bereits registriert und Piloten werden automatisch erfasst.</p>
ru: <h4>Внимание!</h4><p>Флот с ID «{fleet_id}» под командованием {creator__character_name} уже зарегистрирован и пилоты участники отслеживаются автоматически.</p>
uk: <h4>Попередження!</h4><p>Флот з ID "{fleet_id}" для вашого персонажа {creator__character_name} вже був зареєстрований і пілоти, що приєднуються до цього флоту, автоматично відстежуються.</p>

source: <h4>Warning!</h4><p>Not Fleet Boss! Only the fleet boss can utilize the ESI function. You can create a clickable FAT link and share it, if you like.</p>
de: <h4>Warnung!</h4><p>Du bist nicht der Flottenkommandant! Nur der Flottenkommandant kann die ESI Funktion nutzen. Du kannst einen klickbaren FAT-Link erstellen, wenn Du magst.</p>
ru: <h4>Внимание!</h4><p>Вы не командир флота! Только командиру флота доступна функция ESI отлеживания.</p>
uk: <h4>Попередження!</h4><p>Не бос флоту! Лише бос флоту може використовувати функцію ESI. Ви можете створити FAT-посилання для вашого персонажа і поділитися ним.</p>

source: <h4>Success!</h4><p>FAT link Created!</p><p>FATs have been queued, they may take a few minutes to show up.</p><p>Pilots who join later will be automatically added until you close or leave the fleet in-game.</p>
de: <h4>Erfolg!</h4><p>FAT-Link erstellt!</p><p>FATs werden eingelesen. Dies mag einen Moment dauern</p><p>Piloten welche später der Flotte beitreten werden automatisch hinzugefügt bis Du die Flotte schließt oder verlässt.</p>
ru: <h4>Успех!</h4><p>Запись УБВ флота создана!</p><p>Для отображения записей текущих членов флота может потребоваться несколько минут.</p><p>Присоединяющиеся позже пилоты будут зарегистрированы автоматически, до тех пора пока Вы находитесь во флоте.</p>
uk: <h4>Успіх!</h4><p>FAT-посилання створено!</p><p>FAT зареєстровано, вони можуть зайняти деякий час для появи у списку FAT.</p><p>Пілоти, які приєднуються пізніше, будуть автоматично додані, поки ви не закриєте або покинете флот у грі.</p>

source: <h4>Error!</h4><p>Something went wrong when attempting to submit your ESI FAT link.</p>
de: <h4>Fehler!</h4><p>Es ist etwas schief gelaufen beid er Erstellung Deines ESI-FAT-Links.</p>
ru: <h4>Ошибка!</h4><p>Что-то пошло не так при попытке ESI отслеживания флота.</p>
uk: <h4>Помилка!</h4><p>Щось пішло не так, коли спробували відправити ваше FAT-посилання для ESI.</p>

source: <h4>Warning!</h4><p>The hash provided is not valid.</p>
de: <h4>Warnung!</h4><p>Der zur Verfügung gestellte FAT-Link Hash ist nicht gültig.</p>
ru: <h4>Внимание!</h4><p>Предоставлен некорректный hash.</p>
uk: <h4>Попередження!</h4><p>Вказаний хеш не є дійсним.</p>

source: <h4>Warning!</h4><p>Sorry, that FAT link is expired. If you were on that fleet, contact your FC about having your FAT manually added.</p>
de: <h4>Warnung!</h4><p>Dieser FAT-Link ist bereits abgelaufen. Wenn Du in der Flotte warst kontaktiere bitte Deinen FC damit dieser Dich manuell hinzufügen kann.</p>
ru: <h4>Внимание!</h4><p>К сожалению, срок действия ссылки истек. Если Вы участвовали во флоте, обратитесь к командиру флота с просьбой добавить Вас ручном режиме.</p>
uk: <h4>Попередження!</h4><p>На жаль, це FAT-посилання вже закінчилося. Якщо ви були у цьому флоті, зв'яжіться з FC, щоб додати ваш FAT вручну.</p>

source: <h4>Warning!</h4><p>Cannot register the fleet participation for {character_name}. The character needs to be online.</p>
de: <h4>Warnung!</h4><p>Der Charakter {character_name} kann nicht registriert werden. Charakter ist nicht online.</p>
ru: <h4>Внимание!</h4><p>Невозможно зарегистрировать участие пилота {character_name}. Пилот должен быть онлайн.</p>
uk: <h4>Попередження!</h4><p>Не можна зареєструвати участь у флоті для {character_name}. Персонаж повинен бути онлайн.</p>

source: <h4>Success!</h4><p>FAT registered for {character_name} at "{fleet_name}"</p>
de: <h4>Erfolg!</h4><p>Teilnahme für {character_name} in Flotte „{fleet_name}“ registriert.</p>
ru: <h4>Успех!</h4><p>Пилот {character_name} зарегистрирован в «{fleet_name}»</p>
uk: <h4>Успіх!</h4><p>FAT зареєстровано для {character_name} у "{fleet_name}"</p>

source: <h4>Warning!</h4><p>The selected charcter ({character_name}) is already registered for this FAT link.</p>
de: <h4>Warnung!</h4><p>Der ausgewählte Charakter ({character_name}) wurde bereits für diese Flotte registriert.</p>
uk: <h4>Попередження!</h4><p>Вибраний персонаж ({character_name}) вже зареєстрований для цього FAT-посилання.</p>

source: <h4>Success!</h4><p>Fleet name successfully changed.</p>
de: <h4>Erfolg!</h4><p>Flottennname erfolgreich geändert.</p>
ru: <h4>Успех!</h4><p>Название флота успешно изменено.</p>
uk: <h4>Успіх!</h4><p>Назва флоту успішно змінена.</p>

source: <h4>Oh No!</h4><p>Something went wrong!</p>
de: <h4>Oh Nein!</h4><p>Irgendetwas ist schief gelaufen!</p>
ru: <h4>Упс!</h4><p>Что-то пошло не так!</p>
uk: <h4>Ой, ні!</h4><p>Щось пішло не так!</p>

source: <h4>Success!</h4><p>Manual FAT processed.<br>{character_name} has been added flying a {shiptype} in {system}</p>
de: <h4>Erfolg!</h4><p>Manueller FAT Eintrag verarbeitet.<br>{character_name} wurde in einer {shiptype} im System {system} hinzugefügt</p>
ru: <h4>Успех!</h4><p>Ссылка РБВ обновлена.<br>{character_name} добавлен на {shiptype} в {system}</p>
uk: <h4>Успіх!</h4><p>Ручний FAT оброблено.<br>{character_name} додано у флот як корабель {shiptype} в {system}</p>

source: <h4>Information</h4><p>Pilot is already registered for this FAT link.</p><p>Name: {character_name}<br>System: {system}<br>Ship: {shiptype}</p>
de: <h4>Information</h4><p>Der Pilot ist bereits für diesen FAT-Link registriert.</p><p>Name: {character_name}<br>System: {system}<br>Schiff: {shiptype}</p>
ru: <h4>Информация</h4><p>Пилот уже зарегистрирован в указанном БВ.</p><p>Имя: {character_name}<br>Система: {system}<br>Корабль: {shiptype}</p>
uk: <h4>Інформація</h4><p>Пілот вже зареєстрований для цього FAT-посилання.</p><p>Ім'я: {character_name}<br>Система: {system}<br>Корабель: {shiptype}</p>

source: <h4>Oh No!</h4><p>Manual FAT processing failed! The character name you entered was not found.</p>
de: <h4>Oh Nein!</h4><p>Manueller FAT Eintrag fehlgeschlagen. Der Charakter konnte nicht gefunden werden.</p>
ru: <h4>Упс!</h4><p>Ошибка редактирования БВ! Пилот с введенным именем не найден.</p>
uk: <h4>Ой, ні!</h4><p>Помилка при обробці ручного FAT! Назва персонажа, яку ви ввели, не знайдена.</p>

source: <h4>Error!</h4><p>The FAT link hash provided is either invalid or the FAT link has already been deleted.</p>
de: <h4>Fehler!</h4><p>Der FAT-Link Hash ist entweder ungültig oder der dazugehörige FAT-Link wurde gelöscht.</p>
ru: <h4>Ошибка!</h4><p>Предоставленный hash некорректный или относится к ранее аннулированной ссылке РБВ.</p>
uk: <h4>Помилка!</h4><p>Вказаний хеш FAT-посилання не є дійсним або FAT-посилання вже видалено.</p>

source: <h4>Success!</h4><p>The FAT link "{fatlink_hash}" and all associated FATs have been successfully deleted.</p>
de: <h4>Erfolg!</h4><p>Der FAT-Link „{fatlink_hash}“ und alle assoziierten FATs wurden erfolgreich gelöscht.</p>
ru: <h4>Успех!</h4><p>Запись БВ флота «{fatlink_hash}» и все зарегистрированные БВП были удалены.</p>
uk: <h4>Успіх!</h4><p>FAT-посилання "{fatlink_hash}" і всі пов'язані FAT були успішно видалені.</p>

source: <h4>Error!</h4><p>The hash provided is either invalid or has been deleted.</p>
de: <h4>Fehler!</h4><p>Der FAT-Link Hash ist entweder ungültig oder der dazugehörige FAT-Link wurde bereits gelöscht.</p>
ru: <h4>Ошибка!</h4><p>Предоставленный hash некорректный или ранее удален.</p>
uk: <h4>Помилка!</h4><p>Вказаний хеш не є дійсним або він вже видалений.</p>

source: <h4>Error!</h4><p>The hash and FAT ID do not match.</p>
de: <h4>Fehler!</h4><p>Fat-Link Hash und FAT-Link ID passen nicht zusammen.</p>
ru: <h4>Ошибка!</h4><p>Значение hash и идентификатор ссылки РБВ не совпадают.</p>
uk: <h4>Помилка!</h4><p>Хеш і ID FAT не збігаються.</p>

source: <h4>Success!</h4><p>The FAT for {character_name} has been successfully deleted from FAT link "{fatlink_hash}".</p>
de: <h4>Erfolg!</h4><p>Der FAT für {character_name} wurde erfolgreich vom FAT-Link „{fatlink_hash}“ gelöscht.</p>
ru: <h4>Успех!</h4><p>Регистрация БВП для {character_name} удалена из БВ флота «{fatlink_hash}».</p>
uk: <h4>Успіх!</h4><p>FAT для {character_name} було успішно видалено з FAT-посилання "{fatlink_hash}".</p>

source: <h4>Error!</h4><p>The hash you provided does not match with any FAT link.</p>
de: <h4>Fehler!</h4><p>Der zur Verfügung gestellt Hash passt zu keinem FAT-Link.</p>
ru: <h4>Ошибка!</h4><p>Предоставленный hash не соответствует никакому БВ флота.</p>
uk: <h4>Помилка!</h4><p>Вказаний хеш не відповідає жодному FAT-посиланню.</p>

source: <h4>Success!</h4><p>The FAT link has been successfully re-opened.</p>
de: <h4>Erfolg!</h4><p>Der FAT-Link wurde erfolgreich wieder geöffnet.</p>
ru: <h4>Успех!</h4><p>Ссылка РБВ успешно реактивирована.</p>
uk: <h4>Успіх!</h4><p>FAT-посилання було успішно повторно відкрито.</p>

source: <h4>Warning!</h4><p>This FAT link has already been re-opened. FAT links can be re-opened only once!</p>
de: <h4>Warnung!</h4><p>Dieser FAT-Link wurde bereits einmal wieder geöffnet. Dies kann nur einmal getan werden.</p>
ru: <h4>Внимание!</h4><p>Данная ссылка РБВ уже была реактивирована ранее. Возможна только одна реактивация ссылки РБВ!</p>
uk: <h4>Попередження!</h4><p>Це FAT-посилання вже було повторно відкрито. FAT-посилання можна повторно відкривати лише один раз!</p>

source: <h4>Warning!</h4><p>You do not have permission to view statistics for this character.</p>
de: <h4>Warnung!</h4><p>Du hast nicht die Berechtigung die Statistiken für diesen Charakter zu sehen.</p>
ru: <h4>Внимание!</h4><p>У Вас нет прав для просмотра статистики этого пилота.</p>
uk: <h4>Попередження!</h4><p>Ви не маєте дозволу переглядати статистику для цього персонажа.</p>

source: This character is in a different corporation and their FATs are not counted towards the statistics of the main corporation.
de: Dieser Charakter ist in einer anderen Corporation und seine FATs werden nicht zu den Statistiken dieser Corporation gezählt.
uk: Цей персонаж перебуває в іншій корпорації, і його FAT-и не враховуються в статистиці основної корпорації.
