Repository: pypi-data/pypi-mirror-403
Catalog: packages/pretix-payone/pretix_payone-1.4.1-py3-none-any.whl/pretix_payone/locale/*_Informal/LC_MESSAGES/django.po
Languages: de

source: Accept payments through PAYONE (formerly BS Payone).
de: Akzeptiere Zahlungen über PAYONE (ehemals BS Payone).

source: Merchant ID
de: Händler-ID

source: Key
de: Schlüssel

source: Credit card
de: Kreditkarte

source: Please configure the TransactionStatus URL to the following endpoint in order to automatically cancel orders when charges are refunded externally and to process asynchronous payment methods like SOFORT.
de: Bitte konfiguriere die TransactionStatus-URL mit der folgenden Adresse damit Bestellungen automatisch storniert werden, wenn Erstattungen extern erstellt werden und damit asynchrone Zahlungsmethoden wie SOFORT funktionieren.

source: The PAYONE plugin is operating in test mode. You can use one of <a {args}>many test cards</a> to perform a transaction. No money will actually be transferred.
de: Das PAYONE-Modul befindet sich im Testmodus. Du kannst eine von <a {args}>vielen Testkarten</a> verwenden um eine Transaktion durchzuführen. Es wird kein echtes Geld transferiert.

source: We had trouble communicating with our payment provider. Please try again and get in touch with us if this problem persists.
de: Bei der Kommunikation mit dem Zahlungsdienstleister ist ein Problem aufgetreten. Bitte versuche es erneut und setze dich mit uns in Verbindung, wenn das Problem fortbesteht.

source: Our payment provider returned an error message: {message}
de: Unser Zahlungsanbieter hat eine Fehlermeldung zurückgegeben: {message}

source: Credit card via PAYONE
de: Kreditkarte über PAYONE

source: You may need to enable JavaScript for payments.
de: Du musst JavaScript aktivieren, um zu bezahlen.

source: giropay via PAYONE
de: giropay über PAYONE

source: Please enter a german IBAN starting with DE
de: Bitte gib eine deutsche IBAN mit DE ein

source: eps via PAYONE
de: eps über PAYONE

source: iDEAL via PAYONE
de: iDEAL über PAYONE

source: SOFORT via PAYONE
de: SOFORT über PAYONE

source: Bank country
de: Land der Bank

source: Przelewy24 via PAYONE
de: Przelewy24 über PAYONE

source: Multibanco via PAYONE
de: Multibanco über PAYONE

source: Bancontact via PAYONE
de: Bancontact über PAYONE

source: Verkkopankki via PAYONE
de: Verkkopankki über PAYONE

source: MyBank via PAYONE
de: MyBank über PAYONE

source: PayPal via PAYONE
de: PayPal über PAYONE

source: Alipay via PAYONE
de: Alipay über PAYONE

source: paydirekt via PAYONE
de: paydirekt über PAYONE

source: paysafeard via PAYONE
de: paysafecad über PAYONE

source: Qiwi via PAYONE
de: Qiwi über PAYONE

source: PAYONE reported an event: {}
de: PAYONE meldete ein Ereignis: {}

source: After you submitted your order, we will redirect you to our payment provider to complete your payment. You will then be redirected back here to get your tickets.
de: Nachdem du deine Bestellung abgesendet hast, werden wir dich zu unserem Dienstleister umleiten um deine Zahlung abzuschließen. Danach wirst du hier her zurückgeleitet und erhältst deine Tickets.

source: Payment method
de: Zahlungsmethode

source: You already entered a card number that we will use to charge the payment amount.
de: Du hast bereits eine Kartennummer eingegeben, die wir für die Zahlung benutzen werden.

source: Card number
de: Kreditkartennummer

source: Use a different card
de: Andere Kreditkarte verwenden

source: Loading…
de: Lade…

source: Credit card number
de: Kreditkartennummer

source: Expiration date
de: Ablaufdatum

source: Security code (CVC)
de: Sicherheitscode (CVC)

source: Card holder
de: Karteninhaber

source: Transaction ID
de: Transaktions-ID

source: Mandate ID
de: Mandats-ID

source: Card expiry
de: Ablaufdatum

source: Error code
de: Fehlercode

source: Error message
de: Fehlermeldung

source: We're waiting for an answer from the payment provider regarding your payment. Please contact us if this takes more than a few days.
de: Wir warten auf eine Antwort des Zahlungsdienstleisters bezüglich deiner Zahlung. Bitte kontaktiere uns, falls dies mehr als ein paar Tage dauert.

source: The payment transaction could not be completed for the following reason:
de: Die Zahlung konnte aus folgendem Grund nicht abgeschlossen werden:

source: Unknown reason
de: Unbekannter Grund

source: The payment process has started in a new window.
de: Der Zahlungsvorgang wird in einem neuen Fenster fortgesetzt.

source: The window to enter your payment data was not opened or was closed?
de: Das Fenster zur Eingabe der Zahlungsdaten wurde geschlossen oder nie geöffnet?

source: Click here in order to open the window.
de: Hier klicken um das Fenster zu öffnen.

source: The payment process has failed. See below for more information.
de: Der Zahlungsprozess ist fehlgeschlagen. Mehr Informationen findest du weiter unten.

source: Sorry, there was an error in the payment process. Please check the link in your emails to continue.
de: Entschuldige bitte, es gab einen Fehler im Bezahlvorgang. Bitte klicke auf den Link in der E-Mail, die wir dir geschickt haben, um fortzufahren.
