Repository: pypi-data/pypi-mirror-403
Catalog: packages/anyencrypt/anyencrypt-0.3.1-py3-none-any.whl/anyencrypt/locales/*/LC_MESSAGES/messages.po
Languages: fr

source: AnyEncrypt - 简单易用的加密解密命令行工具 支持文本和文件的加密解密操作。
fr: AnyEncrypt - Outil CLI de chiffrement/déchiffrement simple et facile à utiliser Prend en charge le chiffrement et le déchiffrement de texte et de fichiers.

source: 加密文本或文件 示例： b # 加密文本 anyencrypt encrypt -t "Hello World" # 加密文件 anyencrypt encrypt -f input.txt -o encrypted.bin
fr: Chiffrer un texte ou un fichier Exemples: b # Chiffrer un texte anyencrypt encrypt -t "Hello World" # Chiffrer un fichier anyencrypt encrypt -f input.txt -o encrypted.bin

source: 解密文本或文件 示例： b # 解密文本 anyencrypt decrypt -t "gAAAAAB..." # 解密文件 anyencrypt decrypt -f encrypted.bin -o decrypted.txt
fr: Déchiffrer un texte ou un fichier Exemples: b # Déchiffrer un texte anyencrypt decrypt -t "gAAAAAB..." # Déchiffrer un fichier anyencrypt decrypt -f encrypted.bin -o decrypted.txt

source: 交互式模式 - 引导用户完成加密/解密操作
fr: Mode interactif - guide l'utilisateur pour le chiffrement/déchiffrement

source: 要加密的文本
fr: Texte à chiffrer

source: 要加密的文件路径
fr: Chemin du fichier à chiffrer

source: 输出文件路径（文件加密时使用）
fr: Chemin du fichier de sortie (utilisé pour le chiffrement de fichiers)

source: 加密密码（不建议使用，会在命令历史中留下记录）
fr: Mot de passe de chiffrement (non recommandé, restera dans l'historique)

source: 请输入加密密码:
fr: Veuillez saisir le mot de passe de chiffrement:

source: 请再次输入密码:
fr: Veuillez ressaisir le mot de passe:

source: 错误: 两次输入的密码不一致
fr: Erreur: les deux mots de passe ne correspondent pas

source: 错误: 密码不能为空
fr: Erreur: le mot de passe ne peut pas être vide

source: 加密结果:
fr: Résultat du chiffrement:

source: ✓ 文件加密成功: {output}
fr: ✓ Fichier chiffré avec succès: {output}

source: 错误: 请指定要加密的文本 (-t) 或文件 (-f)
fr: Erreur: veuillez spécifier le texte (-t) ou le fichier (-f) à chiffrer

source: 错误: {error}
fr: Erreur: {error}

source: 要解密的文本
fr: Texte à déchiffrer

source: 要解密的文件路径
fr: Chemin du fichier à déchiffrer

source: 输出文件路径（文件解密时使用）
fr: Chemin du fichier de sortie (utilisé pour le déchiffrement de fichiers)

source: 解密密码（不建议使用，会在命令历史中留下记录）
fr: Mot de passe de déchiffrement (non recommandé, restera dans l'historique)

source: 请输入解密密码:
fr: Veuillez saisir le mot de passe de déchiffrement:

source: 解密结果:
fr: Résultat du déchiffrement:

source: ✓ 文件解密成功: {output}
fr: ✓ Fichier déchiffré avec succès: {output}

source: 错误: 请指定要解密的文本 (-t) 或文件 (-f)
fr: Erreur: veuillez spécifier le texte (-t) ou le fichier (-f) à déchiffrer

source: AnyEncrypt - 加密解密工具
fr: AnyEncrypt - Outil de chiffrement/déchiffrement

source: 请选择操作类型:
fr: Veuillez sélectionner le type d'opération:

source: [1] 加密
fr: [1] Chiffrer

source: [2] 解密
fr: [2] Déchiffrer

source: 请输入选项
fr: Saisissez l'option

source: 错误: 无效的选项
fr: Erreur: option invalide

source: 加密
fr: Chiffrer

source: 解密
fr: Déchiffrer

source: 请选择处理类型:
fr: Veuillez sélectionner le type de traitement:

source: [1] 文本
fr: [1] Texte

source: [2] 文件
fr: [2] Fichier

source: 请输入{operation}密码:
fr: Saisissez le mot de passe de {operation}:

source: 请输入要加密的文本
fr: Saisissez le texte à chiffrer

source: ✓ 加密成功!
fr: ✓ Chiffrement réussi!

source: 加密结果:
fr: Résultat du chiffrement:

source: 请输入要解密的密文
fr: Saisissez le texte chiffré à déchiffrer

source: ✓ 解密成功!
fr: ✓ Déchiffrement réussi!

source: 解密结果:
fr: Résultat du déchiffrement:

source: 请输入要加密的文件路径
fr: Saisissez le chemin du fichier à chiffrer

source: 错误: 文件不存在: {path}
fr: Erreur: fichier introuvable: {path}

source: 请输入输出文件路径
fr: Saisissez le chemin du fichier de sortie

source: ✓ 文件加密成功: {path}
fr: ✓ Fichier chiffré avec succès: {path}

source: 请输入要解密的文件路径
fr: Saisissez le chemin du fichier à déchiffrer

source: ✓ 文件解密成功: {path}
fr: ✓ Fichier déchiffré avec succès: {path}

source: 加密解密核心功能模块 使用 Fernet (对称加密) 进行加密和解密操作
fr: Module principal de chiffrement/déchiffrement Utilise Fernet (chiffrement symétrique) pour chiffrer et déchiffrer

source: 从密码派生出32字节的密钥 使用 SHA-256 哈希算法
fr: Dériver une clé de 32 octets à partir du mot de passe Utilise l'algorithme de hachage SHA-256

source: 内部辅助函数
fr: Fonction d'assistance interne

source: 加密文本 Args: text: 要加密的文本 password: 加密密码 Returns: 加密后的文本（Base64编码） Raises: Exception: 加密失败时抛出异常
fr: Chiffrer un texte Args: text: Texte à chiffrer password: Mot de passe de chiffrement Returns: Texte chiffré (encodé en Base64) Raises: Exception: Levée en cas d'échec du chiffrement

source: 解密文本 Args: encrypted_text: 加密的文本 password: 解密密码 Returns: 解密后的原文本 Raises: Exception: 解密失败时抛出异常（可能是密码错误或数据损坏）
fr: Déchiffrer un texte Args: encrypted_text: Texte chiffré password: Mot de passe de déchiffrement Returns: Texte original déchiffré Raises: Exception: Levée en cas d'échec du déchiffrement (mot de passe incorrect ou données corrompues)

source: 判断文件是否为可读文本文件 Args: data: 文件的二进制内容 max_size_mb: 最大文件大小限制(MB),默认10MB Returns: (是否为文本文件, 解码后的文本内容或空字符串)
fr: Vérifier si un fichier est un texte lisible Args: data: Contenu binaire du fichier max_size_mb: Limite maximale de taille de fichier (MB), par défaut 10MB Returns: (S'il s'agit d'un fichier texte, contenu texte décodé ou chaîne vide)

source: 加密文件 Args: input_path: 输入文件路径 output_path: 输出文件路径 password: 加密密码 Raises: FileNotFoundError: 输入文件不存在 Exception: 加密失败时抛出异常
fr: Chiffrer un fichier Args: input_path: Chemin du fichier d'entrée output_path: Chemin du fichier de sortie password: Mot de passe de chiffrement Raises: FileNotFoundError: Le fichier d'entrée n'existe pas Exception: Levée en cas d'échec du chiffrement

source: 解密文件 Args: input_path: 加密的文件路径 output_path: 解密后的文件路径 password: 解密密码 Raises: FileNotFoundError: 输入文件不存在 Exception: 解密失败时抛出异常
fr: Déchiffrer un fichier Args: input_path: Chemin du fichier chiffré output_path: Chemin du fichier déchiffré password: Mot de passe de déchiffrement Raises: FileNotFoundError: Le fichier d'entrée n'existe pas Exception: Levée en cas d'échec du déchiffrement

source: 加密失败: {error}
fr: Échec du chiffrement: {error}

source: 解密失败: 密码错误或数据已损坏
fr: Échec du déchiffrement: mot de passe incorrect ou données corrompues

source: 解密失败: {error}
fr: Échec du déchiffrement: {error}

source: 文件不存在: {path}
fr: Fichier introuvable: {path}

source: 文件加密失败: {error}
fr: Échec du chiffrement du fichier: {error}

source: 解密失败: 密码错误或文件已损坏
fr: Échec du déchiffrement: mot de passe incorrect ou fichier corrompu

source: 文件解密失败: {error}
fr: Échec du déchiffrement du fichier: {error}
