Repository: pypi-data/pypi-mirror-403
Catalog: packages/dsetool.policy/dsetool_policy-1.0.3-py3-none-any.whl/dsetool/policy/locales/*/LC_MESSAGES/euphorie.po
Languages: ca, de, et, hr, it, lv, no, pt, ro, sl, sv

source: Do I need to prepare?
ca: Necessito preparar-me?
de: Muss ich mich vorbereiten?
et: Kas pean valmistuma?
hr: Trebam li se pripremiti?
it: Ho bisogno di prepararmi?
lv: Vai man jāsagatavojas?
no: Trenger jeg å forberede meg?
pt: Preciso me preparar?
ro: Este nevoie să mă pregătesc?
sl: Se moram pripraviti?
sv: Behöver jag förbereda mig?

source: Euphorie: Add new RIE Content
ca: Euphorie: Afegeix nou contingut RIE
de: Euphorie: Neuen RIE-Inhalt hinzufügen
et: Euforie: Lisa uus RIE sisu
hr: Euphoria: Dodajte novi RIE Content
it: Euphoria: Aggiungi nuovo contenuto RIE
lv: Euphorie: Pievienot jaunu RIE saturu
no: Euphorie: Legg til nytt RIE-innhold
pt: Euphorie: Adicionar novo conteúdo RIE
ro: Euphorie: Adăugați un nou conținut RIE
sl: Euphorie: Dodaj novo RIE vsebino
sv: Euphorie: Lägg till nytt RIE-innehåll

source: Euphorie: Delete published content
ca: Euphorie: Esborra contingut publicat
de: Euphorie: Veröffentlichten Inhalt löschen
et: Euforie: Kustuta avaldatud sisu
hr: Euphoria: Izbrisati objavljeni sadržaj
it: Euphoria: Elimina contenuto pubblicato
lv: Euphorie: Izdzēst publicēto saturu
no: Euphorie: Slett publisert innhold
pt: Euphorie: Excluir conteúdo publicado
ro: Euphorie: Ștergeți conținutul publicat
sl: Euphorie: Izbriši objavljeno vsebino
sv: Euphorie: Ta bort publicerat innehåll

source: Euphorie: Manage country
ca: Euphorie: Gestionar el país
de: Euphorie: Land verwalten
et: Euforie: Halda riiki
hr: Euphoria: Upravljanje zemljom
it: Euphoria: Gestisci paese
lv: Euphorie: Pārvaldīt valsti
no: Euphorie: Administrer land
pt: Euphorie: Gerenciar país
ro: Euphorie: Gestionați țara
sl: Euphorie: Upravljanje držav
sv: Euphorie: Hantera land

source: Euphorie: Publish a Survey
ca: Euphorie: Publicar una enquesta
de: Euphorie: Eine Umfrage veröffentlichen
et: Euforie: Avalda küsitlus
hr: Euphoria: Objavi anketa
it: Euphoria: Pubblica un sondaggio
lv: Euphorie: Publicēt aptauju
no: Euphorie: Publiser en undersøkelse
pt: Euphorie: Publicar uma pesquisa
ro: Euphorie: Publicați un sondaj
sl: Euphorie: Objavi raziskavo
sv: Euphorie: Publicera en undersökning

source: Euphorie: View a Survey
ca: Euphorie: Veure una enquesta
de: Euphorie: Eine Umfrage anzeigen
et: Euforie: Vaata küsitlust
hr: Euphoria: Pogledaj anketa
it: Euphoria: Visualizza un sondaggio
lv: Euphorie: Aplūkot aptauju
no: Euphorie: Se en undersøkelse
pt: Euphorie: Visualizar uma pesquisa
ro: Euphorie: Vizualizați un sondaj
sl: Euphorie: Oglej si raziskavo
sv: Euphorie: Visa en undersökning

source: How long will it take?
ca: Quant de temps trigarà?
de: Wie lange wird es dauern?
et: Kui kaua see aega võtab?
hr: Koliko će to trajati?
it: Quanto tempo ci vorrà?
lv: Cik ilgi tas ilgs?
no: Hvor lang tid vil det ta?
pt: Quanto tempo vai levar?
ro: Cât timp va dura?
sl: Koliko časa bo to trajalo?
sv: Hur lång tid kommer det att ta?

source: However, OiRA is designed to be of most value to smaller businesses.
ca: No obstant això, l'OiRA està dissenyat per ser més valuós per a les petites empreses.
de: Jedoch ist OiRA so konzipiert, dass es für kleinere Unternehmen von größtem Nutzen ist.
et: Kuid OiRA on kõige väärtuslikum väikestele ettevõtetele.
hr: Međutim, OiRA je dizajnirana da bude najvrjedniji za manje tvrtke.
it: Tuttavia, OiRA è progettato per essere di maggiore valore per le piccole imprese.
lv: Tomēr OiRA ir visvairāk paredzēts mazākiem uzņēmumiem.
no: Imidlertid er OiRA designet for å være av størst verdi for mindre bedrifter.
pt: No entanto, o OiRA é projetado para ser de maior valor para pequenas empresas.
ro: Cu toate acestea, OiRA este conceput pentru a fi de cea mai mare valoare pentru întreprinderile mici.
sl: Vendar pa je OiRA zasnovana tako, da je najbolj koristna za manjša podjetja.
sv: Men, OiRA är utformat för att vara mest värdefullt för mindre företag.

source: However, you can spend whatever time you have available on an assessment and then return to it when convenient to pick up from the same point you left off.
ca: No obstant això, podeu dedicar el temps que tingueu disponible a una avaluació i després tornar-hi quan us convingui per continuar des del mateix punt on ho vau deixar.
de: Sie können jedoch so viel Zeit, wie Sie übrig haben, für eine Bewertung nutzen und dann zu einem günstigen Zeitpunkt darauf zurückkommen, um genau dort weiterzumachen, wo Sie aufgehört haben.
et: Kuid saate kulutada hindamisele nii palju aega, kui teil on saadaval, ja seejärel naasta sinna, kui see on mugav, et jätkata samast kohast, kus lõpetasite.
hr: Ipak, možete potrošiti bilo kada koji imate dostupno za procjenu i zatim se vratiti kad vam odgovara da biste nastavili od tamo gdje ste stali.
it: Tuttavia, puoi dedicare il tempo che hai a disposizione per una valutazione e poi tornare quando è conveniente riprendere dal punto in cui ti sei fermato.
lv: Tomēr jūs varat tērēt jebkādu pieejamo laiku novērtējumam un pēc tam atgriezties tajā, kad tas ir ērti, lai turpinātu no vietas, kur pēdējoreiz pārtraucāt.
no: Du kan imidlertid bruke den tiden du har tilgjengelig på en vurdering og deretter komme tilbake til den når det passer for å fortsette der du slapp.
pt: No entanto, você pode passar o tempo que tiver disponível em uma avaliação e depois voltar a ela quando for conveniente para retomar do mesmo ponto onde parou.
ro: Cu toate acestea, puteți petrece cât timp aveți disponibil pentru o evaluare și apoi puteți reveni la aceasta când vă convine pentru a continua de acolo de unde ați lăsat.
sl: Vendar pa lahko porabite katerikoli čas, ki ga imate na voljo, za oceno, nato pa se vrnete, kadar je to primerno, in nadaljujete tam, kjer ste končali.
sv: Men, du kan lägga den tid du har tillgänglig på en bedömning och sedan återvända till den när det passar för att fortsätta från den punkt du slutade.

source: It's impossible to say how long an assessment will take in general as the tools differ according to sectors and countries.
ca: És impossible dir quant de temps trigarà una avaluació en general, ja que les eines varien segons els sectors i els països.
de: Es ist unmöglich zu sagen, wie lange eine Bewertung im Allgemeinen dauert, da die Werkzeuge je nach Sektoren und Ländern unterschiedlich sind.
et: Üldiselt on võimatu öelda, kui kaua hindamine võtab, kuna tööriistad erinevad sektorite ja riikide kaupa.
hr: Nemoguće je reći koliko će općenito trajati procjena, jer se alati razlikuju prema sektorima i zemljama.
it: È impossibile dire quanto tempo ci vorrà per fare una valutazione in generale poiché gli strumenti variano a seconda dei settori e dei paesi.
lv: Nav iespējams pateikt, cik ilgi novērtējums kopumā aizņems, jo rīki atšķiras pēc nozarēm un valstīm.
no: Det er umulig å si hvor lang tid en vurdering vil ta generelt, da verktøyene varierer etter sektor og land.
pt: É impossível dizer quanto tempo uma avaliação levará em geral, já que as ferramentas variam de acordo com setores e países.
ro: Este imposibil de spus cât timp va dura o evaluare în general, deoarece instrumentele diferă în funcție de sectoare și țări.
sl: Težko je reči, koliko časa bo ocena na splošno trajala, saj se orodja razlikujejo glede na sektorje in države.
sv: Det är omöjligt att säga hur lång tid en bedömning kommer att ta generellt sett eftersom verktygen varierar beroende på sektorer och länder.

source: Learn more about the Dangerous Substances eTool
ca: Apreneu més sobre l'eTool de Substàncies Perilloses
de: Mehr über das Dangerous Substances eTool erfahren
et: Lisateave ohtlike ainete eTööriista kohta
hr: Saznajte više o alatu Dangerous Substances eTool
it: Scopri di più sullo strumento elettronico Substanze pericolose
lv: Uzziniet vairāk par bīstamo vielu eRīku
no: Lær mer om Dangerous Substances eTool
pt: Saiba mais sobre o Dangerous Substances eTool
ro: Aflați mai multe despre Dangerous Substances eTool
sl: Izvedite več o e-orodju Nevarne snovi
sv: Lär dig mer om Farliga Ämnen eTool

source: Maintenance actions
ca: Accions de manteniment
de: Wartungsarbeiten
et: Hooldustegevused
hr: Radnje održavanja
it: Azioni di manutenzione
lv: Uzturēšanas darbības
no: Vedlikeholdsaktiviteter
pt: Ações de manutenção
ro: Acțiuni de întreținere
sl: Vzdrževalna dejanja
sv: Underhållsåtgärder

source: Maintenance view
ca: Vista de manteniment
de: Wartungsansicht
et: Hooldusvaade
hr: Prikaz održavanja
it: Visualizzazione manutenzione
lv: Uzturēšanas skatījums
no: Vedlikeholdsvisning
pt: Visualização de manutenção
ro: Vizualizarea întreținerii
sl: Vzdrževalni pogled
sv: Underhållsvy

source: Not yet answered
ca: Encara no respost
de: Noch nicht beantwortet
et: Ei ole veel vastatud
hr: Još nije odgovoreno
it: Non ancora risposto
lv: Vēl nav atbildēts
no: Ikke besvart ennå
pt: Ainda não respondida
ro: Încă nefinalizat
sl: Še ni odgovorjeno
sv: Inte besvarad ännu

source: OSHA OiRA customizations for Euphorie
ca: Personalitzacions OSHA OiRA per a Euphorie
de: OSHA OiRA Anpassungen für Euphorie
et: OSHA OiRA kohandused Euphorie jaoks
hr: OSHA OiRA prilagodbe za Euphoria
it: Personalizzazioni OSHA OiRA per Euphoria
lv: OSHA OiRA pielāgojumi Euphorie
no: OSHA OiRA tilpasninger for Euphorie
pt: Personalizações OSHA OiRA para Euphorie
ro: Personalizări OSHA OiRA pentru Euphorie
sl: Prilagoditve OSHA OiRA za Euphorie
sv: OSHA OiRA anpassningar för Euphorie

source: OSHA extra Country fields
ca: Camps extra de països OSHA
de: Zusätzliche OSHA Landfelder
et: OSHA lisaväljad riigi jaoks
hr: OSHA dodatna polja zemlje
it: Campi extra Paese OSHA
lv: OSHA papildu valstu lauki
no: OSHA ekstra landfelt
pt: Campos adicionais de país OSHA
ro: Câmpuri suplimentare țară OSHA
sl: Dodatna polja OSHA Država
sv: OSHA extra landfält

source: OSHA extra Survey fields
ca: Camps extra d'enquestes OSHA
de: Zusätzliche OSHA Umfragefelder
et: OSHA lisaväljad küsitluse jaoks
hr: OSHA dodatna polja ankete
it: Campi extra sondaggio OSHA
lv: OSHA papildu aptaujas lauki
no: OSHA ekstra undersøkelsesfelt
pt: Campos adicionais de pesquisa OSHA
ro: Câmpuri suplimentare sondaj OSHA
sl: Dodatna polja OSHA Anketa
sv: OSHA extra undersökningsfält

source: OiRA can be used by anyone wishing to assess health and safety-related risks that might exist in their workplace.
ca: L'OiRA pot ser utilitzat per qualsevol que vulgui avaluat els riscos relacionats amb la salut i la seguretat que podrien existir al seu lloc de treball.
de: OiRA kann von jeder Person genutzt werden, die gesundheits- und sicherheitsrelevante Risiken bewerten möchte, die an ihrem Arbeitsplatz bestehen könnten.
et: OiRA-d saab kasutada igaüks, kes soovib hinnata tervise- ja ohutusalaseid riske, mis võivad esineda nende töökohal.
hr: OiRA može koristiti svatko tko želi procijeniti rizike povezane sa zdravljem i sigurnošću koji bi mogli postojati na njihovom radnom mjestu.
it: OiRA può essere utilizzato da chiunque desideri valutare i rischi per la salute e la sicurezza che potrebbero esistere nel proprio luogo di lavoro.
lv: OiRA var izmantot ikviens, kurš vēlas novērtēt veselības un drošības riskus, kas var rasties viņa darba vietā.
no: OiRA kan brukes av alle som ønsker å vurdere helse- og sikkerhetsrelaterte risikoer som kan eksistere på arbeidsplassen deres.
pt: OiRA pode ser utilizado por qualquer pessoa que deseje avaliar os riscos relacionados à saúde e segurança que possam existir em seu local de trabalho.
ro: OiRA poate fi utilizat de oricine dorește să evalueze riscurile de sănătate și securitate în muncă care ar putea exista la locul lor de muncă.
sl: OiRA lahko uporablja kdorkoli, ki želi oceniti tveganja, povezana z zdravjem in varnostjo, ki bi lahko obstajala na njihovem delovnem mestu.
sv: OiRA kan användas av alla som vill bedöma hälso- och säkerhetsrelaterade risker som kan finnas på deras arbetsplats.

source: OiRA is designed specifically to support them in assessing the risks at work and helping them to produce a documented risk assessment including an action plan tailored to the business's requirements.
ca: L'OiRA està dissenyat específicament per donar suport en la valoració dels riscos laborals i ajudar en la producció d'una avaluació documentada del riscos incloent un pla d'acció adaptat a les necessitats de l'empresa.
de: OiRA ist speziell dafür konzipiert, sie bei der Bewertung der Risiken am Arbeitsplatz zu unterstützen und ihnen zu helfen, eine dokumentierte Risikobewertung einschließlich eines auf die Anforderungen des Unternehmens zugeschnittenen Aktionsplans zu erstellen.
et: OiRA on spetsiaalselt kavandatud neid toetama tööriskide hindamisel ja aitama neil koostada dokumenteeritud riskihinnang, sealhulgas tegevuskava, mis vastab ettevõtte nõuetele.
hr: OiRA je posebno dizajnirana da im pomogne u procjeni rizika na radu i pomaže im da izrade dokumentirani rizik procjena, uključujući plan djelovanja prilagođen zahtjevima tvrtke.
it: OiRA è progettato specificamente per supportarli nella valutazione dei rischi sul lavoro e aiutarli a produrre una valutazione del rischio documentata che include un piano d'azione su misura per le esigenze dell'azienda.
lv: OiRA ir īpaši izstrādāts, lai atbalstītu tos darba risku novērtēšanā un palīdzētu izveidot dokumentētu riska novērtējumu, kas iekļauj rīcības plānu, kas pielāgots uzņēmuma prasībām.
no: OiRA er spesielt designet for å støtte dem i å vurdere risikoen på arbeidsplassen og hjelpe dem å produsere en dokumentert risikovurdering, inkludert en handlingsplan tilpasset bedriftens krav.
pt: OiRA é projetado especificamente para apoiá-los na avaliação dos riscos no trabalho e ajudá-los a produzir uma avaliação de risco documentada, incluindo um plano de ação adaptado às necessidades do negócio.
ro: OiRA este proiectat în mod special pentru a-i sprijini în evaluarea riscurilor la locul de muncă și pentru a-i ajuta să producă o evaluare a riscului documentată, inclusiv un plan de acțiune adaptat cerințelor afacerii.
sl: OiRA je posebej zasnovana za podporo pri ocenjevanju tveganj pri delu in jim pomaga pri izdelavi dokumentirane ocene tveganja, vključno z akcijskim načrtom, prilagojenim zahtevam podjetja.
sv: OiRA är specifikt utformat för att stödja dem i att bedöma riskerna på arbetet och hjälpa dem att framställa en dokumenterad riskbedömning, inklusive en åtgärdsplan anpassad till företagets krav.

source: OiRA stands for Online Interactive Risk Assessment. It is a web-based tool that allows you to perform a health and safety risk assessment of your workplace.
ca: OiRA significa Online Interactive Risk Assessment. És una eina en línia que us permet realitzar una avaluació de riscos de salut i seguretat al vostre lloc de treball.
de: OiRA steht für Online Interactive Risk Assessment. Es handelt sich um ein webbasiertes Tool, mit dem Sie eine Gesundheits- und Sicherheitsrisikobewertung Ihres Arbeitsplatzes durchführen können.
et: OiRA tähistab veebipõhist interaktiivset riskihinnangut. See on veebipõhine tööriist, mis võimaldab teil läbi viia tervise- ja ohutusriskide hindamise oma töökohas.
hr: OiRA označava Online Interactive Risk Assessment. To je web alat koji vam omogućuje izvođenje procjene rizika za zdravlje i sigurnost na vašem radnom mjestu.
it: OiRA sta per Online Interactive Risk Assessment. È uno strumento basato sul web che ti consente di eseguire una valutazione del rischio per la salute e la sicurezza del tuo posto di lavoro.
lv: OiRA apzīmē tiešsaistes interaktīvo riska novērtējumu. Tas ir tīmekļa rīks, kas ļauj veikt veselības un drošības riska novērtējumu savā darba vietā.
no: OiRA står for Online Interactive Risk Assessment. Det er et nettbasert verktøy som lar deg utføre en helse- og sikkerhetsrisikovurdering av arbeidsplassen din.
pt: OiRA significa Online Interactive Risk Assessment. É uma ferramenta online que permite realizar uma avaliação de risco de saúde e segurança do seu local de trabalho.
ro: OiRA înseamnă Online Interactive Risk Assessment. Este un instrument bazat pe web care vă permite să realizați o evaluare a riscurilor de sănătate și securitate la locul vostru de muncă.
sl: OiRA pomeni Online Interactive Risk Assessment. Gre za spletno orodje, ki vam omogoča izvajanje ocene tveganja za zdravje in varnost na vašem delovnem mestu.
sv: OiRA står för Online Interactive Risk Assessment. Detta är ett webbaserat verktyg som gör det möjligt för dig att utföra en hälso- och säkerhetsriskbedömning av din arbetsplats.

source: OiRA tool reminder
ca: Recordatori de l'eina OiRA
de: OiRA Tool Erinnerung
et: OiRA tööriista meeldetuletus
hr: OiRA alat podsjetnik
it: Promemoria strumento OiRA
lv: OiRA rīka atgādinājums
no: OiRA verktøypåminnelse
pt: Lembrete da ferramenta OiRA
ro: Memento instrument OiRA
sl: Opomnik za orodje OiRA
sv: OiRA-verktygspåminnelse

source: Option
ca: Opció
et: Valik
hr: Opcija
it: Opzione
lv: Opcija
no: Alternativ
pt: Opção
ro: Opțiune
sl: Možnost
sv: Alternativ

source: Provide additional OSHA fields
ca: Proporcionar camps addicionals OSHA
de: Zusätzliche OSHA Felder bereitstellen
et: Lisa täiendavad OSHA väljad
hr: Pružite dodatna OSHA polja
it: Fornisci campi OSHA aggiuntivi
lv: Nodrošiniet papildu OSHA laukus
no: Gi ekstra OSHA-felt
pt: Forneça campos OSHA adicionais
ro: Oferă câmpuri suplimentare OSHA
sl: Ponudi dodatna polja OSHA
sv: Tillhandahåll ytterligare OSHA fält

source: Recommendation
ca: Recomanació
de: Empfehlung
et: Soovitus
hr: Preporuka
it: Raccomandazione
lv: Rekomendācija
no: Anbefaling
pt: Recomendação
ro: Recomandare
sl: Priporočilo
sv: Rekommendation

source: Registering allows you to simply log in at any time to continue previous assessments or to start new ones.
ca: Registrar-se us permet simplement iniciar sessió en qualsevol moment per continuar avaluacions anteriors o per començar-ne de noves.
de: Durch die Registrierung können Sie sich jederzeit einfach anmelden, um frühere Bewertungen fortzusetzen oder neue zu beginnen.
et: Registreerumine võimaldab teil lihtsalt sisse logida igal ajal, et jätkata varasemaid hindamisi või alustada uusi.
hr: Registracija vam omogućuje jednostavno prijavljivanje u bilo kojem trenutku da biste nastavili prethodne procjene ili započeli nove.
it: La registrazione ti consente di accedere in qualsiasi momento per continuare le valutazioni precedenti o per iniziarne di nuove.
lv: Reģistrēšanās ļauj jums vienkārši jebkurā laikā pieteikties, lai turpinātu iepriekšējos novērtējumus vai sāktu jaunus.
no: Registrering lar deg enkelt logge inn når som helst for å fortsette tidligere vurderinger eller for å starte nye.
pt: Registrar permite que você simplesmente faça login a qualquer momento para continuar avaliações anteriores ou para começar novas.
ro: Înregistrarea vă permite să vă autentificați pur și simplu în orice moment pentru a continua evaluările anterioare sau pentru a începe altele noi.
sl: Z registracijo se vam omogoči, da se kadarkoli preprosto prijavite, da nadaljujete prejšnje ocene ali začnete nove.
sv: Genom att registrera dig kan du enkelt logga in när som helst för att fortsätta tidigare bedömningar eller för att starta nya.

source: The first thing you will be asked to do when you begin your first risk assessment is to create an OiRA account - this is a simple and quick process.
ca: El primer que se us demanarà quan comenceu la vostra primera avaluació de riscos és que creeu un compte d'OiRA: aquest és un procés senzill i ràpid.
de: Das erste, was Sie bei Ihrer ersten Risikobewertung tun müssen, ist die Erstellung eines OiRA-Kontos - dies ist ein einfacher und schneller Prozess.
et: Esimene asi, mida teilt nõutakse, kui alustate oma esimest riskihinnangut, on OiRA konto loomine - see on lihtne ja kiire protsess.
hr: Prva stvar koju ćete morati učiniti kada započnete svoju prvu procjenu rizika je stvaranje OiRA računa - ovaj je proces jednostavan i brz.
it: La prima cosa che ti verrà chiesto di fare quando inizierai la tua prima valutazione del rischio è di creare un account OiRA - questo è un processo semplice e veloce.
lv: Pirmais, kas jums jādara, sākot savu pirmo riska novērtējumu, ir izveidot OiRA kontu - tas ir vienkāršs un ātrs process.
no: Det første du vil bli bedt om å gjøre når du begynner første risikovurdering er å opprette en OiRA-konto - dette er en enkel og rask prosess.
pt: A primeira coisa que você será solicitado a fazer quando começar sua primeira avaliação de risco é criar uma conta OiRA - este é um processo simples e rápido.
ro: Primul lucru pe care vi se va cere să îl faceți când începeți prima evaluare a riscului este să creați un cont OiRA - acesta este un proces simplu și rapid.
sl: Prva stvar, ki jo boste morali narediti, ko boste začeli s prvo oceno tveganja, je ustvariti račun OiRA - postopek je preprost in hiter.
sv: Det första du kommer att bli ombedd att göra när du börjar din första riskbedömning är att skapa ett OiRA-konto - detta är en enkel och snabb process.

source: There are four main stages to complete in the assessment process:
ca: Hi ha quatre etapes principals a completar en el procés d'avaluació:
de: Es gibt vier Hauptstufen, die im Bewertungsprozess abgeschlossen werden müssen:
et: Hindamisprotsessis on neli peamist etappi:
hr: Postoje četiri glavne faze koje treba završiti u procesu procjene:
it: Ci sono quattro fasi principali da completare nel processo di valutazione:
lv: Novērtēšanas procesā ir četri galvenie posmi:
no: Det er fire hovedfaser å fullføre i vurderingsprosessen:
pt: Existem quatro etapas principais para completar no processo de avaliação:
ro: Există patru etape principale pentru a finaliza procesul de evaluare:
sl: V postopku ocenjevanja je treba opraviti štiri glavne faze:
sv: Det finns fyra huvudstadier att slutföra i bedömningsprocessen:

source: What do I have to do?
ca: Què he de fer?
de: Was muss ich tun?
et: Mida ma pean tegema?
hr: Što trebam učiniti?
it: Cosa devo fare?
lv: Ko man vajadzētu darīt?
no: Hva må jeg gjøre?
pt: O que eu tenho que fazer?
ro: Ce trebuie să fac?
sl: Kaj moram storiti?
sv: Vad måste jag göra?

source: What is OiRA (Online Interactive Risk Assessment)?
ca: Què és OiRA (Online Interactive Risk Assessment)?
de: Was ist OiRA (Online Interactive Risk Assessment)?
et: Mis on OiRA (veebipõhine interaktiivne riskihinnang)?
hr: Što je OiRA (Online Interactive Risk Assessment)?
it: Cos'è OiRA (Valutazione interattiva online del rischio)?
lv: Kas ir OiRA (tiešsaistes interaktīvā riska novērtējums)?
no: Hva er OiRA (Online Interactive Risk Assessment)?
pt: O que é OiRA (Online Interactive Risk Assessment)?
ro: Ce este OiRA (Online Interactive Risk Assessment)?
sl: Kaj je OiRA (Online Interactive Risk Assessment)?
sv: Vad är OiRA (Online Interactive Risk Assessment)?

source: Who is the OiRA tool for?
ca: Per a qui és l'eina OiRA?
de: Für wen ist das OiRA-Tool gedacht?
et: Kellele on mõeldud OiRA tööriist?
hr: Za koga je OiRA alat?
it: Per chi è lo strumento OiRA?
lv: Kuram paredzēts OiRA rīks?
no: Hvem er OiRA-verktøyet for?
pt: Para quem é a ferramenta OiRA?
ro: Cui i se adresează instrumentul OiRA?
sl: Za koga je orodje OiRA?
sv: Vem är OiRA-verktyget för?

source: Why do I have to register?
ca: Per què he de registrar-me?
de: Warum muss ich mich registrieren?
et: Miks pean registreeruma?
hr: Zašto se moram registrirati?
it: Perché devo registrarmi?
lv: Kāpēc man jāreģistrējas?
no: Hvorfor må jeg registrere meg?
pt: Por que eu tenho que me registrar?
ro: De ce trebuie să mă înregistrez?
sl: Zakaj se moram registrirati?
sv: Varför måste jag registrera mig?
