Repository: pypi-data/pypi-mirror-403
Catalog: packages/dsetool.policy/dsetool_policy-1.0.3-py3-none-any.whl/dsetool/policy/locales/*/LC_MESSAGES/euphorie.po
Languages: ca, de, et, hr, it, lv, no, pt, ro, sl, sv

source: info_login
ca: Estimat usuari, per poder utilitzar l'eina i obtenir totes les funcionalitats, se us demana que inicieu sessió.
de: Sehr geehrter Benutzer, um alle Funktionen des Tools nutzen zu können, müssen Sie sich anmelden.
et: Kallis kasutaja, tööriista ja kõigi funktsioonide kasutamiseks palutakse teil sisse logida.
hr: Poštovani korisniče, kako biste mogli koristiti alat i dobiti sve funkcionalnosti, potrebno je da se prijavite.
it: Gentile utente, per poter utilizzare lo strumento e ottenere tutte le funzionalità, ti viene richiesto di accedere.
lv: Cienījamais lietotāj, lai izmantotu rīku un iegūtu visas funkcijas, tiek lūgts pieteikties sistēmā.
no: Kjære bruker, for å kunne bruke verktøyet og få alle funksjonene, blir det bedt om at du logger på.
pt: Caro usuário, a fim de poder usar a ferramenta e obter todas as funcionalidades, você precisa fazer login.
ro: Dragă utilizator, pentru a putea utiliza instrumentul și pentru a beneficia de toate funcționalitățile, vi se solicită să vă autentificați.
sl: Dragi uporabnik, da bi lahko uporabljali orodje in pridobili vse funkcionalnosti, se morate prijaviti.
sv: Kära användare, för att kunna använda verktyget och få alla funktioner, behöver du logga in.

source: info_register
ca: Si us plau, si no teniu un usuari, registreu-vos primer.
de: Bitte, wenn Sie noch keinen Benutzer haben, registrieren Sie sich zuerst.
et: Palun registreerige end kõigepealt, kui teil pole kasutajat.
hr: Molimo vas, ako nemate korisnika, prvo se registrirajte.
it: Per favore, se non hai un utente, registrati prima.
lv: Lūdzu, ja jums nav lietotāja, vispirms reģistrējieties.
no: Vennligst, hvis du ikke har en bruker, registrer deg først.
pt: Por favor, se você não tem um usuário, registre-se primeiro.
ro: Vă rugăm, dacă nu aveți un utilizator, să vă înregistrați mai întâi.
sl: Prosim, če nimate uporabnika, se najprej registrirajte.
sv: Vänligen, om du inte har en användare, registrera dig först.

source: intro_identification_dsetool
ca: Les preguntes estan dividides en 3 parts. La primera part tracta sobre l'identificació de possibles riscos químics a la vostra empresa. La segona part tracta sobre les rutines de gestió de riscos químics. I la tercera part tracta sobre les mesures de control per reduir els riscos químics.
de: Die Fragen sind in 3 Teile gegliedert. Der erste Teil befasst sich mit der Identifizierung potentieller chemischer Risiken in Ihrem Unternehmen. Der zweite Teil behandelt Routinen für das chemische Risikomanagement. Und der dritte Teil untersucht Kontrollmaßnahmen zur Reduzierung chemischer Risiken.
et: Küsimused on jagatud 3 ossa. Esimene osa on seotud keemiliste riskide tuvastamisega teie ettevõttes. Teine osa on seotud keemilise riski juhtimise rutiinidega. Ja kolmas osa on seotud keemiliste riskide vähendamise kontrollimeetmetega.
hr: Pitanja su podijeljena u 3 dijela. Prvi dio je o identificiranju potencijalnih kemijskih rizika u vašoj tvrtki. Drugi dio je o rutinama za upravljanje kemijskim rizikom. A treći dio je o kontrolnim mjerama za smanjenje kemijskih rizika.
it: Le domande sono divise in 3 parti. La prima parte riguarda l'identificazione dei potenziali rischi chimici nella tua azienda. La seconda parte riguarda le routine per la gestione del rischio chimico. E la terza parte riguarda le misure di controllo per ridurre i rischi chimici.
lv: Jautājumi ir sadalīti 3 daļās. Pirmā daļa ir par potenciālo ķīmisko risku identificēšanu Jūsu uzņēmumā. Otrā daļa ir par ķīmisko risku pārvaldības rutīnām. Un trešā daļa ir par kontroles pasākumiem ķīmisko risku samazināšanai.
no: Spørsmålene er delt inn i 3 deler. Første del handler om å identifisere potensielle kjemiske risikoer i selskapet ditt. Den andre delen handler om rutiner for kjemisk risikostyring. Og den tredje delen handler om kontrolltiltak for å redusere kjemiske risikoer.
pt: As perguntas são divididas em 3 partes. A primeira parte é sobre identificar potenciais riscos químicos em sua empresa. A segunda parte é sobre rotinas para o gerenciamento de riscos químicos. E a terceira parte é sobre medidas de controle para reduzir riscos químicos.
ro: Întrebările sunt împărțite în 3 părți. Prima parte este despre identificarea riscurilor chimice potențiale în compania dumneavoastră. A doua parte este despre rutinele de gestionare a riscurilor chimice. Iar a treia parte este despre măsuri de control pentru a reduce riscurile chimice.
sl: Vprašanja so razdeljena na 3 dele. Prvi del govori o prepoznavanju možnih kemičnih tveganj v vašem podjetju. Drugi del se nanaša na rutine za upravljanje s kemičnimi tveganji. Tretji del pa je o ukrepih za nadzor za zmanjšanje kemičnih tveganj.
sv: Frågorna är indelade i 3 delar. Den första delen handlar om att identifiera potentiella kemiska risker i ditt företag. Den andra delen handlar om rutinerna för hantering av kemiska risker. Och den tredje delen handlar om kontrollåtgärder för att minska kemiska risker.

source: label_action_plan
ca: Pla d'acció
de: Aktionsplan
et: Tegevuskava
hr: Plan djelovanja
it: Piano d'azione
lv: Rīcības plāns
no: Handlingsplan
pt: Plano de Ação
ro: Plan de acțiune
sl: Akcijski načrt
sv: Handlingsplan

source: label_agree_terms_conditions
ca: Estic d'acord amb el ${link_terms_conditions}
de: Ich stimme den ${link_terms_conditions} zu
et: Nõustun ${link_terms_conditions} tingimustega
hr: Slažem se s ${link_terms_conditions}
it: Accetto i ${link_terms_conditions}
lv: Es piekrītu ${link_terms_conditions}
no: Jeg er enig i ${link_terms_conditions}
pt: Concordo com os ${link_terms_conditions}
ro: Sunt de acord cu ${link_terms_conditions}
sl: Strinjam se z ${link_terms_conditions}
sv: Jag godkänner ${link_terms_conditions}

source: label_allow_multiple_options
ca: Permet múltiples opcions
de: Mehrere Optionen ermöglichen
et: Luba mitu valikut
hr: Dopusti više opcija
it: Consenti più opzioni
lv: Atļaut vairākas opcijas
no: Tillat flere alternativer
pt: Permitir múltiplas opções
ro: Permite mai multe opțiuni
sl: Dovoli več možnosti
sv: Tillåt flera alternativ

source: label_continue
et: Jätka
no: Fortsett
ro: Continuă
sv: Fortsätt

source: label_data_protection_notice
ca: Avís de protecció de dades
de: Datenschutzhinweis
et: Andmekaitse teade
hr: Obavijest o zaštiti podataka
it: Avviso sulla protezione dei dati
lv: Datu aizsardzības paziņojums
no: Databeskyttelsesvarsel
pt: Aviso de proteção de dados
ro: Notificare de protecție a datelor
sl: Obvestilo o varstvu podatkov
sv: Dataskyddsmeddelande

source: label_edit_organisation
ca: Edita Organització
et: Muuda organisatsiooni
hr: Uredi organizaciju
it: Modifica Organizzazione
lv: Rediģēt organizāciju
no: Rediger organisasjon
pt: Editar Organização
ro: Editare organizație
sl: Uredi organizacijo
sv: Redigera organisation

source: label_email
ca: Correu electrònic
de: E-Mail-Adresse
et: E-posti aadress
hr: Email adresa
it: Indirizzo email
lv: E-pasta adrese
no: E-postadresse
pt: Endereço de e-mail
ro: Adresa de e-mail
sl: E-poštni naslov
sv: E-postadress

source: label_enable_email_reminder
ca: Habilita el recordatori de correu electrònic?
de: E-Mail Erinnerung aktivieren?
et: Luba e-kirja meeldetuletus?
hr: Omogućiti podsjetnik e-pošte?
it: Abilitare il promemoria email?
lv: Iespējot e-pasta atgādinājumu?
no: Aktiver e-postpåminnelse?
pt: Habilitar lembrete por email?
ro: Activați memento-ul prin e-mail?
sl: Omogoči opomnik po e-pošti?
sv: Aktivera e-postpåminnelse?

source: label_evaluation
ca: Avaluació
de: Auswertung
et: Hindamine
hr: Evaluacija
it: Valutazione
lv: Novērtējums
no: Evaluering
pt: Avaliação
ro: Evaluare
sl: Ocenjevanje
sv: Utvärdering

source: label_first_name_optional
ca: Nom (opcional)
de: Vorname (optional)
et: Eesnimi (valikuline)
hr: Ime (opcionalno)
it: Nome (opzionale)
lv: Vārds (neobligāti)
no: Fornavn (valgfritt)
pt: Primeiro nome (opcional)
ro: Prenume (opțional)
sl: Ime (neobvezno)
sv: Förnamn (valfritt)

source: label_forgot_password
ca: He oblidat la meva contrasenya
de: Ich habe mein Passwort vergessen
et: Unustasin oma parooli
hr: Zaboravio sam svoju lozinku
it: Ho dimenticato la mia password
lv: Es aizmirsu savu paroli
no: Jeg har glemt passordet mitt
pt: Esqueci minha senha
ro: Mi-am uitat parola
sl: Pozabil sem geslo
sv: Jag har glömt mitt lösenord

source: label_identification
ca: Identificació
de: Identifikation
et: Identifitseerimine
hr: Identifikacija
it: Identificazione
lv: Identifikācija
no: Identifikasjon
pt: Identificação
ro: Identificare
sl: Identifikacija
sv: Identifiering

source: label_keep_logged_in
ca: Mantén-me connectat.
de: Eingeloggt bleiben.
et: Hoidke mind sisse logitud.
hr: Drži me prijavljenim.
it: Rimani connesso.
lv: Paturēt mani pieslēgtu.
no: Hold meg innlogget.
pt: Mantenha-me conectado.
ro: Ține-mă autentificat.
sl: Obdrži me prijavljenega.
sv: Håll mig inloggad.

source: label_last_name_optional
ca: Cognom (opcional)
de: Nachname (optional)
et: Perekonnanimi (valikuline)
hr: Prezime (opcionalno)
it: Cognome (opzionale)
lv: Uzvārds (neobligāti)
no: Etternavn (valgfritt)
pt: Sobrenome (opcional)
ro: Nume (opțional)
sl: Priimek (neobvezno)
sv: Efternamn (valfritt)

source: label_learn_more
ca: Apreneu més
de: Mehr erfahren
et: Uuri lisaks
hr: Saznaj više
it: Scopri di più
lv: Uzziniet vairāk
no: Lær mer
pt: Saiba mais
ro: Aflați mai multe
sl: Izvedite več
sv: Lär dig mer

source: label_login
ca: Iniciar sessió
de: Einloggen
et: Logi sisse
hr: Prijavi se
it: Accedi
lv: Pieteikties
no: Logg inn
pt: Entrar
ro: Autentificare
sl: Prijavi se
sv: Logga in

source: label_login_password
ca: Contrasenya
de: Passwort
et: Parool
hr: Lozinka
it: Password
lv: Parole
no: Passord
pt: Senha
ro: Parolă
sl: Geslo
sv: Lösenord

source: label_module_recommendation
ca: Recomanació
de: Empfehlung
et: Soovitus
hr: Preporuka
it: Raccomandazione
lv: Rekomendācija
no: Anbefaling
pt: Recomendação
ro: Recomandare
sl: Priporočilo
sv: Rekommendation

source: label_new_password
ca: Contrasenya desitjada
de: Gewünschtes Passwort
et: Soovitud parool
hr: Željena lozinka
it: Password desiderata
lv: Vēlamā parole
no: Ønsket passord
pt: Senha desejada
ro: Parola dorită
sl: Želeno geslo
sv: Önskat lösenord

source: label_password_confirm
ca: Repeteix la contrasenya
de: Passwort wiederholen
et: Parool uuesti
hr: Ponovno unesite lozinku
it: Di nuovo la password
lv: Atkārtoti ievadiet paroli
no: Gjenta passord
pt: Repetir senha
ro: Din nou parola
sl: Ponovno geslo
sv: Ange lösenordet igen

source: label_preparation
ca: Preparació
de: Vorbereitung
et: Ettevalmistus
hr: Priprema
it: Preparazione
lv: Sagatavošana
no: Forberedelse
pt: Preparação
ro: Pregătire
sl: Priprava
sv: Förberedelse

source: label_recommendation_text
ca: Text
de: Text
et: Tekst
hr: Tekst
it: Testo
lv: Teksts
no: Tekst
pt: Texto
ro: Text
sl: Besedilo
sv: Text

source: label_register_first
ca: registra't
de: registrieren
et: registreerima
hr: registriraj
it: registrati
lv: reģistrēties
no: registrere
pt: registrar
ro: înregistrați
sl: registracija
sv: registrera

source: label_report_completion_threshold
ca: Llindar de completitud per a la disponibilitat de l'informe
de: Abschlussgrenze für Berichtsverfügbarkeit
et: Aruande kättesaadavuse lävend
hr: Prag završetka za dostupnost izvještaja
it: Soglia di completamento per la disponibilità del rapporto
lv: Pārskata pieejamības procentuālais slieksnis
no: Fullførelsesterskel for rapporttilgjengelighet
pt: Limiar de conclusão para disponibilidade de relatório
ro: Pragul de finalizare pentru disponibilitatea raportului
sl: Končni prag za razpoložljivost poročila
sv: Slutförandetröskel för rapportens tillgänglighet

source: label_report_inventory
ca: Bones pràctiques i guia
de: Gute Praktiken und Anleitung
et: Head praktikad ja juhised
hr: Dobre prakse i smjernice
it: Buone pratiche e orientamenti
lv: Labi praksi un vadlīnijas
no: Gode praksiser og veiledning
pt: Boas práticas e orientações
ro: Bune practici și îndrumări
sl: Dobre prakse in vodila
sv: God praxis och vägledning

source: label_report_inventory_short
ca: Informe breu del qüestionari
de: Kurzer Fragebogen-Bericht
et: Lühikese küsimustiku aruanne
hr: Kratko izvješće o upitniku
it: Rapporto breve questionario
lv: Īsas aptaujas atskaite
no: Kort spørreskjema rapport
pt: Relatório de questionário curto
ro: Raport scurt de chestionar
sl: Kratko poročilo o vprašalniku
sv: Kort frågeformulärsrapport

source: label_send_email_reminder
ca: Envia un recordatori de correu electrònic
de: E-Mail-Erinnerung senden
et: Saada meeldetuletusmeil
hr: Pošalji podsjetnik e-poštom
it: Invia promemoria email
lv: Sūtīt e-pasta atgādinājumu
no: Send e-postpåminnelse
pt: Enviar email lembrete
ro: Trimite memento prin e-mail
sl: Pošlji opomnik po e-pošti
sv: Skicka e-postpåminnelse

source: label_show_immediate_feedback
ca: Mostra recomanacions com a feedback immediat
de: Empfehlungen als unmittelbares Feedback anzeigen
et: Näita soovitusi otse tagasisidena
hr: Prikaži preporuke kao trenutačnu povratnu informaciju
it: Mostra raccomandazioni come feedback immediato
lv: Rādīt ieteikumus kā tūlītēju atgriezenisko saiti
no: Vis anbefalinger som umiddelbar tilbakemelding
pt: Mostrar recomendações como feedback imediato
ro: Afișați recomandările ca feedback imediat
sl: Pokaže priporočila kot takojšnjo povratno informacijo
sv: Visa rekommendationer som omedelbar återkoppling

source: label_start_identification
ca: Inicia la identificació de riscos
de: Risikoerkennung starten
et: Alusta riski tuvastamist
hr: Pokreni identifikaciju rizika
it: Inizia l'Identificazione del Rischio
lv: Sākt riska identifikāciju
no: Start Risikoidentifikasjon
pt: Iniciar Identificação de Risco
ro: Începeți identificarea riscurilor
sl: Začnite identifikacijo tveganj
sv: Starta Riskidentifiering

source: label_start_survey
ca: Inicia
de: Starten
et: Alusta
hr: Pokreni
it: Inizia
lv: Sākt
no: Start
pt: Iniciar
ro: Start
sl: Začni
sv: Starta

source: label_start_test_session
ca: Iniciar una sessió de prova
de: Eine Testsession starten
et: Alusta testimisseanssi
hr: Pokreni testnu sesiju
it: Inizia una sessione di test
lv: Sākt testa sesiju
no: Start en testøkt
pt: Iniciar uma sessão de teste
ro: Începeți o sesiune de testare
sl: Začnite testno sejo
sv: Starta en testsession

source: message_no_validation_requested
ca: No es sol·licita cap validació en aquest moment.
et: Praegu ei nõuta ühtegi valideerimist.
hr: Trenutačno nije zatražena validacija.
it: Non è richiesta nessuna validazione in questo momento.
lv: Šobrīd nav pieprasīta validācija.
no: Ingen validering er etterspurt på dette tidspunktet.
pt: Nenhuma validação é solicitada neste momento.
ro: Nu se solicită nicio validare în acest moment.
sl: Trenutno ni zahtevana nobena validacija.
sv: Ingen validering begärs just nu.

source: message_you_dont_have_any_certificates_yet
ca: Encara no heu rebut cap certificat.
no: Du har ennå ikke tjent noen sertifikater.

source: navigation_email_reminder
ca: Recordatori de correu electrònic
de: E-Mail-Erinnerung
et: E-kirja meeldetuletus
hr: Podsjetnik e-pošte
it: Promemoria email
lv: E-pasta atgādinājums
no: E-postpåminnelse
pt: Email lembrete
ro: Memento prin e-mail
sl: Opomnik po e-pošti
sv: E-postpåminnelse

source: oira_name_line_1
ca: Substàncies perilloses
de: Gefährliche Stoffe
et: Ohtlikud ained
hr: Opasne tvari
it: Sostanze Pericolose
lv: Bīstamās vielas
no: Farlige stoffer
pt: Substâncias Perigosas
ro: Substanțe periculoase
sl: Nevarne snovi
sv: Farliga ämnen

source: oira_name_line_2
ca: eTool
de: eTool
et: eTööriist
hr: eAlat
it: eTool
lv: eRīks
no: eTool
pt: eTool
ro: eTool
sl: eTool
sv: eTool

source: register_teaser
ca: No tens un compte? Llavors, si us plau, ${register_link} primer.
de: Haben Sie kein Konto? Dann bitte zuerst ${register_link}.
et: Pole kontot? Registreerige end siis palun esmalt ${register_link}.
hr: Nemate račun? Molimo vas da prvo ${register_link}.
it: Non hai un account? Allora per favore ${register_link} prima.
lv: Vēl nav konta? Lūdzu, vispirms ${register_link}.
no: Har du ikke en konto? Vennligst ${register_link} først.
pt: Não tem uma conta? Então, por favor, ${register_link} primeiro.
ro: Nu aveți un cont? Atunci vă rugăm să ${register_link} mai întâi.
sl: Nimate računa? Potem najprej ${register_link}.
sv: Har inte ett konto? Vänligen ${register_link} först.

source: report_intro_incomplete
ca: Quan hagueu acabat l'avaluació almenys al ${completion_threshold}% podreu crear un informe.
de: Wenn Sie die Bewertung zu mindestens ${completion_threshold}% abgeschlossen haben, können Sie einen Bericht erstellen.
et: Kui olete hindamise vähemalt ${completion_threshold}% lõpule viinud, saate luua aruande.
hr: Kada završite procjenu barem do ${completion_threshold}% moći ćete izraditi izvještaj.
it: Quando avrai terminato la valutazione almeno al ${completion_threshold}% sarai in grado di creare un rapporto.
lv: Līdz atskaite ir pabeigta vismaz ${completion_threshold}% apjomā, tiks izveidota iespēja veidot atskaiti.
no: Når du har fullført vurderingen til minst ${completion_threshold}% vil du kunne opprette en rapport.
pt: Quando você terminar a avaliação pelo menos a ${completion_threshold}% você poderá criar um relatório.
ro: Când ați finalizat evaluarea la cel puțin ${completion_threshold}% veți putea crea un raport.
sl: Ko boste oceno zaključili vsaj do ${completion_threshold}% boste lahko ustvarili poročilo.
sv: När du har slutfört bedömningen till minst ${completion_threshold}% kommer du att kunna skapa en rapport.

source: request_an_email_reminder
ca: restableix la teva contrasenya
de: setzen Sie Ihr Passwort zurück
et: lähtesta oma parool
hr: resetirajte svoju lozinku
it: reimposta la tua password
lv: atiestatīt savu paroli
no: tilbakestill passordet ditt
pt: redefinir sua senha
ro: resetați parola
sl: ponastavite svoje geslo
sv: återställ ditt lösenord

source: text_create_account
ca: ${link_register} si vols utilitzar OiRA.
de: ${link_register} wenn Sie OiRA nutzen möchten.
et: ${link_register} kui soovite OiRAt kasutada.
hr: ${link_register} ako želite koristiti OiRA.
it: ${link_register} se vuoi utilizzare OiRA.
lv: ${link_register}, ja vēlaties izmantot OiRA.
no: ${link_register} hvis du ønsker å bruke OiRA.
pt: ${link_register} se você gostaria de usar o OiRA.
ro: ${link_register} dacă doriți să utilizați OiRA.
sl: ${link_register}, če želite uporabljati OiRA.
sv: ${link_register} om du vill använda OiRA.

source: text_test_session
ca: ${link_test_session} si només vols tastar OiRA.
de: ${link_test_session} wenn Sie OiRA nur probieren möchten.
et: ${link_test_session} kui soovite OiRAt lihtsalt proovida.
hr: ${link_test_session} ako želite samo probati OiRA.
it: ${link_test_session} se vuoi solo assaggiare OiRA.
lv: ${link_test_session}, ja vēlaties tikai nogaršot OiRA.
no: ${link_test_session} hvis du bare vil smake på OiRA.
pt: ${link_test_session} se você apenas quer experimentar o OiRA.
ro: ${link_test_session} dacă doriți doar să gustați OiRA.
sl: ${link_test_session}, če želite le preizkusiti OiRA.
sv: ${link_test_session} om du bara vill prova OiRA.

source: tooltip_start_test_session
ca: Iniciar una nova sessió de prova
de: Eine neue Testsession starten
et: Alusta uut testimisseanssi
hr: Pokreni novu testnu sesiju
it: Inizia una nuova sessione di test
lv: Sāciet jaunu testa sesiju
no: Start en ny testøkt
pt: Iniciar uma nova sessão de teste
ro: Începeți o nouă sesiune de testare
sl: Začnite novo testno sejo
sv: Starta en ny testsession

source: verb_register
ca: Registra't
de: Registrieren
et: Registreeru
hr: Registriraj se
it: Registrati
lv: Reģistrēties
no: Registrer
pt: Registrar
ro: Înregistrați-vă
sl: Registriraj se
sv: Registrera

source: Questions
de: Fragen
et: küsimust
no: spørsmål
pt: Perguntas
ro: întrebări
sl: vprašanj

source: Quick Start
de: Schnellstart
et: Kiire algus
no: Hurtigstart
pt: Início rápido
ro: Pornire rapidă
sl: Hitri začetek
