Repository: pypi-data/pypi-mirror-403
Catalog: packages/dsetool.policy/dsetool_policy-1.0.3-py3-none-any.whl/dsetool/policy/locales/*/LC_MESSAGES/euphorie.po
Languages: ca, de, et, hr, it, lv, no, pt, ro, sl, sv

source: Seven questions will address your current practices with regard to dangerous substances and chemical products. If improvements are needed, you will immediately get tips and advice on what you need to do and on how you can do it as easily and efficiently as possible.
de: Sieben Fragen beschäftigen sich mit Ihren aktuellen Praktiken in Bezug auf gefährliche Stoffe und chemische Produkte. Wenn Verbesserungen notwendig sind, erhalten Sie sofort Tipps und Ratschläge, was Sie tun müssen und wie Sie dies so einfach und effizient wie möglich tun können.
et: Seitse küsimust käsitlevad teie praeguseid tavasid ohtlike ainete ja keemiliste toodete osas. Kui vajatakse parandusi, saate kohe nõuandeid ja soovitusi, mida peate tegema ning kuidas seda võimalikult lihtsalt ja tõhusalt teha.
no: Syv spørsmål vil adressere dine nåværende praksis med hensyn til farlige stoffer og kjemiske produkter. Hvis forbedringer er nødvendige, vil du umiddelbart få tips og råd om hva du trenger å gjøre og hvordan du kan gjøre det så enkelt og effektivt som mulig.
pt: Sete perguntas abordarão suas práticas atuais com relação a substâncias perigosas e produtos químicos. Se houver necessidade de melhorias, você receberá imediatamente dicas e conselhos sobre o que precisa fazer e como pode fazer isso da maneira mais fácil e eficiente possível.
ro: Șapte întrebări vor aborda practicile dumneavoastră actuale cu privire la substanțele periculoase și produsele chimice. Dacă sunt necesare îmbunătățiri, veți primi imediat sfaturi și recomandări despre ce trebuie să faceți și cum puteți face asta cât mai ușor și eficient posibil.
sl: Sedem vprašanj bo obravnavalo vaše trenutne prakse glede nevarnih snovi in kemičnih izdelkov. Če so potrebne izboljšave, boste takoj dobili nasvete in napotke, kaj morate storiti in kako to storiti kar se da preprosto in učinkovito.

source: This is an interactive questionnaire and the questions might change related to given answers. You can use the skip button if you are not sure about an answer yet and get back to the question later. You will also receive a report containing your answers, recommendations and advice.
de: Dies ist ein interaktiver Fragebogen und die Fragen könnten sich in Bezug auf gegebene Antworten ändern. Sie können die Überspringen-Taste verwenden, wenn Sie sich über eine Antwort noch nicht sicher sind und später zur Frage zurückkehren. Sie erhalten auch einen Bericht mit Ihren Antworten, Empfehlungen und Ratschlägen.
et: See on interaktiivne küsimustik ja küsimused võivad muutuda vastavalt antud vastustele. Kui te pole veel kindel vastuses, võite kasutada vahelejätmise nuppu ja naasta küsimuse juurde hiljem. Saate ka aruande, mis sisaldab teie vastuseid, soovitusi ja nõuandeid.
no: Dette er et interaktivt spørreskjema og spørsmålene kan endres i forhold til gitte svar. Du kan bruke hopp over-knappen hvis du ikke er sikker på et svar ennå og komme tilbake til spørsmålet senere. Du vil også motta en rapport som inneholder dine svar, anbefalinger og råd.
pt: Este é um questionário interativo e as perguntas podem mudar de acordo com as respostas dadas. Você pode usar o botão de pular se ainda não tiver certeza de uma resposta e voltar à pergunta mais tarde. Você também receberá um relatório contendo suas respostas, recomendações e conselhos.
ro: Acesta este un chestionar interactiv și întrebările s-ar putea schimba în funcție de răspunsurile date. Puteți folosi butonul de salt dacă nu sunteți încă sigur de un răspuns și puteți reveni la întrebare mai târziu. Veți primi de asemenea un raport care conține răspunsurile dumneavoastră, recomandări și sfaturi.
sl: To je interaktivni vprašalnik in vprašanja se lahko spremenijo glede na dane odgovore. Če si glede odgovora niste prepričani, lahko uporabite gumb za preskok in se kasneje vrnete na vprašanje. Prejeli boste tudi poročilo, ki vsebuje vaše odgovore, priporočila in nasvete.

source: Let's quickly check if this tool might be helpful for you&hellip;
de: Lassen Sie uns schnell überprüfen, ob dieses Tool für Sie hilfreich sein könnte&hellip;
et: Vaadakem kiiresti, kas see tööriist võiks teile kasulik olla&hellip;
no: La oss raskt sjekke om dette verktøyet kan være nyttig for deg&hellip;
pt: Vamos verificar rapidamente se esta ferramenta pode ser útil para você&hellip;
ro: Să verificăm rapid dacă acest instrument v-ar putea fi de ajutor&hellip;
sl: Hitro preverimo, ali bi vam to orodje lahko bilo v pomoč&hellip;

source: Do you use, handle or store chemical products or chemical substances at work? Such products will be labelled with one or more of the currently used hazard pictograms (black and white in red frames) depicted below.
de: Verwenden, handhaben oder lagern Sie chemische Produkte oder chemische Stoffe bei der Arbeit? Solche Produkte werden mit einem oder mehreren der derzeit verwendeten Gefahrenpiktogramme (schwarz und weiß in roten Rahmen) gekennzeichnet, die unten dargestellt sind.
et: Kas te kasutate, käsitsete või säilitate tööl keemiatooted või keemilised ained? Sellised tooted on märgistatud ühe või enama praegu kasutatava ohupiktogrammiga (mustvalge punases raamis), mis on kujutatud allpool.
no: Bruker du, håndterer eller lagrer du kjemiske produkter eller kjemiske stoffer på jobben? Slike produkter vil bli merket med ett eller flere av de nå brukte farepiktogrammene (svart og hvitt i røde rammer) som er avbildet nedenfor.
pt: Você usa, manuseia ou armazena produtos químicos ou substâncias químicas no trabalho? Tais produtos serão etiquetados com um ou mais dos pictogramas de perigo atualmente usados (preto e branco em molduras vermelhas) mostrados abaixo.
ro: Utilizați, manipulați sau depozitați produse chimice sau substanțe chimice la locul de muncă? Aproape toate astfel de produse sunt etichetate cu unul sau mai multe dintre pictogramele de pericol folosite în prezent (negru și alb în cadre roșii) reprezentate mai jos.
sl: Ali na delovnem mestu uporabljate, rokujete ali shranjujete kemične izdelke ali kemične snovi? Takšni izdelki bodo označeni z enim ali več trenutno uporabljenimi piktogrami za nevarnosti (črno-belem v rdečih okvirjih), prikazanimi spodaj.

source: Current hazard pictograms:
de: Aktuelle Gefahrenpiktogramme:
et: Praegused ohupiktogrammid:
no: Nåværende farepiktogrammer:
pt: Pictogramas de perigo atuais:
ro: Pictograme de pericol actuale:
sl: Trenutni piktogrami za nevarnosti:

source: Are you sure that you have no chemical products or substances labelled with a hazard pictogram? Examples of chemical products with such labels, which can be found in most workplaces, are detergents, adhesives and paints.
de: Sind Sie sicher, dass Sie keine chemischen Produkte oder Stoffe haben, die mit einem Gefahrenpiktogramm gekennzeichnet sind? Beispiele für chemische Produkte mit solchen Etiketten, die in den meisten Arbeitsstätten zu finden sind, sind Reinigungsmittel, Klebstoffe und Farben.
et: Kas olete kindel, et teil pole keemiatooted või ained, mis on märgistatud ohupiktogrammiga? Keemilised tooted, millel on sellised sildid ja mida võib leida enamikus töökohtades, on näiteks detergendid, liimid ja värvid.
no: Er du sikker på at du ikke har noen kjemiske produkter eller stoffer merket med et farepiktogram? Eksempler på kjemiske produkter med slike etiketter, som kan finnes på de fleste arbeidsplasser, er rengjøringsmidler, lim og maling.
pt: Tem certeza de que não tem produtos ou substâncias químicas etiquetados com um pictograma de perigo? Exemplos de produtos químicos com esses rótulos, que podem ser encontrados na maioria dos locais de trabalho, são detergentes, adesivos e tintas.
ro: Sunteți sigur că nu aveți produse sau substanțe chimice etichetate cu o pictogramă de pericol? Exemple de produse chimice cu astfel de etichete, care pot fi găsite în majoritatea locurilor de muncă, sunt detergenții, adezivii și vopselele.
sl: Ste prepričani, da nimate kemičnih izdelkov ali snovi, označenih s piktogramom za nevarnost? Primeri kemičnih izdelkov s takšnimi oznakami, ki jih lahko najdemo na večini delovnih mest, so detergenti, lepila in barve.

source: Could air pollution of any kind be generated, for example dust from grinding or sanding, combustion products such as exhausts and fumes, or degradation products from chemical products or hazardous waste?
de: Könnte eine Luftverschmutzung irgendeiner Art entstehen, zum Beispiel Staub beim Schleifen oder Sandstrahlen, Verbrennungsprodukte wie Abgase und Rauch oder Zersetzungsprodukte aus chemischen Produkten oder gefährlichen Abfällen?
et: Kas võib tekkida mingit tüüpi õhusaastet, näiteks jahvatamisest või lihvimisest tekkivat tolmu, põlemistooteid, nagu heitgaasid ja aurud, või keemiatoodete või ohtlike jäätmete lagunemissaadused?
no: Kunne luftforurensning av noe slag bli generert, for eksempel støv fra sliping eller slipting, forbrenningsprodukter som eksos og røyk, eller nedbrytningsprodukter fra kjemiske produkter eller farlig avfall?
pt: Poderia haver algum tipo de poluição do ar, por exemplo, poeira de moagem ou lixamento, produtos de combustão como gases de escape e fumaça, ou produtos de degradação de produtos químicos ou resíduos perigosos?
ro: Ar putea fi generată poluarea aerului, de orice fel, de exemplu praf din măcinare sau șlefuire , produse de combustie, cum ar fi gazele de eșapament și fumurile, sau produse de degradare provenite de la produse chimice sau deșeuri periculoase?
sl: Ali bi lahko prišlo do kakršnega koli onesnaženja zraka, na primer prahu pri brušenju ali peskanju, izdelkov izgorevanja, kot so izpuhi in hlapi, ali produktov razgradnje iz kemičnih izdelkov ali nevarnih odpadkov?

source: There is no need to continue with the survey.
de: Es ist nicht notwendig, die Umfrage fortzusetzen.
et: Uuringuga ei ole vaja jätkata.
no: Det er ikke nødvendig å fortsette med undersøkelsen.
pt: Não há necessidade de continuar com a pesquisa.
ro: Nu este nevoie să continuați cu sondajul.
sl: Ni potrebe nadaljevati z anketo.

source: It seems it would make sense for you to do this assessment.
de: Es scheint sinnvoll zu sein, dass Sie diese Bewertung vornehmen.
et: Tundub, et oleks mõttekas teha selline hindamine.
no: Det ser ut som det ville være fornuftig for deg å gjøre denne vurderingen.
pt: Parece que seria sensato para você fazer esta avaliação.
ro: Se pare că ar fi util pentru dumneavoastră să faceți această evaluare.
sl: Zdi se, da bi bilo smiselno, da opravite to oceno.

source: Click the start button below to begin the assessment.
de: Klicken Sie auf die Start-Taste unten, um die Bewertung zu beginnen.
et: Klõpsake allpool olevat start-nuppu, et alustada hindamist.
no: Klikk på startknappen nedenfor for å starte vurderingen.
pt: Clique no botão de início abaixo para começar a avaliação.
ro: Faceți clic pe butonul de start de mai jos pentru a începe evaluarea.
sl: Kliknite spodnji gumb za začetek ocene.

source: ${action-plan} In the fourth stage of the assessment you can decide what steps you will take to address the risks you have identified previously and what resources this might require. Based on this, a report will be automatically produced in the next step.
ca: ${action-plan} A la quarta fase de l'avaluació podeu decidir quins passos prendreu per abordar els riscos que heu identificat anteriorment i quins recursos podria requerir. En base a això, es generarà automàticament un informe a la següent fase.
de: ${action-plan} In der vierten Stufe der Bewertung können Sie entscheiden, welche Schritte Sie ergreifen werden, um die zuvor identifizierten Risiken anzugehen und welche Ressourcen dies möglicherweise erfordern wird. Auf dieser Basis wird im nächsten Schritt automatisch ein Bericht erstellt.
et: ${action-plan} Hindamise neljandas etapis saate otsustada, milliseid samme te võtate varem tuvastatud riskide käsitlemiseks ja milliseid ressursse see võiks nõuda. Selle põhjal koostatakse järgmises etapis automaatselt aruanne.
hr: ${action-plan} U četvrtoj fazi procjene možete odlučiti koje korake ćete poduzeti da biste se nosili s rizicima koje ste prethodno identificirali i kojih bi resursa to moglo zahtijevati. Na temelju toga, izvještaj će se automatski stvoriti u sljedećem koraku.
it: ${action-plan} Nella quarta fase della valutazione potrai decidere quali passi intraprenderai per affrontare i rischi che hai precedentemente identificato e quali risorse potrebbero essere necessarie. In base a questo, verrà automaticamente prodotto un rapporto nel passaggio successivo.
lv: ${action-plan} Ceturtajā novērtēšanas posmā jūs varat izlemt, kādus soļus veiksiet, lai risinātu iepriekš identificētos riskus, un kādi resursi tam varētu būt nepieciešami. Pamatojoties uz to, nākamajā solī automatiski tiks izveidots ziņojums.
no: ${action-plan} I den fjerde fasen av vurderingen kan du bestemme hvilke skritt du vil ta for å håndtere risikoene du har identifisert tidligere og hvilke ressurser dette kan kreve. Basert på dette vil en rapport automatisk bli produsert i neste trinn.
pt: ${action-plan} Na quarta etapa da avaliação, você pode decidir quais medidas tomará para resolver os riscos identificados anteriormente e quais recursos isso pode exigir. Com base nisso, um relatório será automaticamente produzido na próxima etapa.
ro: ${action-plan} În a patra etapă a evaluării, puteți decide ce măsuri veți lua pentru a aborda riscurile pe care le-ați identificat anterior și ce resurse ar putea fi necesare pentru acest lucru. Pe baza acestui lucru, în pasul următor se va genera automat un raport.
sl: ${action-plan} V četrti fazi ocene se lahko odločite, katere korake boste izvedli za reševanje tveganj, ki ste jih prej prepoznali in kateri viri bi bili potrebni. Na podlagi tega bo v naslednjem koraku samodejno ustvarjeno poročilo.
sv: ${action-plan} I det fjärde steget i bedömningen kan du bestämma vilka steg du kommer att ta för att hantera de risker du tidigare identifierat och vilka resurser detta kan kräva. Baserat på detta kommer en rapport automatiskt att produceras i nästa steg.

source: ${evaluation} Here you will be able to determine the level of risk attached to each of the items you identified as 'need to be addressed' in the 'Identification' stage.
ca: ${evaluation} Aquí podràs determinar el nivell de risc associat a cada un dels elements que has identificat com a 'necessitat d'abordar' a la fase 'Identificació'.
de: ${evaluation} Hier können Sie das Risikoniveau bestimmen, das jeder der von Ihnen als 'zu bearbeiten' identifizierten Punkte in der 'Identifikations' Phase aufweist.
et: ${evaluation} Siin saate määrata riskitaseme iga üksuse jaoks, mille määrasite 'vajab käsitlemist' 'tuvastamise' etapis.
hr: ${evaluation} Ovdje ćete moći odrediti razinu rizika povezanu sa svakom stavkom koju ste identificirali kao 'treba riješiti' u fazi 'Identifikacija'.
it: ${evaluation} Qui sarai in grado di determinare il livello di rischio associato a ciascuno degli elementi che hai identificato come 'necessario affrontare' nella fase 'Identificazione'.
lv: ${evaluation} Šeit jūs varēsiet noteikt riska līmeni katram objektam, ko esat identificējis kā 'nepieciešams risināt' 'identificēšanas' posmā.
no: ${evaluation} Her vil du kunne bestemme risikonivået knyttet til hver av elementene du identifiserte som 'må adresseres' i 'Identifikasjons' fasen.
pt: ${evaluation} Aqui você poderá determinar o nível de risco associado a cada um dos itens que identificou como 'precisa ser resolvido' na etapa de 'Identificação'.
ro: ${evaluation} Aici veți putea determina nivelul de risc asociat fiecărui dintre elementele pe care le-ați identificat ca 'necesitând atenție' în etapa 'Identificare'.
sl: ${evaluation} Tu boste lahko določili stopnjo tveganja, povezanega z vsakim od elementov, ki ste jih prepoznali kot 'potrebno obravnavati' v fazi 'Identifikacija'.
sv: ${evaluation} Här kommer du att kunna fastställa risknivån för varje av de punkter du identifierat som 'måste åtgärdas' i 'Identifierings' steget.

source: ${identification} OiRA will present a series of potential health and safety hazards or problems that could exist in your workplace. By answering the statements/questions with either yes or no, you state if such hazards or problems are present. You can also decide to leave a question unanswered and thus put it on hold to be answered at a later stage.
ca: ${identification} L'OiRA presentarà una sèrie de possibles perills i problemes de salut i seguretat laborals que podrien existir al vostre lloc de treball. En respondre les afirmacions/preguntes amb un sí o no, estat si aquests perills o problemes estan presents. També podeu decidir deixar una pregunta sense respondre i, per tant, posposar-la per respondre-la en una fase posterior.
de: ${identification} OiRA präsentiert eine Reihe von möglichen gesundheits- und sicherheitsrelevanten Gefahren oder Problemen, die an Ihrem Arbeitsplatz bestehen könnten. Indem Sie die Aussagen/Fragen mit Ja oder Nein beantworten, sagen Sie, ob solche Gefahren oder Probleme vorliegen. Sie können auch entscheiden, eine Frage unbeantwortet zu lassen und sie so für eine spätere Beantwortung aufzuheben.
et: ${identification} OiRA esitab teile võimalike tervise- ja ohutusohtude või probleemide loetelu, mis võivad teie töökohas esineda. Vastates avaldustele / küsimustele kas jah või ei, märkite, kas sellised ohud või probleemid on olemas. Samuti võite otsustada jätta küsimusele vastamata ja seega panna see hiljem vastamise ootele.
hr: ${identification} OiRA će iznijeti niz mogućih zdravstvenih i sigurnosnih rizika ili problema koji bi mogli postojati na vašem radnom mjestu. Odgovaranjem na izjave / pitanja s da ili ne, navodite postoje li takvi rizici ili problemi. Također možete odlučiti ostaviti pitanje neodgovoreno i tako ga staviti na čekanje da biste odgovorili u kasnijoj fazi.
it: ${identification} OiRA presenterà una serie di potenziali pericoli o problemi per la salute e la sicurezza che potrebbero esistere nel tuo luogo di lavoro. Rispondendo alle affermazioni/domande con sì o no, affermi se tali pericoli o problemi sono presenti. Puoi anche decidere di lasciare una domanda senza risposta e quindi metterla in attesa di essere risposta in un secondo momento.
lv: ${identification} OiRA piedāvās potenciālo veselības un drošības apdraudējumu vai problēmu sēriju, kas varētu pastāvēt jūsu darba vietā. Atbildot uz paziņojumiem / jautājumiem ar 'jā' vai 'nē', jūs norādāt, vai šādas briesmas vai problēmas pastāv. Varat arī izlemt atstāt jautājumu neatsaucotu un līdz ar to to atlikt, lai to atbildētu vēlāk.
no: ${identification} OiRA vil presentere en rekke potensielle helse- og sikkerhetsfarer eller problemer som kan eksistere på din arbeidsplass. Ved å svare på utsagnene/spørsmålene med enten ja eller nei, bekrefter du om slike farer eller problemer er til stede. Du kan også bestemme deg for å la et spørsmål være ubesvart og dermed sette det på vent for å bli besvart på et senere tidspunkt.
pt: ${identification} O OiRA apresentará uma série de potenciais perigos ou problemas de saúde e segurança que podem existir em seu local de trabalho. Respondendo às declarações/perguntas com sim ou não, você afirma se tais perigos ou problemas estão presentes. Você também pode decidir deixar uma pergunta sem resposta e, assim, colocá-la em espera para ser respondida em uma fase posterior.
ro: ${identification} OiRA va prezenta o serie de potențiale pericole sau probleme de sănătate și securitate în muncă care ar putea exista la locul vostru de muncă. Răspunzând la afirmațiile/întrebările fie cu da, fie cu nu, indicați dacă aceste pericole sau probleme există. De asemenea, puteți decide să lăsați o întrebare fără răspuns și astfel să o amânați pentru a fi răspunsă la un moment ulterior.
sl: ${identification} OiRA vam bo predstavila vrsto potencialnih zdravstvenih in varnostnih tveganj ali težav, ki bi lahko obstajala na vašem delovnem mestu. Z odgovorom na izjave/vprašanja z da ali ne, navajate ali so takšna tveganja ali težave prisotna. Lahko se tudi odločite, da vprašanje pustite neodgovorjeno in ga tako preložite na kasnejšo fazo.
sv: ${identification} OiRA kommer att presentera en rad potentiella arbetsmiljö- och säkerhetsrisker eller problem som kan finnas på din arbetsplats. Genom att svara på frågorna/uttalandena med antingen ja eller nej, anger du om sådana risker eller problem finns. Du kan också välja att lämna en fråga obesvarad och därmed skjuta upp den för att svara på den senare.

source: ${preparation} This gives you an overview of the particular assessment you are about to begin and can allow you to further customise the assessment to the specific nature of your business.
ca: ${preparation} Això us ofereix una visió general de l'avaluació específica que esteu a punt de començar i pot permetre-vos personalitzar encara més l'avaluació segons la naturalesa específica del vostre negoci.
de: ${preparation} Dies gibt Ihnen einen Überblick über die spezielle Bewertung, die Sie gerade beginnen werden und ermöglicht es Ihnen, die Bewertung weiter auf die spezifische Art Ihres Unternehmens abzustimmen.
et: ${preparation} See annab teile ülevaate konkreetsest hindamisest, mida hakkate alustama, ja võib võimaldada teil hindamist veelgi kohandada vastavalt oma äri eripärale.
hr: ${preparation} Ovo vam daje pregled specifične procjene koju upravo započinjete i može vam omogućiti da dalje prilagodite procjenu specifičnoj prirodi vašeg poslovanja.
it: ${preparation} Questo ti dà una panoramica della particolare valutazione che stai per iniziare e consente di personalizzare ulteriormente la valutazione in base alla specifica natura della tua attività.
lv: ${preparation} Tas sniedz jums pārskatu par konkrēto novērtējumu, kuru jūs drīzumā sāksiet, un ļauj jums tālāk pielāgot novērtējumu jūsu biznesa specifiskajai dabai.
no: ${preparation} Dette gir deg en oversikt over den spesifikke vurderingen du skal begynne på og kan tillate deg å ytterligere tilpasse vurderingen til din virksomhets spesifikke art.
pt: ${preparation} Isso lhe dá uma visão geral da avaliação específica que você está prestes a iniciar e pode permitir que você personalize ainda mais a avaliação para a natureza específica de seu negócio.
ro: ${preparation} Acest lucru vă oferă o prezentare generală a specificului evaluării pe care sunteți pe cale să o începeți și vă permite să personalizați evaluarea în funcție de specificul afacerii voastre.
sl: ${preparation} To vam daje pregled posebne ocene, ki jo nameravate začeti in vam omogoča nadaljnjo prilagoditev ocene specifični naravi vašega podjetja.
sv: ${preparation} Detta ger dig en överblick över den specifika bedömning du är på väg att börja med och kan göra det möjligt för dig att ytterligare anpassa bedömningen till din verksamhets specifika karaktär.

source: Answered
ca: Resposta
de: Beantwortet
et: Vastatud
hr: Odgovoreno
it: Risposto
lv: Atbildēts
no: Besvart
pt: Respondida
ro: Răspuns
sl: Odgovorjeno
sv: Besvarad

source: Choice
ca: Elecció
de: Auswahl
et: Valik
hr: Izbor
it: Scelta
lv: Izvēle
no: Valg
pt: Escolha
ro: Alegere
sl: Izbira
sv: Val

source: Content rules: Manage rules
ca: Regles de contingut: Gestió de regles
de: Inhalt Regeln: Regeln verwalten
et: Sisu reeglid: reeglite haldamine
hr: Pravila sadržaja: Upravljanje pravilima
it: Regole sui contenuti: Gestisci le regole
lv: Satura noteikumi: Pārvaldiet noteikumus
no: Innholdsregler: Administrer regler
pt: Regras de conteúdo: Gerenciar regras
ro: Regulile conținutului: Gestionați regulile
sl: Pravila vsebine: Upravljanje pravil
sv: Innehållsregler: Hantera regler
