Repository: pypi-data/pypi-mirror-403
Catalog: packages/dsetool.policy/dsetool_policy-1.0.3-py3-none-any.whl/dsetool/policy/locales/*/LC_MESSAGES/euphorie.po
Languages: ca, de, et, hr, it, lv, no, pt, ro, sl, sv

source: You do not need any kind of specific preparation to start using the tool, however you should take some time to think about who is going to carry out the risk assessment, how workers are going to be involved in the process, etc.
ca: No necessiteu cap tipus de preparació específica per començar a utilitzar l'eina, però hauríeu de prendre-vos un temps per pensar qui realitzarà l'avaluació de riscos, com es involucraran els treballadors en el procés, etc.
de: Sie benötigen keine spezifische Vorbereitung, um das Tool zu verwenden, sollten sich jedoch überlegen, wer die Risikobewertung durchführen wird, wie die Mitarbeiter in den Prozess eingebunden werden sollen usw.
et: Tööriista kasutamiseks ei pea te teatud ettevalmistuse tegema, kuid peaksite veidi mõtlema, kes hakkab riskihinnangu läbi viima, kuidas töötajad protsessis osalevad jne.
hr: Ne trebate nikakvu specifičnu pripremu da biste počeli koristiti alat, ali trebali biste razmisliti o tome tko će provesti procjenu rizika, kako će se radnici uključiti u proces itd.
it: Non hai bisogno di alcun tipo di preparazione specifica per iniziare a utilizzare lo strumento, tuttavia dovresti prenderti del tempo per pensare a chi svolgerà la valutazione del rischio, come saranno coinvolti i lavoratori nel processo, ecc.
lv: Lai sāktu izmantot rīku, nav nepieciešama nekāda īpaša sagatavošanās, tomēr jums vajadzētu padomāt, kurš veiks riska novērtējumu, kā darba ņēmēji tiks iesaistīti procesā utt.
no: Du trenger ikke noen form for spesifikk forberedelse for å begynne å bruke verktøyet, men du bør bruke litt tid på å tenke over hvem som skal utføre risikovurderingen, hvordan arbeidstakerne skal involveres i prosessen, osv.
pt: Você não precisa de nenhum tipo de preparação específica para começar a usar a ferramenta, no entanto, você deve reservar um tempo para pensar sobre quem vai realizar a avaliação de riscos, como os trabalhadores vão ser envolvidos no processo, etc.
ro: Nu aveți nevoie de niciun fel de pregătire specifică pentru a începe să utilizați instrumentul, totuși ar trebui să vă gândiți la cine va efectua evaluarea riscului, cum vor fi implicați lucrătorii în proces, etc.
sl: Ne potrebujete nobene posebne priprave, da začnete uporabljati orodje, vendar bi morali nekaj časa razmisliti, kdo bo izvajal oceno tveganja, kako bodo delavci vključeni v proces itd.
sv: Du behöver inte någon form av specifik förberedelse för att börja använda verktyget, men du bör ta dig lite tid att fundera över vem som kommer att utföra riskbedömningen, hur arbetstagarna kommer att involveras i processen, etc.

source: You have to make sure to be in possession of a printed, accurate and up-dated risk assessment (at any time).
ca: Heu de garantir que teniu una avaluació de riscos impresa, precisa i actualitzada (en qualsevol moment).
de: Sie müssen sicherstellen, dass Sie jederzeit im Besitz einer gedruckten, genauen und aktualisierten Risikobewertung sind.
et: Peate veenduma, et teil oleks väljatrükitud, täpne ja ajakohane riskihindamine (igal ajal).
hr: Morate se pobrinuti da posjedujete isprintanu, točnu i ažuriranu procjenu rizika (u bilo kojem trenutku).
it: Devi assicurarti di avere in possesso una valutazione del rischio stampata, accurata e aggiornata (in qualsiasi momento).
lv: Jums jāpārliecinās, ka jums ir izdrukāta, precīza un atjaunināta riska novērtējuma versija (jebkurā laikā).
no: Du må sørge for å ha en trykt, nøyaktig og oppdatert risikovurdering (til enhver tid).
pt: Você tem que garantir que está de posse de uma avaliação de risco impressa, precisa e atualizada (a qualquer momento).
ro: Trebuie să vă asigurați că dețineți o evaluare a riscului tipărită, exactă și actualizată (în orice moment).
sl: Prepričajte se, da imate v lasti natisnjeno, natančno in posodobljeno oceno tveganja (kadarkoli).
sv: Du måste vara säker på att du har en utskriven, korrekt och uppdaterad riskbedömning (när som helst).

source: choice_option_header
ca: Opció ${number}
de: Option ${number}
et: Valik ${number}
hr: Opcija ${number}
it: Opzione ${number}
lv: Opcija ${number}
no: Alternativ ${number}
pt: Opção ${number}
ro: Opțiunea ${number}
sl: Možnost ${number}
sv: Alternativ ${nummer}

source: choice_recommendation_header
ca: Recomanació ${number}
de: Empfehlung ${number}
et: Soovitus ${number}
hr: Preporuka ${number}
it: Raccomandazione ${number}
lv: Rekomendācija ${number}
no: Anbefaling ${number}
pt: Recomendação ${number}
ro: Recomandarea ${number}
sl: Priporočilo ${number}
sv: Rekommendation ${nummer}

source: description_report_completion_threshold
ca: Si us plau, introdueix el percentatge de completitud per sobre del qual l'informe està disponible en aquesta eina. L'usuari no podrà veure ni descarregar un informe fins que l'avaluació s'hagi completat fins al percentatge donat. Introdueix “0” per tenir sempre l'informe disponible.
de: Bitte geben Sie den Fertigstellungsprozentsatz ein, ab dem der Bericht für dieses Tool verfügbar ist. Der Nutzer wird nicht in der Lage sein, einen Bericht zu betrachten oder herunterzuladen, bis die Bewertung bis zum angegebenen Prozentsatz abgeschlossen ist. Geben Sie “0” ein, um den Bericht immer verfügbar zu haben.
et: Sisestage protsent, millest alates on aruanne sellel tööriistal kättesaadav. Kasutajal ei ole võimalik aruannet vaadata ega alla laadida, kuni hindamine on läbi viidud antud protsendi ulatuses. Sisestage “0”, et aruanne oleks alati kättesaadav.
hr: Unesite postotak dovršenosti iznad kojeg će izvještaj biti dostupan na ovom alatu. Korisnik neće moći pregledavati ili preuzeti izvještaj dok se procjena ne dovrši do navedenog postotka. Unesite “0” da bi izvještaj uvijek bio dostupan.
it: Inserisci la percentuale di completamento sopra la quale il report è disponibile su questo strumento. L'utente non sarà in grado di visualizzare o scaricare un report fino a quando la valutazione non sarà completata nella percentuale specificata. Inserisci “0” per avere sempre il report disponibile.
lv: Lūdzu ievadiet izpildes procentu lielumu, pārsniedzot kuru, atskaite ir pieejama šajā rīkā. Lietotājs nevarēs apskatīt vai lejupielādēt atskaiti, līdz novērtējums ir pabeigts līdz norādītajam procentu apjomam. Ievadiet “0”, lai atskaite vienmēr būtu pieejama.
no: Vennligst oppgi fullførelsesprosenten over hvilken rapporten er tilgjengelig på dette verktøyet. Brukeren vil ikke kunne vise eller laste ned en rapport før vurderingen er fullført til den gitte prosenten. Skriv inn “0” for alltid å ha rapporten tilgjengelig.
pt: Por favor, insira a porcentagem de conclusão acima da qual o relatório estará disponível nesta ferramenta. O usuário não poderá visualizar ou baixar um relatório até que a avaliação seja concluída até a porcentagem dada. Digite “0” para sempre ter o relatório disponível.
ro: Vă rugăm să introduceți procentul de finalizare peste care raportul este disponibil în acest instrument. Utilizatorul nu va putea vizualiza sau descărca un raport până când evaluarea este finalizată până la procentul dat. Introduceți “0” pentru a avea întotdeauna raportul disponibil.
sl: Vnesite odstotek dokončanja, nad katerim je poročilo o tem orodju na voljo. Uporabnik ne bo mogel ogledati ali prenesti poročila, dokler ocena ni dokončana do navedenega odstotka. Vnesite \u201c0\u201d, da je poročilo vedno na voljo.
sv: Ange den slutförandeprocent över vilken rapporten är tillgänglig på detta verktyg. Användaren kommer inte att kunna se eller ladda ner en rapport förrän bedömningen har slutförts till den angivna procenten. Ange “0” för att alltid ha rapporten tillgänglig.

source: description_show_immediate_feedback
ca: Després que l'usuari hagi seleccionat una opció per a una elecció, mostra qualsevol recomanació associada abans de procedir a la següent elecció
de: Nachdem der Benutzer eine Option für eine Auswahl getroffen hat, zeigen Sie die zugehörigen Empfehlungen an, bevor Sie zur nächsten Auswahl übergehen
et: Pärast seda, kui kasutaja on valiku jaoks valiku teinud, kuvage enne järgmise valiku juurde liikumist kõik sellega seotud soovitused
hr: Nakon što korisnik odabere opciju za izbor, prikažite sve povezane preporuke prije prelaska na sljedeći izbor
it: Dopo che l'utente ha selezionato un'opzione per una scelta, mostra le eventuali raccomandazioni associate prima di passare alla scelta successiva
lv: Kad lietotājs ir izvēlējies kādu opciju, pirms pāriet pie nākamās izvēles parādīt visas saistītās rekomendācijas
no: Etter at brukeren har valgt et alternativ for et valg, vis eventuelle tilknyttede anbefalinger før du går videre til neste valg
pt: Depois que o usuário selecionou uma opção para uma escolha, mostre quaisquer recomendações associadas antes de prosseguir para a próxima escolha
ro: După ce utilizatorul a selectat o opțiune pentru o alegere, afișează orice recomandări asociate înainte de a trece la următoarea alegere
sl: Potem ko je uporabnik izbral možnost za izbiro, preden nadaljujete z naslednjo izbiro, prikažite vsa povezana priporočila
sv: Efter att användaren har valt ett alternativ för ett val, visa eventuella tillhörande rekommendationer innan du fortsätter till nästa val

source: email_reminder_intro
ca: Si voleu continuar utilitzant aquesta eina més endavant, us podem enviar un correu electrònic de recordatori amb un enllaç a aquesta avaluació.
de: Wenn Sie dieses Tool zu einem späteren Zeitpunkt weiterhin nutzen möchten, können wir Ihnen eine Erinnerungs-E-Mail mit einem Link zu dieser Bewertung senden.
et: Kui soovite seda tööriista hiljem kasutada, võime saata teile meeldetuletuse meilisõnumi, milles on link sellele hindamisele.
hr: Ako želite nastaviti koristiti ovaj alat u nekom kasnijem trenutku, možemo vam poslati podsjetnički e-mail s vezom na ovu procjenu.
it: Se desideri continuare a utilizzare questo strumento in un momento successivo, possiamo inviarti una mail di promemoria con un link a questa valutazione.
lv: Ja vēlaties turpināt izmantot šo rīku vēlāk, mēs varam nosūtīt atgādinājuma e-pastu ar saiti uz šo novērtējumu.
no: Hvis du ønsker å fortsette å bruke dette verktøyet på et senere tidspunkt, kan vi sende deg en påminnelse-e-post med en lenke til denne vurderingen.
pt: Se você gostaria de continuar usando esta ferramenta em um momento futuro, podemos lhe enviar um email lembrete com um link para esta avaliação.
ro: Dacă doriți să continuați să utilizați acest instrument într-un moment ulterior, vă putem trimite un e-mail de memento cu un link către această evaluare.
sl: Če bi želeli to orodje uporabljati kasneje, vam lahko pošljemo opomnik z e-pošto z povezavo do te ocene.
sv: Om du skulle vilja fortsätta använda detta verktyg vid en senare tidpunkt kan vi skicka dig en påminnelse via e-post med en länk till denna bedömning.

source: email_reminder_main
ca: Aquest és el vostre recordatori per continuar la vostra avaluació amb l'eina \
de: Dies ist Ihre Erinnerung daran, Ihre Bewertung mit dem Tool fortzusetzen \
et: See on teie meeldetuletus jätkata hindamist tööriistaga \
hr: Ovo je vaš podsjetnik za nastavak procjene s alatom \
it: Questo è il tuo promemoria per continuare la valutazione con lo strumento \
lv: Šis ir atgādinājums turpināt Jūsu novērtējuma darbības ar rīku
no: Dette er påminnelsen din om å fortsette din vurdering med verktøyet \
pt: Este é o seu lembrete para continuar sua avaliação com a ferramenta \
ro: Acesta este memento-ul dumneavoastră să continuați evaluarea cu instrumentul \
sl: To je opomnik, da nadaljujete z oceno z orodjem \
sv: Detta är din påminnelse om att fortsätta din bedömning med verktyget \

source: header_email_reminder
ca: Recordatori de correu electrònic
de: E-Mail-Erinnerung
et: E-kirja meeldetuletus
hr: Podsjetnik e-pošte
it: Promemoria email
lv: E-pasta atgādinājums
no: E-post påminnelse
pt: Email lembrete
ro: Memento prin e-mail
sl: Opomnik po e-pošti
sv: E-postpåminnelse

source: header_options
ca: Opcions
de: Optionen
et: Valikud
hr: Opcije
it: Opzioni
lv: Opcijas
no: Alternativer
pt: Opções
ro: Opțiuni
sl: Možnosti
sv: Alternativ

source: header_recommendations
ca: Recomanacions
de: Empfehlungen
et: Soovitused
hr: Preporuke
it: Raccomandazioni
lv: Rekomendācijas
no: Anbefalinger
pt: Recomendações
ro: Recomandări
sl: Priporočila
sv: Rekommendationer

source: header_register
ca: Registrar
de: Registrieren
et: Registreeri
hr: Registriraj se
it: Registrati
lv: Reģistrēties
no: Registrer deg
pt: Registrar
ro: Înregistrează-te
sl: Registracija
sv: Registrera

source: help_allow_multiple_options
ca: Si està actiu, es mostren caselles de verificació per permetre seleccionar més d'una opció. Altrament, es fan servir botons de ràdio per forçar una única selecció.
de: Wenn sie aktiv sind, werden Checkboxen angezeigt, die ermöglichen, mehr als eine Option auszuwählen. Andernfalls werden Radiobuttons verwendet, um eine einzelne Auswahl zu erzwingen.
et: Kui see on aktiivne, kuvatakse märkeruute, et lubada rohkem kui ühe valiku valimist. Vastasel juhul kasutatakse raadionuppe, et sundida ühte valikut.
hr: Ako je aktivno, prikazuju se okviri za odabir da bi se omogućio odabir više od jedne opcije. Inače se koriste radio gumbi za nametanje jednog odabira.
it: Se attivo, vengono mostrate delle caselle di controllo per consentire di selezionare più di un'opzione. Altrimenti, vengono utilizzati dei pulsanti radio per costringere a una singola selezione.
lv: Ja ir aktīvs, tiek rādītas izvēles rūtiņas, lai ļautu izvēlēties vairāk nekā vienu opciju. Pretējā gadījumā tiek izmantoti radio pogu lauki, lai piespiestu izvēlēties tikai vienu variantu.
no: Hvis aktiv, vises avmerkingsbokser for å tillate valg av mer enn ett alternativ. Ellers brukes radioknapper for å tvinge ett enkelt valg.
pt: Se ativo, caixas de seleção são mostradas para permitir selecionar mais de uma opção. Caso contrário, botões de rádio são usados para forçar uma única seleção.
ro: Dacă este activ, se afișează căsuțe de selectare pentru a permite selectarea mai multor opțiuni. În caz contrar, se utilizează butoane radio pentru a forța o singură selecție.
sl: Če je aktivno, so prikazani okvirji za potrditev, ki omogočajo izbiro več kot ene možnosti. Sicer se uporabljajo radio gumbi za narekovanje ene izbire.
sv: Om aktiva visas kryssrutor för att tillåta att flera alternativ väljs. Annars används radioknappar för att tvinga till ett enstaka val.

source: help_enable_email_reminder
ca: Ofereix enviar un recordatori de correu electrònic sobre aquesta eina
de: Angebot, eine E-Mail-Erinnerung zu diesem Tool zu senden
et: Paku saata meeldetuletusmeil selle tööriista kohta
hr: Ponudi slanje podsjetnika e-poštom o ovom alatu
it: Offri di inviare un promemoria email su questo strumento
lv: Piedāvāt nosūtīt e-pasta atgādinājumu par šo rīku
no: Tilby å sende en e-postpåminnelse om dette verktøyet
pt: Oferecer para enviar um lembrete por email sobre esta ferramenta
ro: Oferă să trimită un memento prin e-mail despre acest instrument
sl: Ponudite možnost pošiljanja opomnika po e-pošti o tem orodju
sv: Erbjuda att skicka en e-postpåminnelse om detta verktyg

source: help_logo_upload
ca: El logotip apareixerà a la pàgina de resum del sector del vostre país. Assegureu-vos que la vostra imatge és en format png, jpg o gif i que no conté cap caràcter especial. El nou logotip només es farà visible després que hagueu desat els vostres canvis i publicat l'eina OiRA.
de: Das Logo wird auf der Branchenübersichtsseite Ihres Landes erscheinen. Stellen Sie sicher, dass Ihr Bild im Format png, jpg oder gif vorliegt und keine Sonderzeichen enthält. Das neue Logo wird erst sichtbar, wenn Sie Ihre Änderungen gespeichert und das OiRA-Tool veröffentlicht haben.
et: Logo ilmub teie riigi sektori ülevaatelehele. Veenduge, et teie pilt on formaadis png, jpg või gif ja ei sisalda erimärke. Uus logo muutub nähtavaks pärast muudatuste salvestamist ja OiRA tööriista avaldamist.
hr: Logo će se pojaviti na stranici pregleda sektora vaše zemlje. Provjerite je li vaša slika formata png, jpg ili gif i da ne sadrži posebne znakove. Novi logo će postati vidljiv tek nakon što ste spremili promjene i objavili OiRA alat.
it: Il logo apparirà sulla pagina di panoramica del settore del tuo paese. Assicurati che la tua immagine sia in formato png, jpg o gif e che non contenga caratteri speciali. Il nuovo logo diventerà visibile solo dopo che avrai salvato le tue modifiche e pubblicato lo strumento OiRA.
lv: Logotips tiks rādīts Jūsu valsts nozaru pārskata lapā. Pārliecinieties, ka Jūsu attēls ir png, jpg vai gif formātā un nesatur īpašos simbolus. Jaunais logotips kļūs redzams tikai pēc tam, kad esat saglabājis savas izmaiņas un publicējis OiRA rīku.
no: Logoen vil vises på sektoroversiktssiden for landet ditt. Kontroller at bildet ditt er i formatet png, jpg eller gif og ikke inneholder spesielle tegn. Den nye logoen vil bare bli synlig etter at du har lagret endringene dine og publisert OiRA-verktøyet.
pt: O logotipo aparecerá na página de visão geral do seu setor no seu país. Certifique-se de que sua imagem está no formato png, jpg ou gif e não contém caracteres especiais. O novo logotipo só se tornará visível após você ter salvo suas alterações e publicado a ferramenta OiRA.
ro: Logo-ul va apărea pe pagina de prezentare a sectorului țării dumneavoastră. Asigurați-vă că imaginea este în format png, jpg sau gif și că nu conține caractere speciale. Noul logo va deveni vizibil numai după ce ați salvat modificările și ați publicat instrumentul OiRA.
sl: Logotip se bo pojavil na strani za pregled sektorja vaše države. Poskrbite, da bo vaša slika v formatu png, jpg ali gif in ne vsebuje posebnih znakov. Nov logotip bo viden šele, ko boste shranili spremembe in objavili orodje OiRA.
sv: Logotypen kommer att synas på sektoröversiktssidan för ditt land. Se till att din bild är av formatet png, jpg eller gif och inte innehåller några specialtecken. Den nya logotypen blir bara synlig efter att du har sparat dina ändringar och publicerat OiRA-verktyget.

source: help_module_recommendation
ca: Si aquest mòdul s'usa com a part d'una eina d'inventari, aquest text de recomanació es farà servir com a introducció a l'informe abans que es llisten les recomanacions individuals.
de: Wenn dieses Modul als Teil eines Inventarisierungstools verwendet wird, wird dieser Empfehlungstext als Einleitung in den Bericht vor den individuellen Empfehlungen aufgeführt.
et: Kui seda moodulit kasutatakse inventeerimistööriista osana, kasutatakse seda soovituse teksti aruandes sissejuhatuseks enne üksikute soovituste loetlemist.
hr: Ako se ovaj modul koristi kao dio alata za inventuru, ovaj tekst preporuke koristit će se kao uvod u izvještaj prije nego što se navedu pojedinačne preporuke.
it: Se questo modulo è utilizzato come parte di uno strumento di inventario, questo testo di raccomandazione sarà utilizzato come introduzione nel rapporto prima che vengano elencate le singole raccomandazioni.
lv: Ja šis modulis tiek izmantots kā inventarizācijas rīka daļa, šis ieteikumu teksts tiks izmantots kā ievads pārskatā pirms tiek uzskaitītas individuālās rekomendācijas.
no: Hvis denne modulen brukes som en del av et oversiktsverktøy, vil denne anbefalingsteksten bli brukt som introduksjon i rapporten før individuelle anbefalinger listes opp.
pt: Se este módulo é usado como parte de uma ferramenta de inventário, este texto de recomendação será usado como introdução no relatório antes das recomendações individuais serem listadas.
ro: Dacă acest modul este utilizat ca parte a unui instrument de inventar, acest text de recomandare va fi utilizat ca o introducere în raport înainte de a fi enumerate recomandările individuale.
sl: Če se ta modul uporablja kot del orodja za inventarizacijo, bo to priporočilo uporabljeno kot uvod v poročilo pred posameznimi priporočili.
sv: Om den här modulen används som en del av ett inventeringsverktyg kommer denna rekommendationstext att användas som en introduktion i rapporten innan enskilda rekommendationer listas.

source: help_password_requirements
ca: La contrasenya ha de tenir almenys 12 caràcters i ha de contenir almenys una lletra minúscula, una lletra majúscula i un dígit.
de: Das Passwort muss mindestens 12 Zeichen lang sein und muss mindestens einen Kleinbuchstaben, einen Großbuchstaben und eine Ziffer enthalten.
et: Parool peab olema vähemalt 12 tähemärki pikk ja sisaldama vähemalt ühte väiketähte, ühte suurtähti ja ühte numbrit.
hr: Lozinka mora biti dugačka najmanje 12 znakova i mora sadržavati najmanje jedno malo slovo, jedno veliko slovo i jednu znamenku.
it: La password deve essere lunga almeno 12 caratteri e deve contenere almeno una lettera minuscola, una maiuscola e un numero.
lv: Parolei jābūt vismaz 12 rakstzīmes garai un tajā jāietver vismaz viens mazais burts, viens lielais burts un viens cipars.
no: Passordet må være minst 12 tegn langt og må inneholde minst én liten bokstav, én stor bokstav og ett siffer.
pt: A senha precisa ter no mínimo 12 caracteres e deve conter pelo menos uma letra minúscula, uma letra maiúscula e um dígito.
ro: Parola trebuie să aibă cel puțin 12 caractere și să conțină cel puțin o literă mică, o literă mare și o cifră.
sl: Geslo mora biti dolgo najmanj 12 znakov in mora vsebovati vsaj eno malo črko, eno veliko črko in eno številko.
sv: Lösenordet måste vara minst 12 tecken långt och innehålla minst en liten bokstav, en stor bokstav och en siffra.

source: help_recommendation_text
ca: Text a incloure a l'informe
de: Im Bericht zu berücksichtigender Text
et: Aruandesse lisatav tekst
hr: Tekst koji treba biti uključen u izvještaju
it: Testo da includere nel rapporto
lv: Teksts, kas jāiekļauj pārskatā
no: Tekst som skal inkluderes i rapporten
pt: Texto a ser incluído no relatório
ro: Textul care trebuie inclus în raport
sl: Besedilo, ki bo vključeno v poročilo
sv: Text att inkludera i rapporten

source: home_link
ca: Tauler
de: Dashboard
et: Töölaud
hr: Nadzorna ploča
it: Cruscotto
lv: Informācijas panelis
no: Dashboard
pt: Painel
ro: Tabloul de bord
sl: Nadzorna plošča
sv: Kontrollpanel

source: incorrect_login
ca: El vostre nom d'usuari i/o contrasenya s'han introduït incorrectament. Si us plau, comproveu i torneu-ho a intentar o ${request_an_email_reminder}.
de: Ihr Benutzername und/oder Passwort wurden falsch eingegeben. Bitte prüfen Sie und versuchen Sie es erneut oder ${request_an_email_reminder}.
et: Teie sisselogimisnimi ja / või parool sisestati valesti. Palun kontrollige ja proovige uuesti või ${request_an_email_reminder}.
hr: Vaše korisničko ime i / ili lozinka su netočno uneseni. Provjerite i pokušajte ponovno ili ${request_an_email_reminder}.
it: Il tuo nome utente e/o password sono stati inseriti in modo errato. Per favore, controlla e prova di nuovo o ${request_an_email_reminder}.
lv: Jūsu lietotājvārds un/vai parole tika ievadīti nepareizi. Lūdzu, pārbaudiet un mēģiniet vēlreiz, vai ${request_an_email_reminder}.
no: Brukernavnet og/eller passordet ditt ble skrevet inn feil. Vennligst sjekk og prøv igjen, eller ${request_an_email_reminder}.
pt: Seu nome de usuário e/ou senha foram inseridos incorretamente. Por favor, verifique e tente novamente ou ${request_an_email_reminder}.
ro: Numele de utilizator și/sau parola au fost introduse incorect. Verificați și încercați din nou sau ${request_an_email_reminder}.
sl: Vaše uporabniško ime in/ali geslo sta bila napačno vnešena. Preverite in poskusite znova ali ${request_an_email_reminder}.
sv: Ditt användarnamn och/eller lösenord har angetts felaktigt. Kontrollera och försök igen eller ${request_an_email_reminder}.
