Repository: pypi-data/pypi-mirror-403
Catalog: packages/wagtail-reusable-blocks/wagtail_reusable_blocks-0.7.2-py3-none-any.whl/wagtail_reusable_blocks/locale/*/LC_MESSAGES/django.po
Languages: hu

source: Wagtail Reusable Blocks
hu: Wagtail Újrahasznosítható Blokkok

source: Maximum nesting depth exceeded
hu: Túllépték a maximális beágyazási mélységet

source: Preview Head Injection
hu: Fejlécek Előnézete

source: Image
hu: Kép

source: Select an image to display
hu: Jelölj ki egy képet a megjelenítéshez

source: Image with responsive format support
hu: Kép reszponzív formátum-támogatással

source: Select a layout template with slot placeholders
hu: Jelölj ki egy elrendezéssablont slot-helyekkel

source: Fill the slots in this layout template
hu: Töltsd ki a slotokat ebben az elrendezéssablonban

source: Reusable Layout
hu: Újrahasznosítható Elrendezés

source: Layout template with customizable content slots
hu: Elrendezéssablon testreszabható tartalomslotokkal

source: The slot identifier to fill (e.g., 'main', 'sidebar')
hu: A kitöltendő slot azonosítója (pl. 'main', 'sidebar')

source: Slot ID
hu: Slot-azonosító

source: Content to inject into this slot
hu: A slotba befecskendezendő tartalom

source: Slot Content
hu: Slot-tartalom

source: Slot Fill
hu: Slot Kitöltése

source: Fill a specific slot with content
hu: Tölts ki egy adott slotot tartalommal

source: Reusable Block
hu: Újrahasznosítható Blokk

source: name
hu: Név

source: Human-readable name for this reusable block
hu: Blokk olvasható neve

source: slug
hu: URL azonosító (slug)

source: URL-safe identifier, auto-generated from name
hu: Automatikusan névből generált URL barát azonosító

source: content
hu: Tartalom

source: The content of this reusable block
hu: Ennek az újrahasznosítható blokknak a tartalma

source: Reusable Blocks
hu: Újrahasznosítható Blokkok

source: Circular reference detected: Block '%(name)s' (id=%(id)s) references itself in the dependency chain.
hu: Körkörös hivatkozás észlelve: a '%(name)s' blokk (id=%(id)s) önmagára hivatkozik a függőségi láncban.

source: Circular reference detected: Block '%(name)s' references block '%(ref_name)s' which creates a cycle. %(error)s
hu: Körkörös hivatkozás észlelve: a '%(name)s' blokk a '%(ref_name)s' blokkra hivatkozik, ami ciklust hoz létre. %(error)s

source: Cache cleared for '%(name)s'.
hu: '%(name)s' gyorsítótára törölve lett.

source: All ReusableBlock cache entries have been cleared.
hu: Minden ÚjrahasznosíthatóBlokk gyorsítótár-bejegyzés törölve lett.

source: Clear Cache
hu: Gyorsítótár törlése
