Repository: pypi-data/pypi-mirror-403
Catalog: packages/anyencrypt/anyencrypt-0.5.0.tar.gz/anyencrypt-0.5.0/anyencrypt/locales/*/LC_MESSAGES/messages.po
Languages: es, ja

source: AnyEncrypt - 简单易用的加密解密命令行工具 支持文本和文件的加密解密操作。
es: AnyEncrypt - Herramienta CLI de cifrado/descifrado simple y fácil de usar Admite cifrado y descifrado de texto y archivos.
ja: AnyEncrypt - シンプルで使いやすい暗号化/復号化CLIツール テキストとファイルの暗号化/復号化をサポートします。

source: 加密文本或文件 示例： b # 加密文本 anyencrypt encrypt -t "Hello World" # 加密文件 anyencrypt encrypt -f input.txt -o encrypted.bin
es: Cifrar texto o archivo Ejemplos: b # Cifrar texto anyencrypt encrypt -t "Hello World" # Cifrar archivo anyencrypt encrypt -f input.txt -o encrypted.bin
ja: テキストまたはファイルを暗号化 例： b # テキストを暗号化 anyencrypt encrypt -t "Hello World" # ファイルを暗号化 anyencrypt encrypt -f input.txt -o encrypted.bin

source: 解密文本或文件 示例： b # 解密文本 anyencrypt decrypt -t "gAAAAAB..." # 解密文件 anyencrypt decrypt -f encrypted.bin -o decrypted.txt
es: Descifrar texto o archivo Ejemplos: b # Descifrar texto anyencrypt decrypt -t "gAAAAAB..." # Descifrar archivo anyencrypt decrypt -f encrypted.bin -o decrypted.txt
ja: テキストまたはファイルを復号化 例： b # テキストを復号化 anyencrypt decrypt -t "gAAAAAB..." # ファイルを復号化 anyencrypt decrypt -f encrypted.bin -o decrypted.txt

source: 交互式模式 - 引导用户完成加密/解密操作
es: Modo interactivo - guía al usuario en el cifrado/descifrado
ja: 対話モード - 暗号化/復号化の操作を案内します

source: 要加密的文本
es: Texto a cifrar
ja: 暗号化するテキスト

source: 要加密的文件路径
es: Ruta del archivo a cifrar
ja: 暗号化するファイルのパス

source: 输出文件路径（文件加密时使用）
es: Ruta del archivo de salida (se usa al cifrar archivos)
ja: 出力ファイルのパス（ファイル暗号化時に使用）

source: 加密密码（不建议使用，会在命令历史中留下记录）
es: Contraseña de cifrado (no recomendado, quedará en el historial)
ja: 暗号化パスワード（推奨しません。シェル履歴に残ります）

source: 请输入加密密码:
es: Introduzca la contraseña de cifrado:
ja: 暗号化パスワードを入力してください:

source: 请再次输入密码:
es: Vuelva a introducir la contraseña:
ja: もう一度パスワードを入力してください:

source: 错误: 两次输入的密码不一致
es: Error: Las contraseñas no coinciden
ja: エラー: 2回入力したパスワードが一致しません

source: 错误: 密码不能为空
es: Error: La contraseña no puede estar vacía
ja: エラー: パスワードは空にできません

source: 加密结果:
es: Resultado del cifrado:
ja: 暗号化結果:

source: ✓ 文件加密成功: {output}
es: ✓ Archivo cifrado correctamente: {output}
ja: ✓ ファイルの暗号化に成功しました: {output}

source: 错误: 请指定要加密的文本 (-t) 或文件 (-f)
es: Error: Especifique texto (-t) o archivo (-f) para cifrar
ja: エラー: 暗号化するテキスト(-t)またはファイル(-f)を指定してください

source: 错误: {error}
es: Error: {error}
ja: エラー: {error}

source: 要解密的文本
es: Texto a descifrar
ja: 復号化するテキスト

source: 要解密的文件路径
es: Ruta del archivo a descifrar
ja: 復号化するファイルのパス

source: 输出文件路径（文件解密时使用）
es: Ruta del archivo de salida (se usa al descifrar archivos)
ja: 出力ファイルのパス（ファイル復号化時に使用）

source: 解密密码（不建议使用，会在命令历史中留下记录）
es: Contraseña de descifrado (no recomendado, quedará en el historial)
ja: 復号化パスワード（推奨しません。シェル履歴に残ります）

source: 请输入解密密码:
es: Introduzca la contraseña de descifrado:
ja: 復号化パスワードを入力してください:

source: 解密结果:
es: Resultado del descifrado:
ja: 復号化結果:

source: ✓ 文件解密成功: {output}
es: ✓ Archivo descifrado correctamente: {output}
ja: ✓ ファイルの復号化に成功しました: {output}

source: 错误: 请指定要解密的文本 (-t) 或文件 (-f)
es: Error: Especifique texto (-t) o archivo (-f) para descifrar
ja: エラー: 復号化するテキスト(-t)またはファイル(-f)を指定してください

source: AnyEncrypt - 加密解密工具
es: AnyEncrypt - Herramienta de cifrado/descifrado
ja: AnyEncrypt - 暗号化/復号化ツール

source: 请选择操作类型:
es: Seleccione el tipo de operación:
ja: 操作の種類を選択してください:

source: [1] 加密
es: [1] Cifrar
ja: [1] 暗号化

source: [2] 解密
es: [2] Descifrar
ja: [2] 復号化

source: 请输入选项
es: Introduzca la opción
ja: オプションを入力してください

source: 错误: 无效的选项
es: Error: Opción no válida
ja: エラー: 無効なオプションです

source: 加密
es: Cifrar
ja: 暗号化

source: 解密
es: Descifrar
ja: 復号化

source: 请选择处理类型:
es: Seleccione el tipo de procesamiento:
ja: 処理タイプを選択してください:

source: [1] 文本
es: [1] Texto
ja: [1] テキスト

source: [2] 文件
es: [2] Archivo
ja: [2] ファイル

source: 请输入{operation}密码:
es: Introduzca la contraseña de {operation}:
ja: {operation}パスワードを入力してください:

source: 请输入要加密的文本
es: Introduzca el texto a cifrar
ja: 暗号化するテキストを入力してください

source: ✓ 加密成功!
es: ✓ ¡Cifrado exitoso!
ja: ✓ 暗号化に成功しました!

source: 加密结果:
es: Resultado del cifrado:
ja: 暗号化結果:

source: 请输入要解密的密文
es: Introduzca el texto cifrado a descifrar
ja: 復号化する暗号文を入力してください

source: ✓ 解密成功!
es: ✓ ¡Descifrado exitoso!
ja: ✓ 復号化に成功しました!

source: 解密结果:
es: Resultado del descifrado:
ja: 復号化結果:

source: 请输入要加密的文件路径
es: Introduzca la ruta del archivo a cifrar
ja: 暗号化するファイルのパスを入力してください

source: 错误: 文件不存在: {path}
es: Error: Archivo no encontrado: {path}
ja: エラー: ファイルが存在しません: {path}

source: 请输入输出文件路径
es: Introduzca la ruta del archivo de salida
ja: 出力ファイルのパスを入力してください

source: ✓ 文件加密成功: {path}
es: ✓ Archivo cifrado correctamente: {path}
ja: ✓ ファイルの暗号化に成功しました: {path}

source: 请输入要解密的文件路径
es: Introduzca la ruta del archivo a descifrar
ja: 復号化するファイルのパスを入力してください

source: ✓ 文件解密成功: {path}
es: ✓ Archivo descifrado correctamente: {path}
ja: ✓ ファイルの復号化に成功しました: {path}

source: 加密解密核心功能模块 使用 Fernet (对称加密) 进行加密和解密操作
es: Módulo central de cifrado/descifrado Usa Fernet (cifrado simétrico) para cifrar y descifrar
ja: 暗号化/復号化のコアモジュール Fernet（対称暗号）を使用して暗号化と復号化を行います

source: 从密码派生出32字节的密钥 使用 SHA-256 哈希算法
es: Derivar una clave de 32 bytes a partir de la contraseña Usa el algoritmo hash SHA-256
ja: パスワードから32バイトの鍵を導出 SHA-256 ハッシュアルゴリズムを使用

source: 内部辅助函数
es: Función auxiliar interna
ja: 内部ヘルパー関数

source: 加密文本 Args: text: 要加密的文本 password: 加密密码 Returns: 加密后的文本（Base64编码） Raises: Exception: 加密失败时抛出异常
es: Cifrar texto Args: text: Texto a cifrar password: Contraseña de cifrado Returns: Texto cifrado (codificado en Base64) Raises: Exception: Se lanza cuando falla el cifrado
ja: テキストを暗号化 Args: text: 暗号化するテキスト password: 暗号化パスワード Returns: 暗号化されたテキスト（Base64エンコード） Raises: Exception: 暗号化に失敗した場合に送出

source: 解密文本 Args: encrypted_text: 加密的文本 password: 解密密码 Returns: 解密后的原文本 Raises: Exception: 解密失败时抛出异常（可能是密码错误或数据损坏）
es: Descifrar texto Args: encrypted_text: Texto cifrado password: Contraseña de descifrado Returns: Texto original descifrado Raises: Exception: Se lanza cuando falla el descifrado (posible contraseña incorrecta o datos dañados)
ja: テキストを復号化 Args: encrypted_text: 暗号化されたテキスト password: 復号化パスワード Returns: 復号化された元のテキスト Raises: Exception: 復号化に失敗した場合（パスワード誤りまたはデータ破損の可能性）

source: 判断文件是否为可读文本文件 Args: data: 文件的二进制内容 max_size_mb: 最大文件大小限制(MB),默认10MB Returns: (是否为文本文件, 解码后的文本内容或空字符串)
es: Comprobar si un archivo es texto legible Args: data: Contenido binario del archivo max_size_mb: Límite máximo de tamaño de archivo (MB), por defecto 10MB Returns: (Si es un archivo de texto, contenido de texto decodificado o cadena vacía)
ja: ファイルが読み取り可能なテキストかどうかを判定 Args: data: ファイルのバイナリ内容 max_size_mb: 最大ファイルサイズ制限(MB)、デフォルト10MB Returns: (テキストファイルかどうか、デコードした内容または空文字列)

source: 加密文件 Args: input_path: 输入文件路径 output_path: 输出文件路径 password: 加密密码 Raises: FileNotFoundError: 输入文件不存在 Exception: 加密失败时抛出异常
es: Cifrar archivo Args: input_path: Ruta del archivo de entrada output_path: Ruta del archivo de salida password: Contraseña de cifrado Raises: FileNotFoundError: El archivo de entrada no existe Exception: Se lanza cuando falla el cifrado
ja: ファイルを暗号化 Args: input_path: 入力ファイルのパス output_path: 出力ファイルのパス password: 暗号化パスワード Raises: FileNotFoundError: 入力ファイルが存在しない Exception: 暗号化に失敗した場合に送出

source: 解密文件 Args: input_path: 加密的文件路径 output_path: 解密后的文件路径 password: 解密密码 Raises: FileNotFoundError: 输入文件不存在 Exception: 解密失败时抛出异常
es: Descifrar archivo Args: input_path: Ruta del archivo cifrado output_path: Ruta del archivo descifrado password: Contraseña de descifrado Raises: FileNotFoundError: El archivo de entrada no existe Exception: Se lanza cuando falla el descifrado
ja: ファイルを復号化 Args: input_path: 暗号化されたファイルのパス output_path: 復号化後のファイルのパス password: 復号化パスワード Raises: FileNotFoundError: 入力ファイルが存在しない Exception: 復号化に失敗した場合に送出

source: 加密失败: {error}
es: Fallo al cifrar: {error}
ja: 暗号化に失敗しました: {error}

source: 解密失败: 密码错误或数据已损坏
es: Fallo al descifrar: contraseña incorrecta o datos dañados
ja: 復号化に失敗しました: パスワードが正しくないかデータが破損しています

source: 解密失败: {error}
es: Fallo al descifrar: {error}
ja: 復号化に失敗しました: {error}

source: 文件不存在: {path}
es: Archivo no encontrado: {path}
ja: ファイルが存在しません: {path}

source: 文件加密失败: {error}
es: Fallo al cifrar el archivo: {error}
ja: ファイルの暗号化に失敗しました: {error}

source: 解密失败: 密码错误或文件已损坏
es: Fallo al descifrar: contraseña incorrecta o archivo dañado
ja: 復号化に失敗しました: パスワードが正しくないかファイルが破損しています

source: 文件解密失败: {error}
es: Fallo al descifrar el archivo: {error}
ja: ファイルの復号化に失敗しました: {error}
