tamil_vowel_letters = ["அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ"]
tamil_vowel_unicode_symbols = ["ா", "ி", "ீ", "ு", "ூ", "ெ", "ே", "ை", "ொ", "ோ", "ௌ" ]
tamil_consonent_letters =["க","ங","ச","ஞ","ட","ண","த","ந","ப","ம","ய","ர","ல","வ","ழ","ள","ற","ன"]
tamil_autham_letter = "ஃ"
sanskrit_vowel_letters = ["ஶ", "ஜ", "ஷ", "ஸ", "ஹ", "க்ஷ"]
sanskrit_consonents_letters = ["ஶ்", "ஜ்", "ஷ்", "ஸ்", "ஹ்", "க்ஷ்"]
tamil_numerals = ["௦", "௧", "௨", "௩", "௪", "௫", "௬", "௭", "௮", "௯", "௰""௱","௲"]
tamil_sym=["௳","௴","௵","௶","௷","௹","௺"]

tamil_hard_consonents = ["க்","ச்","ட்","த்","ப்","ற்"]
tamil_soft_consonents = ["ங்","ஞ்","ண்","ந்", "ம்","ன்"]
tamil_medium_consonents = []

TAMIL_SYMBOLS = ['௹']

TAMIL_NUMURALS = ["௦", "௧", "௨", "௩", "௪", "௫", "௬", "௭", "௮", "௯", "௰""௱","௲"]

TA_ROOT_CONSONENT = ["க","ங","ச","ஞ","ட","ண","த","ந","ப","ம","ய","ர","ல","வ","ழ","ள","ற","ன"]


TAMIL_ROOT_VOWEL = ["அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ"]


TAMIL_VOWEL_CHARS = ["ா", "ி", "ீ", "ு", "ூ", "ெ", "ே", "ை", "ொ", "ோ", "ௌ" ]


SA_ROOT_LETTERS = ["ஶ", "ஜ", "ஷ", "ஸ", "ஹ", "க்ஷ"]
