Repository: pypi-data/pypi-mirror-403
Catalog: packages/bazis-users/bazis_users-2.2.0-py3-none-any.whl/bazis/contrib/users/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Users
ru: Пользователи

source: Default user model
ru: Модель пользователя по умолчанию

source: Default anonymous user model
ru: Модель анонимного пользователя по умолчанию

source: OpenAPI token`s endpoint
ru: Эндпоинт для токена OpenAPI

source: JWT algorithm
ru: Алгоритм JWT

source: JWT lifetime
ru: Срок жизни JWT

source: user
ru: пользователь

source: users
ru: Пользователи

source: Credentials are invalid
ru: Учетные данные недействительны

source: Token expired
ru: Срок действия токена истек

source: Token is invalid
ru: Токен недействителен
