Repository: pypi-data/pypi-mirror-403
Catalog: packages/mkdocs-quiz/mkdocs_quiz-1.5.3-py3-none-any.whl/mkdocs_quiz/locales/*.po
Languages: eo, ja

source: Submit
eo: Sendi
ja: 送信

source: Question {n}
eo: Demando {n}
ja: 問題 {n}

source: Quiz Progress
eo: Kvizo-Progreso
ja: クイズの進捗

source: questions answered
eo: demandoj responditaj
ja: 回答済みの問題

source: correct
eo: ĝustaj
ja: 正解

source: Quiz Complete!
eo: Kvizo Finita!
ja: クイズ完了！

source: Reset quiz
eo: Restarigi kvizon
ja: クイズをリセット

source: Quiz results are saved to your browser's local storage and will persist between sessions.
eo: Kvizo-rezultoj estas konservitaj en la loka memoro de via retumilo kaj restos inter sesioj.
ja: クイズの結果はブラウザのローカルストレージに保存され、セッション間で保持されます。

source: Outstanding! You aced it!
eo: Elstare! Vi perfekte sukcesis!
ja: 素晴らしい！完璧です！

source: Great job! You really know your stuff!
eo: Bonega laboro! Vi vere konas vian aferon!
ja: よくできました！本当によく理解していますね！

source: Good effort! Keep learning!
eo: Bona klopodo! Daŭrigu lerni!
ja: よく頑張りました！学び続けましょう！

source: Not bad, but there's room for improvement!
eo: Ne malbona, sed estas loko por plibonigo!
ja: 悪くないですが、まだ改善の余地があります！

source: Better luck next time! Keep trying!
eo: Pli bona ŝanco venontfoje! Daŭrigu provi!
ja: 次回はもっと頑張りましょう！諦めずに！

source: Are you sure you want to reset the quiz? This will clear your progress.
eo: Ĉu vi certas, ke vi volas restarigi la kvizon? Tio forigos vian progreson.
ja: 本当にクイズをリセットしますか？進捗がクリアされます。

source: Try Again
eo: Reprovi
ja: もう一度

source: Correct answer!
eo: Ĝusta respondo!
ja: 正解です！

source: Incorrect answer. Please try again.
eo: Malĝusta respondo. Bonvolu reprovi.
ja: 不正解です。もう一度お試しください。

source: Incorrect answer.
eo: Malĝusta respondo.
ja: 不正解です。

source: Answered:
eo: Respondita:
ja: 回答済み:

source: Correct:
eo: Ĝusta:
ja: 正解:

source: Reset
eo: Restarigi
ja: リセット

source: (empty)
eo: (malplena)
ja: (空欄)
