Repository: pypi-data/pypi-mirror-403
Catalog: packages/fastapi-rtk/fastapi_rtk-1.0.23.tar.gz/fastapi_rtk-1.0.23/fastapi_rtk/lang/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Both 'order_column' and 'order_direction' must be filled or empty
de: Beide 'order_column' und 'order_direction' müssen ausgefüllt oder leer sein

source: Filters must be a list
de: Filter müssen eine Liste sein

source: Filter must be an object
de: Filter muss ein Objekt sein

source: Invalid filters: Not a valid JSON string
de: Ungültige Filters: Kein gültiger JSON-String

source: List {ModelName}
de: Liste von {ModelName}

source: Show {ModelName}
de: Anzeigen von {ModelName}

source: Add {ModelName}
de: Hinzufügen von {ModelName}

source: Edit {ModelName}
de: Bearbeiten von {ModelName}

source: Number of items in '{column}' does not match the number of items found.
de: Anzahl der Elemente in '{column}' stimmt nicht mit der Anzahl der gefundenen Elemente überein.

source: Could not find related item for column '{column}'
de: Konnte kein zugehöriges Element für die Spalte '{column}' finden

source: File type from '{filename}' is not allowed.
de: Dateityp von '{filename}' ist nicht erlaubt.

source: Invalid filter: {column}
de: Ungültiger Filter: {column}

source: Invalid filter operator: {operator}
de: Ungültiger Filteroperator: {operator}

source: Text contains
de: Text enthält

source: Equal to
de: Gleich zu

source: Starts with
de: Beginnt mit

source: Not Starts with
de: Nicht beginnt mit

source: Ends with
de: Endet mit

source: Not Ends with
de: Nicht endet mit

source: Contains
de: Enthält

source: Contains (insensitive)
de: Enthält (Groß- und Kleinschreibung nicht beachtend)

source: Not Contains
de: Nicht enthält

source: Greater than
de: Größer als

source: Smaller than
de: Kleiner als

source: Greater equal
de: Größer gleich

source: Smaller equal
de: Kleiner gleich

source: One of
de: Einer von

source: Global Filter
de: Globaler Filter

source: Not equal to
de: Nicht gleich zu

source: Between
de: Zwischen

source: Between filter requires 2 values
de: Der Zwischenfilter erfordert 2 Werte

source: Not In
de: Nicht in

source: Intersects
de: Schneidet sich

source: Not Intersects
de: Nicht schneidet sich

source: Overlaps
de: Überlappt

source: Not Overlaps
de: Nicht überlappt

source: Invalid ID: {id}, expected {count} values
de: Ungültige ID: {id}, erwartet {count} Werte

source: Invalid ID
de: Ungültige ID

source: User updated successfully.
de: Benutzer erfolgreich aktualisiert.
