Repository: pypi-data/pypi-mirror-403
Catalog: packages/geopic-tag-reader/geopic_tag_reader-1.8.1-py3-none-any.whl/geopic_tag_reader/translations/*/LC_MESSAGES/geopic_tag_reader.po
Languages: be, de, fr, nl, pt_br

source: Latitude:
be: Шырата:
de: Breitengrad:
nl: Breedtegraad:

source: Longitude:
be: Даўгата:
de: Längengrad:
nl: Lengtegraad:

source: Timestamp:
be: Метка часу:
de: Zeitstempel:
fr: Date et heure :
nl: Tijdstempel:
pt_br: Marca temporal:

source: Heading:
be: Напрамак:
de: Richtung:
fr: Orientation :
nl: Richtingshoek:
pt_br: Direção:

source: Type:
be: Тып:
de: Typ:
pt_br: Tipo:

source: Make:
be: Вытворца:
de: Hersteller:
fr: Fabriquant :
nl: Merk:
pt_br: Marca:

source: Model:
be: Мадэль:
de: Modell:
fr: Modèle :
pt_br: Modelo:

source: Focal length:
be: Факусная адлегласць:
de: Brennweite:
fr: Longueur focale :
nl: Brandpuntsafstand:
pt_br: Distância focal:

source: Crop parameters:
be: Параметры абрэзкі:
de: Zuschnittseinstellungen:
fr: Paramètres de recadrage :
nl: Bijsnijd parameters:
pt_br: Parâmetros de recorte:

source: Pitch:
be: Нахіл:
de: Neigung:
fr: Tangage :
pt_br: Arfagem:

source: Roll:
be: Крэн:
de: Rollwinkel:
fr: Roulis :
pt_br: Bancagem:

source: Warnings raised by reader:
be: Папярэджанні чытальніка:
de: Vom Leser gemeldete Warnungen:
fr: Avertissement lancés par le lecteur :
nl: Waarschuwingen van lezer:
pt_br: Avisos levantados pelo leitor:

source: Read latitude is out of WGS84 bounds (should be in [-90, 90])
be: Шырата па-за межамі WGS84 (павінна быць у дыяпазоне [-90, 90])
de: Ausgelesener Breitengrad liegt außerhalb der WGS84-Grenzen (muss in [-90,90] liegen)
fr: La latitude est hors des limites du WGS84 (devrait être entre [-90, 90])
nl: Gelezen breedtegraad is buiten WGS84-grenzen (moet binnen [-90, 90] liggen)
pt_br: A latitude lida está fora dos limites do WGS84 (deve estar entre [-90, 90])

source: Read longitude is out of WGS84 bounds (should be in [-180, 180])
be: Даўгата па-за межамі WGS84 (павінна быць у дыяпазоне [-180, 180])
de: Ausgelesener Längengrad liegt außerhalb der WGS84-Grenzen (muss in [-180,180] liegen)
fr: La longitude est hors des limites du WGS84 (devrait être entre [-180, 180])
nl: Gelezen lengtegraad is buiten WGS84-grenzen (moet binnen [-180, 180] liggen)
pt_br: A longitude lida está fora dos limites do WGS84 (deve estar entre [-180, 180])

source: Skipping Mapillary date/time as it was not recognized: {v}
be: Прапускаем дату/час Mapillary, бо яны не распазнаны: {v}
de: Überspringe Datum/Uhrzeit von Mapillary, weil sie nicht erkannt wurden: {v}
fr: Date et heure de Mapillary ignorées car non-reconnues : {v}
nl: Mapillary datum/tijd wordt overgeslagen omdat deze niet wordt herkend:{v}
pt_br: Ignorando a data/hora do Mapillary, pois não foi reconhecida: {v}

source: Contradicting heading values found, GPSImgDirection value is used
de: Widersprüchliche Richtungswerte gefunden, GPSImgDirection-Wert wird verwendet

source: No GPS coordinates or broken coordinates in picture EXIF tags
be: Адсутнічаюць GPS-каардынаты або яны пашкоджаныя ў EXIF тэгах выявы
de: Keine oder ungültige GPS-Koordinaten in den EXIF-Daten des Fotos
fr: Coordonnées GPS absentes ou invalides dans les attributs EXIF de l'image
nl: Geen GPS-coördinaten of ontbrekende coördinaten in EXIF-tags van foto's
pt_br: Sem coordenadas GPS ou coordenadas incorretas nas etiquetas EXIF da imagem

source: No valid date in picture EXIF tags
be: У EXIF тэгах выявы адсутнічае сапраўдная дата
de: Kein gültiges Datum in den EXIF-Daten des Fotos
fr: Aucune date valide dans les attributs EXIF de l'image
nl: Geen geldige datum in EXIF-tags van de foto
pt_br: Nenhuma data válida nas etiquetas EXIF da imagem

source: The picture is missing mandatory metadata:
be: Выяве не хапае абавязковых метаданых:
de: Dem Foto fehlen erforderliche Metadaten:
fr: Des métadonnées obligatoires sont manquantes :
nl: De foto mist verplichte metagegevens:
pt_br: A imagem não possui os metadados obrigatórios:

source: GPSLatitudeRef not found, assuming GPSLatitudeRef is North
be: GPSLatitudeRef не знойдзены, мяркуем што GPSLatitudeRef - Поўнач
de: GPSLatitudeRef nicht gefunden. Nutze Norden als GPSLatitudeRef
fr: GPSLatitudeRef non-trouvé, utilisation du Nord par défaut
nl: GPSLatitudeRef niet gevonden, aangenomen dat GPSLatitudeRef het noorden is
pt_br: GPSLatitudeRef não encontrado, assumindo que GPSLatitudeRef é Norte

source: Broken GPS coordinates in picture EXIF tags
be: Пашкоджаныя GPS каардынаты ў EXIF тэгах выявы
de: Ungültige GPS-Koordinaten in den EXIF-Daten des Fotos
fr: Coordonnées GPS invalides dans les attributs EXIF de l'image
nl: Ontbrekende GPS-coördinaten in EXIF-tags de van afbeelding
pt_br: Coordenadas GPS incorretas nas etiquetas EXIF da imagem

source: GPSLongitudeRef not found, assuming GPSLongitudeRef is East
be: GPSLongitudeRef не знойдзены, мяркуем што GPSLongitudeRef - Усход
de: GPSLongitudeRef nicht gefunden, nutze Osten als GPSLongitudeRef
fr: GPSLongitudeRef non-trouvé, utilisation de l'Est par défaut
nl: GPSLongitudeRef niet gevonden, aangenomen dat GPSLongitudeRef het oosten is
pt_br: GPSLongitudeRef não encontrado, assumindo que GPSLongitudeRef é Leste

source: Precise timezone information not found, fallback to UTC
be: Дакладная інфармацыя пра часавы пояс не знойдзена, пераходзім на UTC
de: Genaue Zeitzonen-Information nicht gefunden, Rückgriff auf UTC
fr: Aucune information précise de fuseau horaire trouvée, UTC utilisé par défaut
nl: Precieze tijdzone-informatie niet gevonden, terugvallen op UTC
pt_br: Informações precisas sobre o fuso horário não encontradas, usando UTC

source: Precise timezone information not found (and no GPS coordinates to help), fallback to UTC
be: Дакладная інфармацыя пра часавы пояс не знойдзена (і няма GPS-каардынат для дапамогі), пераходзім на UTC
de: Genaue Zeitzonen-Information nicht gefunden (und keine GPS-Koordinaten zum Erkennen einer möglichen Zeitzone vorhanden). Rückgriff auf UTC
fr: Aucune information précise de fuseau horaire trouvée (ni de coordonnées GPS pour aider), UTC utilisé par défaut
nl: Precieze tijdzone-informatie niet gevonden (en geen GPS-coördinaten om te helpen), terugvallen op UTC
pt_br: Informações precisas sobre o fuso horário não encontradas (e sem coordenadas GPS para ajudar), usando UTC

source: Skipping original date/time (from {datefield}) as it was not recognized: {v}
be: Прапускаем арыгінальную дату/час (з {datefield}), бо яны не распазнаны: {v}
de: Überspringe originales Datum/Zeit (aus {datefield}), weil es nicht erkannt wurde: {v}
fr: Date/heure originales (venant de {datefield}) ignorées car non-reconnues : {v}
nl: Oorspronkelijke datum/tijd (van {datefield}) overslaan omdat deze niet werd herkend: {v}
pt_br: Ignorando a data/hora original (de {datefield}) pois não foi reconhecida: {v}

source: GPSTimeStamp and GPSDateTime don't contain supported time format (in {group} group)
be: GPSTimeStamp і GPSDateTime не ўтрымліваюць падтрыманы фармат часу (у групе {group})
de: GPSTimeStamp und GPSDateTime enthalten kein unterstütztes Zeitformat (in Gruppe {group})
fr: GPSTimeStamp et GPSDateTime ne contiennent pas un format d'heure valide (dans le groupe {group})
nl: GPSTimeStamp en GPSDateTime bevatten geen ondersteunde tijdsindeling (in {group} groep)
pt_br: GPSTimeStamp e GPSDateTime não contêm o formato de hora suportado (no grupo {group})

source: Skipping GPS date/time ({group} group) as it was not recognized: {v}
be: Прапускаем GPS дату/час (група {group}), бо яны не распазнаны: {v}
de: Überspringe GPS Datum/Zeit (Gruppe {group}), da es nicht erkannt wurde: {v}
fr: Date/heure du GPS (groupe {group}) ignorées car non-reconnues : {v}
nl: GPS-datum/tijd ({group} groep) wordt overgeslagen omdat deze niet wordt herkend: {v}
pt_br: Ignorando data/hora do GPS (grupo {group}) pois não foi reconhecida: {v}

source: Microseconds read from decimal seconds value ({microsecondsFromSeconds}) is not matching value from EXIF field ({microseconds}). Max value will be kept.
be: Мікрасекунды, прачытаныя з дзесятковага значэння секунд ({microsecondsFromSeconds}), не супадаюць са значэннем з поля EXIF ({microseconds}). Будзе захавана максімальнае значэнне.
de: Die Mikrosekunden, die aus den Dezimalwerten der Sekunden gelesen wurden ({microsecondsFromSeconds}), stimmen nicht mit den Werten aus den EXIF-Daten ({microseconds}) überein. Maximaler Wert wird beibehalten.
fr: La valeur de micro-secondes lue à partir des secondes en valeurs décimales ({microsecondsFromSeconds}) ne correspond pas au champ EXIF dédié ({microseconds}). La valeur la plus élevée est conservée.
nl: Microseconden afgelezen uit decimale secondenwaarde ({microsecondsFromSeconds}) komt niet overeen met waarde uit EXIF-veld ({microseconds}). De maximumwaarde wordt behouden.
pt_br: Os microssegundos lidos a partir do valor decimal em segundos ({microsecondsFromSeconds}) não correspondem ao valor do campo EXIF ({microseconds}). O valor máximo será mantido.

source: Unsupported key in additional tags ({k})
be: Непадтрыманы ключ у дадатковых тэгах ({k})
de: Nicht unterstützter Schlüssel in den zusätzlichen Attributen ({k})
fr: Clé non-supportée dans les attributs additionnels ({k})
nl: Niet-ondersteunde sleutel in bijhorende tags ({k})
pt_br: Chave não suportada em etiquetas adicionais ({k})

source: Yaw:
be: Адхіленне:
de: Gierwinkel:
fr: Lacet :
pt_br: Guinada:

source: (Camera)
be: (Фотакамера)
de: (Kamera)
fr: (Caméra)
pt_br: (Câmera)

source: not set
be: не зададзена
de: nicht gesetzt
fr: pas défini
nl: niet ingesteld
pt_br: não definido

source: No focal length value was found, this prevents calculating field of view
be: Значэнне факуснай адлегласці не знойдзена, гэта перашкаджае разліку поля зроку
de: Keine Brennweite gefunden. Dies verhindert die Berechnung des Blickwinkels
fr: Aucune valeur pour la longueur focale (focal length) trouvée, cela empêche de calculer l'angle de vue horizontal
nl: Er is geen brandpuntsafstand gevonden, waardoor het gezichtsveld niet kan worden berekend
pt_br: Não foi encontrado nenhum valor de distância focal, o que impede o cálculo do campo de visão

source: No GPS horizontal positioning error value found, GPS accuracy can only be estimated
be: Значэнне памылкі гарызантальнага пазіцыянавання GPS не знойдзена, дакладнасць GPS можна толькі ацаніць
de: Keinen Fehlerwert für horizontale GPS-Positionierung gefunden. Die GPS-Genauigkeit kann nur geschätzt werden
fr: Aucune valeur d'erreur du positionnement horizontal du GPS, la précision du GPS pourra seulement être estimée
nl: Geen waarde voor horizontale GPS-positioneringsfout gevonden, GPS-nauwkeurigheid kan alleen worden geschat
pt_br: Não foi encontrado nenhum valor de erro de posicionamento horizontal do GPS, a precisão do GPS só pode ser estimada

source: No heading value was found, this reduces usability of picture
be: Значэнне напрамку не знойдзена, гэта пагаршае выкарыстальнасць выявы
de: Keinen Kompasskurs gefunden. Dies reduziert die Nutzbarkeit des Fotos
fr: Aucune valeur d'orientation (heading) trouvée, cela complique la réutilisation de la photo
nl: Er is geen richtingshoek gevonden, dit vermindert de bruikbaarheid van de afbeelding
pt_br: Não foi encontrado nenhum valor de direção, o que reduz a usabilidade da imagem

source: No GPS accuracy value found, this prevents computing a quality score
be: Значэнне дакладнасці GPS не знойдзена, гэта перашкаджае разліку адзнакі якасці
de: Keine GPS-Genauigkeit gefunden. Dies verhindert das Berechnen eines Qualitätswerts
fr: Aucune valeur trouvée pour la précision du GPS, cela empêche de calculer le score de qualité
nl: Geen GPS-nauwkeurigheidswaarde gevonden, hierdoor kan geen kwaliteitsscore worden berekend
pt_br: Não foi encontrado nenhum valor de precisão do GPS, o que impede o cálculo de uma pontuação de qualidade

source: No make and model value found, no assumption on focal length or GPS precision can be made
be: Не знойдзены вытворца і мадэль, немагчыма зрабіць здагадкі пра факусную адлегласць або дакладнасць GPS
de: Keinen Hersteller und Modell gefunden. Annahmen zu Brennweite oder GPS-Genauigkeit können nicht getroffen werden
fr: Aucune info sur le modèle de la caméra (make/model), aucune supposition ne peut être faite sur la longueur focale ou la précision du GPS
nl: Geen merk- en modelwaarde gevonden, er kan geen aanname worden gedaan over brandpuntsafstand of GPS-precisie
pt_br: Não foi encontrado nenhum valor de marca e modelo, não é possível fazer nenhuma suposição sobre a distância focal ou a precisão do GPS

source: GPS accuracy:
be: Дакладнасць GPS:
de: GPS-Genauigkeit:
fr: Précision GPS :
nl: GPS-nauwkeurigheid:
pt_br: Precisão do GPS:

source: Field of view:
be: Поле зроку:
de: Sichtbereich:
fr: Angle de vue :
nl: Gezichtsveld:
pt_br: Campo de visão:

source: Sensor width:
be: Шырыня сэнсара:
de: Sensorbreite:
fr: Longueur du capteur :
nl: Sensorbreedte:
pt_br: Largura do sensor:
